{
    "data": [
        {
            "author": [
                "3 min read",
                "Andrew Asmakov"
            ],
            "content": "Ethereum’s Merge Upgrade Goes Live Today on Ropsten Testnet - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsTechnologyEthereum’s Merge Upgrade Goes Live Today on Ropsten TestnetIn a historic move, Ethereum's longest-running testnet called Ropsten is transitioning to a proof-of-stake algorithm on Wednesday.\nBy Andrew AsmakovJun 8, 2022Jun 8, 20223 min readEthereum. Image: ShutterstockCreate an account to save your articles.Ethereum’s Merge—the blockchain’s much-anticipated transition from its current proof-of-work (PoW) mechanism to a proof-of-stake (PoS) consensus algorithm—will be one step closer today if the planned trial upgrade on the Ropsten public testnet goes as planned later today.\nFirst rolled out in 2016, Ropsten is Ethereum’s oldest testnet that allows for blockchain development testing before deployment on the mainnet. Similar to other testnets, it is identical to the mainnet, with the key difference that no “real” funds are at risk if any technical issues occur.\nThe date for the upgrade was first announced on May 18 when Ethereum core developer Terence Tsao broke the news that configuration for Ropsten’s Beacon Chain—a PoS network that runs alongside Ethereum's mainnet—had been merged and client releases should be expected soon.\n\nThings moved quickly after that, with another Ethereum developer, Tim Beiko, announcing the launch of a new beacon chain on May 30, and the Bellatrix upgrade—one of the two required conditions for the Ropsten testnet Merge—activated on June 2.\nThe developers also had to decide on the so-called “Terminal Total Difficulty” (TTD)—a pre-decided difficulty value at which the Ropsten Merge occurs, something they did the following day setting the value at 50 quadrillion.\nAs explained by Beiko, such a high value was chosen “because of the low PoW hash rate on testnets, and the risk of The Merge having happened before the network was ready with the Bellatrix update.”\n\n📣 Ropsten Merge Update 📣\nAs mentioned in the Ropsten Merge Announcement, the terminal total difficulty (TTD) at which The Merge happens on Ropsten must be overridden by node operators & stakers. \nThe correct TTD value is 50000000000000000 👀https://t.co/aPAWNJfDYh\n— Tim Beiko | timbeiko.eth 🐼 (@TimBeiko) June 3, 2022\n\nPer the Ethereum Foundation’s blog post, client software teams participating in the Ropsten Merge include Lighthouse, Lodestar, Prysm, Nimbus, Teku, Besu, Erigon, go-ethereum (geth) and Nethermind.\n\nWhat’s next?\nToday’s Ropsten Merge is a crucial step before Ethereum’s actual transition to the Consensus Layer (formerly known as ETH 2.0) slated for August this year.\nIn essence, it gives developers the first taste of what things will look like in the future when Ethereum finally makes the move to a less energy-intensive PoS algorithm mechanism. And it’s quite clear that a successful Merge on the testnet would bode well for the Ethereum’s mainnet’s own transition.\n\n“Merging Ropsten is a huge testing milestone towards Ethereum's mainnet Merge later this year,” Ethereum Core developer Preston van Loon wrote last month.\nThis process has been in the works for some years though, with multiple delays sending waves of frustration among the community and investors.\nThe new PoS model is supposed to solve some of Ethereum’s biggest issues, such as high transaction costs and the network’s ability to scale, so the stakes are indeed high, with the biggest upgrade in Ethereum’s history—if successful— having a good chance to become the crypto industry’s event of the year.\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102320/ethereum-merge-ropsten-live",
            "id": "064a1ba08b68860fe2d7b18a7c71686d",
            "img_src": "https://cdn.decrypt.co/resize/1536/wp-content/uploads/2021/08/ethereum-community-gID_1.jpg.webp",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Ethereum’s Merge Upgrade Goes Live Today on Ropsten Testnet"
        },
        {
            "author": [
                "2 min read",
                "Liam J. Kelly"
            ],
            "content": "Maker's Decentralized Stablecoin Is Coming to Cosmos Thanks to Umee - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsDeFiMaker's Decentralized Stablecoin Is Coming to Cosmos Thanks to UmeeThe industry’s fourth-largest stablecoin is coming to Cosmos following a collaboration between cross-chain protocol Umee and the Maker team.\nBy Liam J. KellyJun 8, 2022Jun 8, 20222 min readDAI is an algorithmic stablecoin pegged to the U.S. dollar. Image: ShutterstockCreate an account to save your articles.Following Terra’s $40 billion implosion last month, the Cosmos ecosystem is on the hunt for a new decentralized stablecoin. \nToday, the team at cross-chain protocol Umee announced DAI will be filling that gap. \n“The UST collapse made it absolutely clear that the Cosmos ecosystem needs a robust, safe stablecoin,” Umee’s CEO Brent Xu told Decrypt. “Looking ahead, Umee’s broader mission includes creating cross-chain stablecoins and adding Cosmos assets to MakerDAO.” \nUnlike Terra’s UST, DAI is an overcollateralized stablecoin with a market capitalization of $6.9 billion. It’s still magnitudes smaller than market leader Tether (USDT), but it’s also built a whole lot differently. \nIn order to mint, for example, $1 of DAI, you need to deposit up to $1.75 in Ethereum. A host of other cryptocurrencies are also eligible to be used as collateral, including Wrapped Bitcoin (WBTC), Uniswap (UNI), Polygon (MATIC), and others. \nEach collateral asset carries its own “minimum collateral ratio,” too, which dictates how much of said asset you need to put up to mint DAI. \nData dashboard DAI Stats indicates that the most popular collateral for minting Maker’s stablecoin is Circle’s USDC. This dominance has also drawn criticism to DAI’s claim of being a “decentralized” stablecoin, given how centralized USDC is.\nSource: DAI Stats.\nDAI is already integrated with over 20 different crypto networks, including Solana, Fantom, and Polygon, according to DeFi Llama. \nWhat is Umee?\nThough users will technically be leveraging Gravity Bridge, a connector between Cosmos and EVM-compatible blockchains, for their DAI transfers, Xu claims Umee is much more than just a bridge protocol.\n\"Other protocols use bridges to create wrapped assets—essentially a quantity of a blockchain’s native currency equivalent to the non-native asset. Umee is unlike these protocols,\" he told Decrypt. “Instead of building a bridge, we allow users to lend and collateralize, without creating any additional wrapped assets, to get exposure and participate in another ecosystem.\".\n\nIn plain terms, this means Umee is building out a tool that would let users lend and borrow typically non-compatible cryptocurrencies. \nThe idea has earned the attention of several notable investment groups too. \nLast June, Umee landed $6.3 million in backing from Coinbase Ventures, Polychain, and others. \nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102307/maker-decentralized-stablecoin-coming-cosmos-umee",
            "id": "6fee35623106c6a7b0dcac3432ea0efe",
            "img_src": "https://cdn.decrypt.co/resize/1536/wp-content/uploads/2021/11/dai-ethereum-backing-gID_2.jpg.webp",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Maker's Decentralized Stablecoin Is Coming to Cosmos Thanks to Umee"
        },
        {
            "author": [
                "2 min read",
                "Jason Nelson"
            ],
            "content": "Edge Releases First 'Confidential' Bitcoin Mastercard - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsCoinsEdge Releases First 'Confidential' Bitcoin MastercardWallet provider aims to empower the unbanked within the Bitcoin payment industry.\nBy Jason NelsonJun 8, 2022Jun 8, 20222 min readImage: ShutterstockCreate an account to save your articles.Edge, the company behind the popular Edge cryptocurrency wallet, today announced the launch of its new Confidential Mastercard that requires no KYC or personally identifiable information to use.\n\"Not a name, not a phone number, not an email address,\" Edge Co-founder and CEO Paul Puey tells Decrypt. \"Definitely not your actual address, nothing. You can create a virtual card in around 15 seconds inside of Edge.\"\nWhile privacy is key, Puey says economic empowerment is the defining principle behind the Edge Mastercard.\n\"I've known a handful of people that are unbanked; they simply cannot get a bank account for whatever reason,\" Puey says.\nThe new card is not only for Bitcoin. Puey tells Decrypt that users can sell Bitcoin Cash, Dogecoin, Litecoin, and Dash to fund their Edge Mastercard to shop at eligible merchants in the United States.\n\nAt launch, the Edge Mastercard will have a daily spend limit of $1,000 and can be used with Apple Pay with Samsung and Google Pay coming later. The option to order a physical card for $20 is coming later this month.\nTo fund their account, Edge customers sell their Bitcoin inside their wallet and send the USD to their Edge Mastercard to make purchases instead of sending the funds to a bank account.\nThere are no fees to add funds to a card, Puey adds, explaining that those who wish to shop at an online store can copy and paste their card's information and add a shipping/billing address to the order.\n\nEdge is the latest among Web3 companies making its way into the Bitcoin payments space for making everyday purchases. In April, Digital asset manager Nexo partnered with Mastercard to launch a Mastercard-backed crypto card in selected European markets. In December, Ledger announced the launch of a debit card that will let users spend their crypto directly or as collateral for cash purchases using the Ledger Live platform.\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102279/edge-releases-first-confidential-bitcoin-mastercard",
            "id": "2c41ee80f215027929e5f02e16b9e4fb",
            "img_src": "https://cdn.decrypt.co/resize/1536/wp-content/uploads/2022/06/Shopping-with-Charge-Card-gID_1.png.webp",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Edge Releases First 'Confidential' Bitcoin Mastercard"
        },
        {
            "author": [
                "3 min read",
                "Stacy Elliott"
            ],
            "content": "NFTs, Crypto Gaming Still Resilient After May Market Turbulence: DappRadar - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsGamingNFTs, Crypto Gaming Still Resilient After May Market Turbulence: DappRadarThe new report suggests that the NFT market could decouple from financial markets in the same way art has split from the S&P 500.\nBy Stacy ElliottJun 8, 2022Jun 8, 20223 min readImage: ShutterstockCreate an account to save your articles.Flagging markets and the Terra crash in May did not leave decentralized apps unscathed, but the ecosystem already appears to be staging a recovery, according to a new report from DappRadar.\nThe number of daily active unique wallets that interacted with dApps slid to 2.2 million last month, according to the report, down 5% from April. That's the lowest that figure has been this year, but still 32% higher than it was in May 2021, according to the report.\nBad-but-better-than-last-year seemed to be a theme across dApp categories, with NFTs and gaming having fared the best.\n\nOverall NFT market volume fell 45% to $10 billion, down from $18 billion in April. That was primarily due to the fact that blue-chip collections had a rough month.\nFor example, Bored Ape Yacht Club (BAYC) saw its floor price slide 38% during May, from 150 Ethereum to 93. But the loss has been a boon for newer collections like Otherdeeds, land parcels for the BAYC metaverse game, and Goblintown, which has done $31 million in trading volume since its launch.\n\"What we’re seeing right now is part of the evolution of the NFT market where new collections with intriguing factors are getting a lot of attention, draining liquidity from other projects and appraising themselves,\" senior blockchain analyst at Dapp Radar Pedro Herrara told Decrypt. \"This is the case of Goblintown, Otherside and recently launched We are all going to die.\"\n\n\"It feels like NFTs are becoming assets that could decouple from financial markets at some point,\" DappRadar wrote, drawing a comparison to the fact that the Artprice100 index dipped only 26% during the Great Recession of 2008 while the S&P 500 lost 56% of its value.\nCrypto gaming offers green shoots\nMeanwhile, the bright spot in gaming has been the flow of venture capital into the category.\nDapper Labs launched a $725 million fund to spur growth on its Flow ecosystem and Andreessen Horowitz's a16z launched its GAMES FUND ONE, which will invest $600 million in the metaverse gaming industry.\nAll the market turbulence meant that DeFi was the hardest hit dApp category, according to DappRadar. The total value locked (TVL) across DeFi apps dropped by 45% but was still up 11% compared to a year ago.\n\nThe report notes that Polygon, Near, Optimism, and Arbitrum appear poised to pick up market share as apps leaving the Terra ecosystem.\nMeanwhile, Justin Sun's Tron (TRX) was the only blockchain DappRadar tracks to experience growth in May, having increased its TVL by 47%.\nBy the end of May, Tron's Terra-like USDD algorithmic stablecoin had reached a market cap of $603 million. Already in the first week of June, it's added another $100 million for a total market cap of $703 million, according to CoinMarketCap.\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102292/nfts-gaming-still-resilient-may-market-turbulence-dappradar",
            "id": "4edeb08280a98e00c6676bb27a28e9bb",
            "img_src": "https://cdn.decrypt.co/resize/1536/wp-content/uploads/2021/11/gaming-crypto-blockchain-gID_6.jpeg.webp",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "NFTs, Crypto Gaming Still Resilient After May Market Turbulence: DappRadar"
        },
        {
            "author": [
                "3 min read",
                "Jason Nelson"
            ],
            "content": "How to Change the 'NFTs Are Bad' Narrative: UnicornDAO Co-Founder - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsNFTsHow to Change the 'NFTs Are Bad' Narrative: UnicornDAO Co-FounderRebecca Lamis believes negative narratives around NFTs can be quashed with education and in-person connection at places like the Quantum space in LA.\nBy Jason NelsonJun 8, 2022Jun 8, 20223 min readRebecca Lamis of UnicornDAO at the Quantum Art space in L.A. on June 3, 2022.Create an account to save your articles.As cryptocurrencies and NFTs surge in popularity, their environmental impact remains a reliable cudgel of critics.\nRebecca Lamis, the co-founder of UnicornDAO, sees projects like the new Quantum Art installation in Santa Monica, Calif., as a way to change the narrative.\n\"In a lot of ways, this space is becoming more mainstream,\" Lamis told Decrypt at the Quantum grand opening last Friday. \"NFTs have offered an opportunity to bring in communities that have never considered this space.\"\nQuantum is located on the iconic 3rd Street Promenade and co-founded by NFT photographer Justin Aversano of \"Twin Flames\" fame. Lamis co-founded UnicornDAO with Pussy Riot's Nadya Tolokonnikova to support marginalized and underrepresented groups in Web3.\n\nUnpacking NFTs' PR problem\nNFTs are blockchain-based tokens that show ownership over digital or physical assets.\nAs the NFT market has risen, fallen, and risen again—and has often been represented by million-dollar monkey JPEGs—critics have dismissed them as stupid, a money grab, a scam, or an environmental scourge due to how much energy is used to maintain the Ethereum blockchain, on which most NFTs are minted.\nPoliticians have also lumped in NFTs with their concerns about crypto mining.\n\nNFTs have faced significant pushback in particular from the gaming community. In November, chat app Discord, which built its user base from gamers and is now also popular with crypto groups, halted plans to integrate crypto wallets following overwhelming outcry from users.\nIn December, game studio GSC Game World canceled plans to add NFTs to its \"S.T.A.L.K.E.R. 2\" title, and in February game developer Team17 canceled entirely its planned NFT game \"MetaWorms\" after gamers rejected the concept.\nLamis believes that despite the debate over NFTs, the conversation has allowed the space to grow further, as the general public is becoming curious and wants to learn more about NFTs and Web3.\nShe says that most of the people in Web3 she has worked with became active only in the last year, a sign the market is still in its very early innings.\n\n\"A lot of them are some of the most well-established artists globally, but they are making and generating more money from their art in one single [NFT] drop than they would traditionally do in a year,\" she said. \"And that's so powerful.\" She and Aversano hope to use Quantum as a space for in-person connection and also education; Lamis hopes to open more locations across the country.\n\"I'm thrilled and really interested to see how it plays out, and how we could potentially change the narrative of 'NFTs are bad' and 'NFTs are not eco-friendly,'\" Lamis says. \"I think there's a lot of impact we can do in that capacity.\"\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102287/how-change-nfts-are-bad-narrative-unicorndao-co-founder",
            "id": "f2c3f04017d19bcdae501812ff33bf87",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "How to Change the 'NFTs Are Bad' Narrative: UnicornDAO Co-Founder"
        },
        {
            "author": [
                "3 min read",
                "Sujith Somraaj"
            ],
            "content": "Cosmos-based DeFi Exchange Osmosis Hit by $5M Exploit - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsDeFiCosmos-based DeFi Exchange Osmosis Hit by $5M ExploitOsmosis, a decentralized exchange built on Cosmos, was hacked for roughly $5 million, forcing developers to halt the network.\nBy Sujith SomraajJun 8, 2022Jun 8, 20223 min readCrypto exploits are a common feature of the fast-growing industry. Image: Unsplash.Create an account to save your articles.Osmosis, a decentralized exchange built using CosmosSDK, has been exploited, draining its liquidity pools for approximately $5 million. \nDevelopers have halted the Osmosis blockchain to prevent further damage. \nThe decentralized exchange was stopped at roughly 10:49 pm EST today at a block height of 4,713,064, according to an announcement from Mintscan, an Osmosis block explorer.\nThe exploit happened just two blocks before the halt.\n“Liquidity pools were NOT completely drained,” tweeted the team after discovering the exploit. “Devs are fixing the bug, scoping the size of losses (likely in the range of ~$5M), and working on recovery.” \n\nLiquidity pools were NOT \"completely drained\".\nDevs are fixing the bug, scoping the size of losses (likely in the range of ~$5M), and working on recovery. \nMore info to come. https://t.co/WOu7MMgSUM\n— Osmosis 🧪 (@osmosiszone) June 8, 2022\n\nA user on Reddit warned the Osmosis developers about the critical bug in their decentralized exchange. The Reddit thread was later removed by the Osmosis moderator.\nAccording to the user, if you provide liquidity to liquidity pools, you would then be able to withdraw 50% more than your deposit without any bonding period (a period over which the funds are locked).\nOn-chain transactions show how one user repeatedly exploited this precise bug. \nThey began the exploit with just 26 OSMO tokens and made 13 more OSMO tokens in their first transaction. \nOne instance shows how they were able to provide liquidity of 101,230 OSMO (the native token of Osmosis) in a transaction made six hours ago. \nTransaction showing user adding liquidity. Source: Mintscan.\nThen, just 30 seconds later, the exploiter exited their position with 151,084 OSMO tokens, pocketing 50% profit.\nTransaction showing user removing liquidity. Source: Mintscan.\nThey then repeated this process at least 30 times, each time increasing his holdings by 50%. \nThe wallet raked in roughly 70,000 of Cosmos' native ATOM tokens out of the process (by swapping OSMO to ATOM), which is valued at approximately $600,000. They also transferred some of their OSMO profits to another address to repeat the same process.\nThe user repeated the process with numerous accounts. All told, the attacker made roughly $5 million from this bug.\n\nOsmosis token price action\nThe total value locked (TVL) on the Osmosis blockchain dropped 1% over the past 24 hours. TVL currently stands at $212.77 million, according to data from DefiLlama.\n\nOSMO is down 6.58% over the past day and trades at $1.07. \nThe native token hit an all-time high of $11.21 in March 2022, according to data from CoinMarketCap. It has since shed over 90% from that high in the last three months.\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102300/cosmos-based-defi-exchange-osmosis-hit-by-5m-exploit",
            "id": "ff1e1cc4436ada75d44a4dbd9a090d2e",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Cosmos-based DeFi Exchange Osmosis Hit by $5M Exploit"
        },
        {
            "author": [
                "3 min read",
                "Andrew Asmakov"
            ],
            "content": "Chainlink Hits Four-Week High Following Updated Staking Roadmap Release - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsCoinsChainlink Hits Four-Week High Following Updated Staking Roadmap ReleaseThe price of theLINK token soared to a four-week high following Chainlink's announcement of the staking launch in the second half of 2022.\nBy Andrew AsmakovJun 8, 2022Jun 8, 20223 min readChainlink is a decentralized oracle network. Image: ShutterstockCreate an account to save your articles.The price of LINK, the token underpinning the decentralized oracle network Chainlink, has soared to a daily high of $8.86 on Wednesday, a level last seen on May 10.\nThough a minor correction has brought LINK to $8.41 by press time, it still represents a solid increase of 10.42% over the past 24 hours, according to CoinMarketCap.\nThis also makes Chainlink's token one of the best-performing assets in the last day as the broader crypto market continues to experience bouts of volatility.\nWith a market capitalization of over $3.9 billion, Chainlink is currently the industry's 21st-largest digital currency.\n\nChainlink Economics 2.0\nLINK's latest price action follows the publication of its updated roadmap for the implementation of staking—a feature that would enable a system of rewards and penalties designed to incentivize the network's proper operation.\nFirst outlined in an April 2021 white paper and followed by a January 2022 teaser, the idea of earning passive income through staking on Chainlink revolves around giving the ecosystem participants, such as node operators and community members, the ability to increase the security guarantees of oracle services by backing them with staked LINK tokens.\nThe initial implementation of Chainlink, called v0.1, is projected for the second half of 2022 and will mark the beginning of Chainlink Economics 2.0, the project's \"new era of sustainable growth and security.\"\n\nStaking marks the start of #Chainlink Economics 2.0, a new era for the long-term security and sustainability of oracle networks.\nIn this update, we define the long-term goals, roadmap, and initial implementation of staking in the Chainlink Network.https://t.co/WJkoUzPA0i\n— Chainlink (@chainlink) June 7, 2022\n\nPointing to the deep integration of Chainlink's oracles with leading crypto applications, the company said that \"the increase in oracle security and user assurances brought about by staking will be key in helping the multi-chain smart contract economy scale to eventually secure multi-trillion-dollar markets across major global industries.\"\nAccording to Chainlink, the rollout of the staking mechanism will be similar to the deployment of Chainlink Price Feeds—the company's popular price oracle network for decentralized finance (DeFi) applications.\nThe latter started with a single price feed for ETH/USD operated by three oracle nodes and grew to support almost a thousand price feeds powered by more than 50 node operators across twelve blockchains and layer-2 solutions.\nCurrently, Chainlink is trusted by some of the most valuable DeFi apps, including Aave, Compound, dYdX, Synthetix, Nexus Mutual, and more.\nThe most recent integration happened last week, with Solana adding support for Chainlink Price Feeds.\n\nChainlink staking rewards\nAccording to Chainlink, the initial staking pool will start with an aggregate size of 25 million LINK tokens, with the goal of expanding to 75 million tokens—based on demand—in the following months after the launch.\nThe v0.1 staking pool will also be capped in size, offering \"a fair entry mechanism […] to help ensure participation from a wide range of community members.\"\n\"This entry mechanism will aim to prioritize long-term token holders, who are most likely to actively participate in the alerting mechanism,\" said Chainlink.\n\nThe company added that \"stakers participating in the v0.1 release will have their staked LINK locked until at least the release of v1, where they will then be able to choose commitment periods of varying lengths.\"\nAside from that, separate allotments will be offered to node operators that actively service Chainlink Data Feeds.\nDisclaimerThe views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice.\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102294/chainlink-token-rallies-four-week-high-following-updated-staking-roadmap-release",
            "id": "4362581b5bae8656666fe62dddde7700",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Chainlink Hits Four-Week High Following Updated Staking Roadmap Release"
        },
        {
            "author": [
                "3 min read",
                "Sander Lutz"
            ],
            "content": "Caitlin Long's Crypto Bank Custodia Sues Fed Over 'Master Account' Delays - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessCaitlin Long's Crypto Bank Custodia Sues Fed Over 'Master Account' DelaysThe suit centers on the Fed’s 19-month delay in reviewing the crypto bank’s application, for a process that typically takes up to a week.\nBy Sander LutzJun 8, 2022Jun 8, 20223 min readCaitlin Long speaks on a DAO panel with Ryan Bubinski (L) and Yalor Mewn (R) at Camp Ethereal 2022 in Wyoming. (Photograph: Chie Endo)Create an account to save your articles.Custodia, the crypto bank founded by former Morgan Stanley managing director Caitlin Long, today sued the Federal Reserve for what it claims has been a \"patently unlawful delay\" in reviewing the bank’s application for a master account. \nCustodia, formerly known as Avanti, is one of a select number of businesses permitted under a Wyoming law to become Special Purpose Depository Institutions (SPDI), capable of conducting both crypto transactions and traditional banking services. \nHowever, crypto-friendly Wyoming’s authority only reaches so far: for a bank to wield such power, it needs a \"master account\" at the Federal Reserve.\nAll federally-chartered banks possess a master account, which allows for direct payments with and access to the Fed. Custodia applied to the Federal Reserve Bank of Kansas City for a master account 19 months ago. \nAccording to the lawsuit, they still haven’t heard back. \n\nThe lawsuit, filed against the Federal Reserve Board of Governors and the Federal Reserve Bank of Kansas City, claims that this delay has violated a one-year statutory deadline for approving such applications. In fact, the Fed’s application paperwork for a master account cites a typical turnaround time of five to seven business days.\nCustodia applied for their master account just after receiving their Wyoming bank charter in October 2020. Per the lawsuit, a representative of the Kansas City Fed then informed Custodia in early 2021 that the application was complete and featured \"no showstoppers.\"\nAnd yet, for Custodia, no decision came for all of 2021.\nFederal Reserve Chairman Jerome Powell testified during a Senate hearing in January that the abnormal delay in processing Custodia’s master account application — as well as that of Kraken, the San Francisco-based crypto exchange — was due to the \"hugely precedential\" nature of granting crypto companies traditional banking powers. \n\nAt that same hearing, Senator Cynthia Lummis (R-WY) argued such a tactic amounted to \"deny by delay\" and aimed to \"starv[e] the applicants until they die.\"\nNotably, Custodia’s application has also not been denied. Powell testified in January that there were \"good arguments\" for granting Custodia or Kraken a master account. And as recently as March 22, according to the lawsuit, a representative of the Kansas City Fed re-confirmed to Custodia that the company was “legally eligible for a master account.”\n\nCustodia charges fed with delays\nCustodia’s lawsuit today alleges that the Fed’s failure to act has cost the company greatly, requiring it to launch with a correspondent bank that possesses its own master account. Such an arrangement, according to Custodia’s attorneys, “eliminates much of the competitive benefit that Custodia would enjoy from using the charter that Wyoming granted it.”\nThe Kansas City Fed did not immediately respond to a request for comment on this story.\nIf Custodia’s application for a master account were to be approved, it would mark a major milestone in the integration of crypto into the American economy. \nCrypto businesses would be able to provide a suite of services offered by traditional banks to traditional businesses. The bank would also be able to provide simultaneous settlement of trades between digital assets and the dollar. \nToday’s suit requests the U.S. District Court for the District of Wyoming to intervene and compel the Fed to make a decision on Custodia’s application in the next thirty days.\nThe implications of the suit, and of the Fed’s impending decision, were not lost on the broader crypto community. As Charles Hoskinson, co-founder of the Cardano blockchain, tweeted this afternoon:\n\nThey have my full support. This is a fight for us all https://t.co/tGQxsE4zAD pic.twitter.com/antTl7T42K\n— Charles Hoskinson (@IOHK_Charles) June 7, 2022\n\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102285/caitlin-longs-crypto-bank-custodia-sues-fed-master-account-delays",
            "id": "b241e71bac3c4118e60b0a51f6b30959",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Caitlin Long's Crypto Bank Custodia Sues Fed Over 'Master Account' Delays"
        },
        {
            "author": [
                "3 min read",
                "Andrew Hayward"
            ],
            "content": "'Always Sunny' Actor Rob McElhenney Launches Web3 Writers Room With Ethereum NFTs - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsNFTs'Always Sunny' Actor Rob McElhenney Launches Web3 Writers Room With Ethereum NFTsThe “Always Sunny” star will co-create characters and stories and share in the royalties and revenue with NFT holders.\nBy Andrew HaywardJun 7, 2022Jun 7, 20223 min readActor Rob McElhenney is launching Web3 project Adim. Image: AdimCreate an account to save your articles.In brief\nAdim is a new Web3 entertainment company from actor and creator Rob McElhenney.\nThe startup will use decentralized writers’ rooms to develop IP and then share in future royalties or revenue with NFT-holding co-creators.\nThe Web3 world is built on a decentralized, collaborative ethos—and it’s pulling in creators from traditional media industries who want to try something new. Now, actor and filmmaker Rob McElhenney from hit TV series “It’s Always Sunny in Philadelphia” aims to use the tech to co-create content and share in the potential royalties ahead.\nAdim is McElhenney’s new “entertainment-tech” company, which will see the “Always Sunny” and “Mythic Quest” co-creator and star work alongside emerging creators to develop new characters and story ideas. The “Adimverse” will span original IP created by the participants, and those co-creators will benefit from future entertainment projects that tap into that IP.\n“Every beloved character throughout TV, movie, and gaming history has been imagined and brought to life through collaboration,” said McElhenney, in a release. “Adim is building for the next evolution of these groups—communities of creators, writers, artists, designers, developers, fans, and friends working together to create and own a new generation of content.”\nIn the initial format, 100 creators will be chosen from all applicants to join a virtual writer’s room with Adim co-founder and Co-Chairman McElhenney plus TV writer Keyonna Taylor. At the end of each session, all participants will receive a “Core Character” NFT that conveys a share of ownership over the IP that was developed in that cohort.\n\nCome do something weird with us at ⁦https://t.co/MRdpnHxudU @Adimverse⁩ pic.twitter.com/etfMoRuzrl\n— Rob McElhenney (@RMcElhenney) June 7, 2022\n\nUltimately, owners of those non-transferrable NFTs will be eligible to receive royalties or revenue share from any projects that use their co-created IP. While the Adimverse website doesn’t specifically note which blockchain network will be used for the NFTs, it mentions Ethereum gas fees (the costs associated with transacting on the Ethereum network) and cites Ethereum wallets like MetaMask and Rainbow.\nAn NFT is a blockchain token that serves as a proof of ownership to an item, and often represents digital goods like profile pictures, artwork, collectibles, and video game items. They can also work like ownership shares, as in this example and others—such as rapper Ice Cube’s BIG3 basketball league selling team ownership shares via NFTs.\n\nAdim has raised $5 million in seed funding in a round led by VC firm Andreessen Horowitz. General Partner Chris Dixon tweeted about the funding today.\n“Blockchains are social mediums. Composability gives artists the power to take assets & information generated by NFTs or protocols and use them anywhere on-chain,” Dixon wrote, in part. “Adimverse community members could fork characters created by users and build outward from the original Adim universe.”\n\nAlongside McElhenney, Adim was co-founded by serial entrepreneur Richard Rosenblatt alongside Chase Rosenblatt, Melissa Kaspers, and Spencer Marell. Richard Rosenblatt is also co-founder of Autograph, a sports and entertainment NFT company that includes NFL quarterback Tom Brady as a fellow co-founder.\nAdim’s board of advisors includes McElhenney’s wife and “Always Sunny” co-star Kaitlin Olson, as well as actor Ryan Reynolds, who co-owns Welsh soccer team Wrexham A.F.C. with McElhenney.\n\nThis isn’t the first Web3 project to take a stab at collaborative creation with an NFT component. Archie Comics, for example, recently revealed an Archieverse project that lets NFT owners take part in a large-scale writer’s room to develop comic book stories.\nLost Children of Andromeda, meanwhile, lets NFT collectors develop characters that may be used in author Jason Michael Primrose’s future sci-fi novels. Likewise, The Gimmicks—a project co-created by the studio of actress Mila Kunis—is a wrestling-themed animated series that lets NFT owners develop character and story details for the show.\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102270/always-sunny-rob-mcelhenney-adim-ethereum-nfts",
            "id": "7eb2a555cf5a62c39145d0de79735fd2",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "'Always Sunny' Actor Rob McElhenney Launches Web3 Writers Room With Ethereum NFTs"
        },
        {
            "author": [
                "2 min read",
                "Andrew Throuvalas"
            ],
            "content": "Binance US Launches High-Yield Crypto Staking for Solana, Avalanche and More - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessBinance US Launches High-Yield Crypto Staking for Solana, Avalanche and MoreThe current top staking option offers APY as high as 18%.\nBy Andrew ThrouvalasJun 7, 2022Jun 7, 20222 min readBinance is one of the world's biggest crypto exchanges. Image: ShutterstockCreate an account to save your articles.Binance US, the American affiliate of the world’s largest crypto exchange, is now offering cryptocurrency staking services to its clients—a move that the company expects will make it more competitive against other U.S.-based rivals, such as Coinbase.\nStaking services are now available to Binance US customers holding any of seven select proof-of-stake cryptocurrencies: Binance Coin (BNB), Solana (SOL), Avalanche (AVAX), Cosmos (ATOM), The Graph (GRT), Livepeer (LPT), and Audius (AUDIO). According to the company’s Twitter account, more options will be made available in the future.\nProof of stake is a consensus mechanism used by many blockchain networks that require users to lock up their coins for permission to validate the next block. When validating, these users typically earn a reward that is tied to the transaction fees collected from that block.\n\nThe more coins that users lock up, the better their chances are of validating a block and thus generating more rewards. However, many blockchains have minimum funding requirements, which means smaller holders need to pool their funds together if they want to earn rewards. Ethereum 2.0, for example, requires a minimum of 32 ETH (worth roughly $57,000 at the moment) to participate in staking.\nCryptocurrency exchanges have since emerged as one of the primary vehicles for users with less than the required minimum to participate in staking and earn rewards by joining a pool.\nBinance US’s service, much like that of its competitors Coinbase and Gemini, allows anyone to stake, with varying rates depending on the cryptocurrency chosen. While the company promises 6.4% annualized returns on its native BNB token, for example, it offers 18% APY for staking for Livepeer—a decentralized live video streaming network.\n\nThese rates, however, are subject to change, according to “estimates that are calculated based on the average staking rewards accrued over the past 90 days,” the company said.\nStaking on Binance US appears to lack a lock-up period, meaning stakers can unstake their coins at any time. It does, however, charge some commission for “facilitating all technical staking requirements.”\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102267/binance-us-high-yield-crypto-staking-solana-avalanche-more",
            "id": "3b898cdc5a1e39e4e6ea0efd4134b0d2",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Binance US Launches High-Yield Crypto Staking for Solana, Avalanche and More"
        },
        {
            "author": [
                "4 min read",
                "Andrew Hayward"
            ],
            "content": "Budweiser’s Clydesdales Zoom Into Ethereum NFT Racing Game Zed Run - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsNFTsBudweiser’s Clydesdales Zoom Into Ethereum NFT Racing Game Zed RunThe beer brand’s iconic horses will zip through digital races via NFTs, with competitions and other perks ahead for owners.\nBy Andrew HaywardJun 7, 2022Jun 7, 20224 min readBudweiser's horses are coming to Zed Run. Image: Zed RunCreate an account to save your articles.In brief\nBeer brand Budweiser has revealed a marketing and sponsorship deal with Zed Run, an Ethereum-based NFT horse racing game.\nBudweiser’s Clydesdale mascots will appear in the game, plus the companies will offer in-game competitions, exclusive merchandise, and more.\nBudweiser has charted a unique path through the NFT space—from buying the beer.eth ENS name to releasing its own collectibles and having Bud Light join a DAO and put NFT imagery into a Super Bowl ad. Now the beer brand is off to the races via a marketing deal with a notable crypto game.\nThis week, Budweiser announced plans to put the brand’s famed Clydesdale horses from past advertising campaigns into the Ethereum-based NFT horse racing game Zed Run. The game previously inked an alliance with beer brand Stella Artois, which like Budweiser is owned by Anheuser-Busch InBev.\nThrough the newly revealed deal, Budweiser will release in-game horse skins (or designs) based on its familiar Clydesdale mascots, as well as a Budweiser-themed race track in the game. The brands will also collaborate on in-game challenges, with $185,000 in total prize money committed, as well as exclusive co-branded merchandise.\n“Working creatively alongside Budweiser, an iconic brand that epitomizes the American dream, opens up more opportunities for our expanding Zed Run community,” said Chris Laurant, CEO and co-founder of Zed Run creator Virtually Human Studios, in a release.\n\nZed Run requires users to own an NFT racehorse to play. An NFT acts like a deed of ownership to an item, such as artwork, collectibles, or interactive video game goods. They can also serve as a membership pass to a community, a ticket to a live or virtual event, or a way to facilitate brand engagement campaigns like this one.\nZed Run will sell a Budweiser Pass NFT on June 9, with 2,500 NFTs available for purchase at a price of $225 apiece plus Ethereum network transaction fees. Collectors who own an existing Budweiser Heritage Can NFT and either a Zed Run Genesis NFT racehorse or a Zed Run NASCAR pass can gain early access to the sale before the public launch.\nBudweiser Pass NFT holders will then be airdropped a Budweiser Clydesdale skin in July, as well as a virtual t-shirt that can be worn by avatars in the Ethereum metaverse game, Decentraland.\n\nThe beer brand will also sponsor a pair of in-game challenges in July and August with a $45,000 prize pool for each, plus a December tournament that will offer up $95,000 in prize money and a free year-long supply of beer for a winner. Meanwhile, exclusive merchandise will be released for NFT holders in November.\nOnce the campaign is done in early 2023 and all promised utility fulfilled, Budweiser and Zed Run will offer a “burn-to-earn” incentive—a choice of as-yet-unrevealed rewards for “burning” or permanently destroying the Budweiser Pass NFT.\n\nBudweiser has made a number of moves in the NFT space since last fall, beginning with buying the beer.eth Ethereum Name Service name, which is akin to a web domain name that can be assigned to a crypto wallet.\nThe brand also used an NFT from the Tom Sachs: Rocket Factory project as its Twitter profile picture at the time. Soon thereafter, Budweiser released its own Heritage Can NFTs, which were billed as a “key to the Budverse” with various incentives and perks.\n\nBud Light followed suit with its own NFT passes, and then partnered with Ethereum NFT project Nouns to join its decentralized collective. As part of the deal, which was voted on by Nouns NFT owners and resulted in Budweiser receiving a free Noun—valued at $394,000 worth of ETH at the time—Bud Light put the “Nouns glasses” into its Super Bowl commercial in February.\nZed Run has generated more than $300 million worth of secondary market NFT trading volume to date, according to data from CryptoSlam. Last July, Virtually Human Studios raised $20 million in Series A funding from Andreessen Horowitz and others to continue development.\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102256/budweiser-ethereum-nft-racing-game-zed-run",
            "id": "93ad8ddd0cbcb2e160e67d09207a7f14",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Budweiser’s Clydesdales Zoom Into Ethereum NFT Racing Game Zed Run"
        },
        {
            "author": [
                "2 min read",
                "Kate Irwin"
            ],
            "content": "Coinbase Launches Database for People Whose Job Offers It Rescinded - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessCoinbase Launches Database for People Whose Job Offers It RescindedThe company was widely criticized after pulling job offers that it promised not to.\nBy Kate IrwinJun 7, 2022Jun 7, 20222 min readCoinbase. Image: ShutterstockCreate an account to save your articles.Coinbase has made a public database of people it was about to employ—but didn’t—after its hiring freeze included rescinding job offers.\nThe so-called Talent Hub is “a list of amazing people affected by the recent talent changes at Coinbase,” according to the company’s site. Former Coinbase candidates can self-submit their name, discipline, current company, and contact information.\nAt time of publication, nearly 350 individuals, mostly software engineers, had signed up.\nIf it seems strange Coinbase would compile a talent database that could be picked clean by competitors, that’s because it is. The announcement comes in the wake of massive backlash from accepted (and then rejected) candidates venting online about their rescinded offers. In some cases, those jobs were needed to maintain immigration status.\nOn Twitter, many took issue with Coinbase’s euphemistic phrasing of “hiring update” to refer to layoffs, a hiring freeze, and rescinded offers, with at least one calling the move “ruthless.”\n“Optics of this are HORRIBLE,” a Web3 developer said of the Talent Hub announcement.\n\n\"here's a list of people we fucked over, maybe you can help\" https://t.co/coit7H8xPP\n— Tom Zarebczan 📚 🧐 (@TomZarebczan) June 7, 2022\n\n“If there were a Pulitzer prize for most laughable corporate word mushery ‘hiring update’ would win hands down,” Stephen Palley, a legal partner at Anderson Kill, said in response to the news.\n“This is basically a rugpull victims list,” eric.eth wrote. “Wtf is going on over at Coinbase?”\nCopy linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102262/coinbase-launches-database-for-people-whose-job-offers-it-rescinded",
            "id": "63ab8ccd94f23b7ba4044e16368af687",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 8, 2022Jun 8, 2022",
            "title": "Coinbase Launches Database for People Whose Job Offers It Rescinded"
        }
    ],
    "length": 12,
    "timestamp": 1654707981.1111538
}