{
    "data": [
        {
            "author": [
                "CoinGape"
            ],
            "content": [
                "PRODUCTS",
                "CAMPAIGNS",
                "CALENDARS",
                "Share",
                "",
                "",
                "",
                "",
                "",
                "Share",
                "",
                "",
                "",
                "",
                "The Terra community on Monday released a new proposal on how the relaunched blockchain should deploy LUNA tokens to its vast developer pool.",
                "The proposal, called the “Proposed distribution method for 0.5% emergency LUNA allocation,” is intended to act as as supplement to the Terra Ecosystem Revival Plan.",
                "The revival plan designated a 10% LUNA supply to incentivize developers on Terra 2.0, of which 0.5% was an emergency fund to help project parties build products after the network launch.",
                "Monday’s proposal suggests that three groups are eligible for the 5 million in LUNA emergency allocation, these include:"
            ],
            "href": "https://coinmarketcap.com/headlines/news/heres-how-terra-plans-to-distribute-emergency-luna-funds/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/f2d55aac2ebd4b0bb6874167335dc787.png",
            "timestamp": "42 minutes ago",
            "title": "Here’s How Terra Plans To Distribute Emergency LUNA Funds"
        },
        {
            "author": [
                "Blockchain News"
            ],
            "content": [
                "Hong Kong startup BEAM+ LAB is hosting an interactive exhibition at the Haus of Contemporary from June 8 to 26 to celebrate the launch of CRYPTYQUES, non-fungible token (NFT) collectables based on classic Hong Kong movies.",
                "",
                "The organiser holds an exclusive opening ceremony today (June 6), while the public can join the event starting this Wednesday in HK. Meanwhile, The minting of NFTs is set to launch on June 18.",
                "The interactive exhibition will allow visitors to experience the connection between the physical world and web3.0 through the metaverse.",
                "Visitors can also be a part of a series of workshops, screenings and talks that aim to explore the metaverse community and discover the stories behind CRYPTYQUES.",
                "According to its statement, some of the highlights of the exhibition will include a fog screen projection showing CRYPTYQUES NFTs clippings, limited free posters featuring scenes from My Heart Is That Eternal Rose, 1989 (Chinese: 殺手蝴蝶夢) and Nomad, 1982 (Chinese: 烈火青春), and a pop-up café Zendo offering special coffee sleeves printed with the movie scenes for all coffee orders.",
                "Guests will also see a special screening of music scores performed by members of Hong Kong Hip-Hop group LMF and members of Hong Kong rock band Chochukmo (觸執毛) created for CRYPTYQUES, along with a photography exhibition of “Desire” NFTs, the first series of CRYPTYQUES collectable.",
                "Visitors can also join workshops, view a movie poster exhibition, and screenings of the 4K Remastered of Nomad. ",
                "One of the exhibitions, Raw Emotions X CRYPTYQUES collaboration, will be available for guests to purchase on-site.",
                "The concept behind CRYPTYQUES was introduced by Hong Kong-based photographer and director Wing Shya. ",
                "The initial drop is a collection of 1,320 NFTs of classic Hong Kong movie scenes from My Heart Is That Eternal Rose and Nomad. ",
                "The NFTs will reflect the strong emotional yearnings of “Desire” which have been recreated as 3D-animated video clips by Shya and an internationally-acclaimed Hollywood production team, using point cloud technology.",
                "CRYPTYQUES will be available in the format of mystery boxes, minting directly on the website (cryptyques.com), the price will be announced one week before the mint date.",
                "Some of these NFTs have ‘PASS’ properties and will receive AirDrop in the future. An exclusive 1/1 unique NFT will be auctioned in July.",
                "Subscribe now and get exclusive news, interviews and stories.",
                "\r\n                                With blockchain, we will put an end to the monopoly of government-issued currencies, as suggested in the title of Hayek’s work – “Denationalization of Money.” Blockchain will simplify the set of concepts revolving around financial services and the complexity of the IT systems. With blockchain, we will have a cryptocurrency that is more stable and safer than any currency that has ever existed before it. This will bring about true \"monetary and financial freedom.\" (Read More)\n",
                "- Kun Hu (CEO of Worldmoney)",
                "Subscribe today and get the latest news, exclusive interviews and analyses.",
                "Copyright © 2022 Blockchain News. All Rights Reserved.",
                "\r\n                        We use cookies to improve your user experience and our services. By clicking “Accept” or continuing to use our site, you agree to the terms of our Privacy Policy.\r\n                    "
            ],
            "href": "https://Blockchain.News/news/hong-kong-startup-beam-lab-exhibition-to-celebrate-launch-of-cryptyques-nft",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/c43fc9841b7a4dbd9f546be172a6825c.png",
            "timestamp": "44 minutes ago",
            "title": "Hong Kong Startup BEAM+ LAB's Exhibition to Celebrate Launch of CRYPTYQUES NFT"
        },
        {
            "author": [
                "AMBCrypto"
            ],
            "content": [
                "ETH 2.0 is coming and $950M worth of inflows suggest….",
                "The true story of what Algorand [ALGO] investors are doing in anticipation of rally",
                "Should Dogecoin [DOGE] investors prepare for another selloff",
                "Putting the ‘stable’ in stablecoins: How Djed & USDD are trying to make it big",
                "Solana: Mapping out profitable entry and exit triggers for SOL traders",
                "Is Bitcoin’s [BTC] consolidation at $30k setting up buying opportunity",
                "Why this analyst believes Bitcoin [BTC] could be the ‘best asset’ to own",
                "Why the ongoing bear market may be far better than you realize…",
                "Report: With European Bitcoin ETPs going strong, here’s what’s in store for BTC",
                "Bitcoin [BTC] holders should know this before exiting their position",
                "ETH 2.0 is coming and $950M worth of inflows suggest….",
                "Why this analyst believes Bitcoin [BTC] could be the ‘best asset’ to own",
                "Ethereum [ETH]: With the Merge just a few days away, here’s all you should know",
                "Why the ongoing bear market may be far better than you realize…",
                "Ethereum: What this development says about ETH stakeholders ahead of the Merge",
                "Published",
                "on",
                "By",
                "Currently Collateralized at Over 200% with a Guaranteed Minimum Collateral Ratio of 130%",
                "TRON-based USDD has joined the league of global crypto titans, surpassing several significant milestones in less than one month since its May 5 launch.",
                "The blockchain industry’s most distinctive trait is constantly evolving and transforming traditional sectors rapidly, bringing revolutionary technologies to the world and financial markets worldwide.",
                "USDD has continued to build since its launch, solidifying organic growth, and aspiring to advance the Stablecoin 3.0 era to make finance accessible to all. With a total circulating supply of nearly 700 million, the TRON-based USDD has recently upgraded itself to the first over-collateralized decentralized stablecoin (OCDS), offering faster transactions with the highest collateral ratio around the globe.",
                "As one of the most secure decentralized stablecoins, USDD enjoys a guaranteed collateral ratio of at least 130%, higher than the 120% set by DAI, which is considered a paragon of the industry. The real-time collateral ratio of USDD is published on the TRON DAO Reserve’s website, publicly available 24/7.",
                "While allowing the TRON DAO Reserve members to continue minting USDD by burning TRX, the upgrade consolidates USDD’s stability and credibility by over-collateralizing assets under the TRON DAO Reserve (TDR). These reserve assets would include BTC, TRX, and multiple stablecoins like USDC, USDT, TUSD, and USDJ, at a ratio of 130% to back the issuance of USDD. In other words, every USDD is supported by at least $1.3 worth of BTC, TRX, stablecoins, and potentially other highly liquid assets.",
                "The TRON DAO Reserve is currently holding 10,500 BTC, 240 million USDT, and 1.9 billion TRX in the reserve account, on top of the 8.29 billion TRX already in the burning contract. The real-time collateral ratio is now over 200% – a total $1.37 billion of assets backing the 667 million USDD in circulation.",
                "“Spearheading the Stablecoin 3.0 era, the upgraded, over-collateralized USDD will add more diversified features to underpin its stability,” said H.E. Justin Sun, Founder of TRON. “The $10 billion reserves pledged by the TDR will enable USDD to become the most reliable decentralized stablecoin with the highest collateral ratio in blockchain history. Currently, the 200%+ collateral ratio offers USDD a very strong safety net.”",
                "To power the over-collateralization of USDD, the TDR has greatly increased its reserves, including the highly liquid BTC, TRX, and USDT, to back USDD’s total supply. Users worldwide can access the information by querying on-chain contracts at any time, and the collateral ratio is transparently maintained.",
                "Stablecoins are the faucet of the blockchain industry, and it’s critical to ensure their security, transparency, efficiency, affordability, and scale, all of which criteria make USDD a highly desirable option. This upgrade has strengthened USDD, adding an extra layer of security to the token’s stability and risk tolerance in a way similar to how Maker powers DAI.",
                "The DAI token, supported by Maker, is one of the oldest and most resilient stablecoins in the DeFi field. Its success is an excellent example of the decentralization of stablecoins. USDD runs on TRON, one of the largest stablecoin networks. Millions of TRON users, as well as those leveraging the BTTC cross-chain solution, are experiencing the complete decentralization of stablecoins, which in turn shows how blockchain technology practically reaches the masses.",
                "So far, USDD has been circulating on TRON, Ethereum, and BNB Chain. It’s also embraced by numerous popular platforms, including SUN.io, Uniswap, PancakeSwap, Curve, Ellipsis, KyberSwap, Poloniex, Huobi Global, KuCoin, Gate.io, and Bybit. Industry leaders such as Alameda Research, Amber Group, Poloniex, Ankr, Mirana, Multichain, FalconX, and TPS Capital have already joined the TDR membership as a whitelisted institution, with more names soon to be announced.",
                "In addition, behind the TRON blockchain, thrives a vibrant community led by the TRON DAO, one of the largest DAOs in the world. As of June 2022, TRON has registered over 96 million user accounts, over $55 billion worth of assets stored on-chain, and an average daily transaction value of $10 billion across the network.",
                "In the near future, the TRON-based USDD will quickly embrace additional ecosystems and major applications. USDD will lead the way into a new era for stablecoins as it grows in supply and user adoption, ushering in the next stage of decentralization across the blockchain industry worldwide.",
                "About TRON DAO",
                "TRON is dedicated to accelerating the decentralization of the internet via blockchain technology and decentralized applications (dApps). Founded in September 2017 by H.E. Justin Sun, the TRON network has continued to deliver impressive achievements since MainNet launch in May 2018. July 2018 also marked the ecosystem integration of BitTorrent, a pioneer in decentralized Web3 services boasting over 100 million monthly active users. ",
                "The TRON network has gained incredible traction in recent years. As of June 2022, it has over 96 million total user accounts on the blockchain, more than 3.2 billion total transactions, and over $12.3 billion in total value locked (TVL), as reported on TRONSCAN. In addition, TRON hosts the largest circulating supply of USD Tether stablecoin (USDT) across the globe, overtaking USDT on Ethereum since April 2021. ",
                "TRON is also currently the third largest blockchain hosting the USD Coin (USDC) created by Circle. The TRON network completed full decentralization in December 2021 and is now a community-governed DAO. Most recently, the over-collateralized decentralized stablecoin USDD was launched on the TRON blockchain, backed by the first-ever crypto reserve for the blockchain industry, the TRON DAO Reserve, marking TRON’s official entry into decentralized stablecoins.",
                "Media Contact",
                "Feroz Lakhani\npress@tron.network",
                "RankerDao announces $100,000$+ buy back & burn streak of $RANKER in June",
                "Solana: Mapping out profitable entry and exit triggers for SOL traders",
                "With Masters in Mass communication and journalism, Anjali's interests lie in blockchain technology adoption across emerging economies.",
                "Your email address will not be published. Required fields are marked *",
                "Comment * ",
                "Name * ",
                "Email * ",
                "Website ",
                " Save my name, email, and website in this browser for the next time I comment.",
                " \n\n",
                "",
                "Δ",
                "Disclaimer: AMBCrypto's content is meant to be informational in nature and should not be interpreted as investment advice. Trading, buying or selling cryptocurrencies should be considered a high-risk investment and every reader is advised to do their own research before making any decisions. "
            ],
            "href": "https://ambcrypto.com/usdd-upgrades-into-the-first-over-collateralized-decentralized-stablecoin/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/082d421b11d443c7a39f0d3614c8049e.png",
            "timestamp": "an hour ago",
            "title": "USDD upgrades into the first over-collateralized decentralized Stablecoin"
        },
        {
            "author": [
                "Bitcoinist.com"
            ],
            "content": [
                "PRODUCTS",
                "CAMPAIGNS",
                "CALENDARS",
                "Share",
                "",
                "",
                "",
                "",
                "",
                "Share",
                "",
                "",
                "",
                "",
                "Nowadays, Gold and silver are being accepted as tokenized real-world assets by blockchain-based platforms. Blockchain-based digitization has taken currencies online, allowing us to make payments and transfer funds without ever touching them.",
                "Because of inflation, the value of any currency will not be the same after five years. As a result, finding the correct investing strategy to protect against inflation is critical.",
                "Gold, for example, has long been regarded as a buffer against inflation, and many people consider it an alternative currency.",
                "As an investment, gold is a reliable and secure asset. There have been several revolutions in global markets, especially digital assets, as the digital world has progressed.",
                "However, because currencies are constantly prone to inflation, long-term …"
            ],
            "href": "https://coinmarketcap.com/headlines/news/the-future-of-tokenization-of-real-world-assets-with-comtech-digital-gold-cgo/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/f2d55aac2ebd4b0bb6874167335dc787.png",
            "timestamp": "an hour ago",
            "title": "The Future of Tokenization of Real-world Assets With Comtech-Digital Gold (CGO)"
        },
        {
            "author": [
                "Cointelegraph.com News"
            ],
            "content": [
                "Please stand by, while we are checking your browser...",
                "Redirecting...",
                "Please enable Cookies and reload the page.",
                "Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.",
                "If you are on a personal connection, like at home, you can run an anti-virus scan on your device to make sure it is not infected with malware.",
                "If you are at an office or shared network, you can ask the network administrator to run a scan across the network looking for misconfigured or infected devices.",
                "\nCloudflare Ray ID: 7170046b3c11c6f4\n•\nYour IP: 103.253.89.23\n•\nPerformance & security by Cloudflare\n"
            ],
            "href": "https://cointelegraph.com/news/btc-price-snaps-its-longest-losing-streak-in-history-5-things-to-know-in-bitcoin-this-week",
            "img_src": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDYvMTg2YmVjNWItYWU2ZS00MjIwLTk2MTQtZjNhYzZmNDEwZDQ2LmpwZw==.jpg",
            "timestamp": "2 hours ago",
            "title": "BTC price snaps its longest losing streak in history — 5 things to know in Bitcoin this week"
        },
        {
            "author": [
                "Bitcoinist.com"
            ],
            "content": [
                "PRODUCTS",
                "CAMPAIGNS",
                "CALENDARS",
                "Share",
                "",
                "",
                "",
                "",
                "",
                "Share",
                "",
                "",
                "",
                "",
                "The metaverse space is still red-hot, even amidst a cooler market for crypto. Next Earth, the replica of Earth and platform-as-a-service, is the third-largest metaverse and one of the most promising projects in the space.",
                "The company has a strong team with a proven track record, a large and active community, and a clear vision for the future. Here are three reasons why $NXTT is in a bullish position.",
                "Looking at the NXTT price chart, we see that it launched at around $0.001 in late January, and now sits at around $0.0034, and was recently at $0.004.",
                "In the meantime, many other altcoins, particularly small-cap altcoins and ICO tokens, have seen their prices plummet by 80% or more. So, while $NXTT is down from its peak, it’s actually one of the …"
            ],
            "href": "https://coinmarketcap.com/headlines/news/3-reasons-why-nxtt-is-in-a-bullish-position/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/c43fc9841b7a4dbd9f546be172a6825c.png",
            "timestamp": "2 hours ago",
            "title": "3 reasons why $NXTT is in a bullish position"
        },
        {
            "author": [
                "AMBCrypto"
            ],
            "content": [
                "The true story of what Algorand [ALGO] investors are doing in anticipation of rally",
                "Should Dogecoin [DOGE] investors prepare for another selloff",
                "Putting the ‘stable’ in stablecoins: How Djed & USDD are trying to make it big",
                "Solana: Mapping out profitable entry and exit triggers for SOL traders",
                "STEPN: Amid reports of spam accounts and DDOS attacks, how are its tokens reacting",
                "Is Bitcoin’s [BTC] consolidation at $30k setting up buying opportunity",
                "Why this analyst believes Bitcoin [BTC] could be the ‘best asset’ to own",
                "Why the ongoing bear market may be far better than you realize…",
                "Report: With European Bitcoin ETPs going strong, here’s what’s in store for BTC",
                "Bitcoin [BTC] holders should know this before exiting their position",
                "Why this analyst believes Bitcoin [BTC] could be the ‘best asset’ to own",
                "Ethereum [ETH]: With the Merge just a few days away, here’s all you should know",
                "Why the ongoing bear market may be far better than you realize…",
                "Ethereum: What this development says about ETH stakeholders ahead of the Merge",
                "Ethereum’s [ETH] under-performance on the charts continue thanks to…",
                "Published",
                "on",
                "By",
                "Algorand investors are, in the truest sense, absolutely unpredictable because when investors of every other cryptocurrency were moving away from their investments, ALGO holders were heading headfirst into the asset. This, despite the altcoin itself treading the abyss.",
                "At the time of writing, Algorand was trading at $0.38. The last time the altcoin was at this level was 16 months ago, back in February 2021. ",
                "If this was the case with any other cryptocurrency, the network would see a decline in the presence of its holders. Algorand, however, might just be the exception to the rule. ",
                " Algorand price action  | Source: TradingView – AMBCrypto",
                "According to on-chain data, ALGO is somehow attracting more investors towards it. In fact, the network saw the arrival of 1.1 million new addresses in the week before the crash. ",
                "Although these were new investors, for Algorand, this is a mere recovery as the network had already lost 10.6 million holders. This figure accounted for 65% of all ALGO addresses.",
                " Algorand investors  | Source: Intotheblock – AMBCrypto",
                "Over the same time period, there were activity spikes as well. Between 2 May and 8 May, for instance, over 350k investors were actively participating on-chain. ",
                "This was a 1,160% hike from the average figure of 28k, which also suddenly disappeared as the market crashed.",
                " Algorand active investors  | Source: Intotheblock – AMBCrypto",
                "During the crash, ALGO, along with the rest of the market, was also knocked down. Here, the altcoin ended up losing almost 52% of its value. However, it seems like as the tides are changing. Investors are also anticipating profits in the coming few weeks.",
                "At the time of writing, more than 60k addresses were active on-chain, with the same rising since the end of May. Not only this, but holders are also actively accumulating as much ALGO as possible in preparation of the same. ",
                "Buy orders for the asset exceeded the sell orders by a margin of 2 million ALGO ($600k).",
                " Algorand buy and sell orders  | Source: Intotheblock – AMBCrypto",
                "These investors are probably expecting ALGO to recover its May losses and return to the prices before then and trade at $0.74. This can happen only when the altcoin marks a 92% rally (ref. Algorand price action).",
                "However, its high correlation of 0.89 with Bitcoin might act as a hurdle in this rally because if the king coin slips, it will drag down Algorand along with it. In doing so, it will crush its investors’ hopes.",
                " Algorand correlation to Bitcoin  | Source: Intotheblock – AMBCrypto",
                "",
                "\n",
                "Should Dogecoin [DOGE] investors prepare for another selloff",
                "Aaryamann is a freelance crypto journalist working with AMBCrypto. He is currently investing his time in the crypto-space. He has a keen interest in DeFi, the ever-expanding possibilities of blockchain technology, as well as the political impact they would have.",
                "Your email address will not be published. Required fields are marked *",
                "Comment * ",
                "Name * ",
                "Email * ",
                "Website ",
                " Save my name, email, and website in this browser for the next time I comment.",
                " \n\n",
                "",
                "Δ",
                " ",
                "Disclaimer: AMBCrypto's content is meant to be informational in nature and should not be interpreted as investment advice. Trading, buying or selling cryptocurrencies should be considered a high-risk investment and every reader is advised to do their own research before making any decisions. "
            ],
            "href": "https://ambcrypto.com/the-true-story-of-what-algorand-algo-investors-are-doing-in-anticipation-of-rally/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/082d421b11d443c7a39f0d3614c8049e.png",
            "timestamp": "2 hours ago",
            "title": "The true story of what Algorand [ALGO] investors are doing in anticipation of rally"
        },
        {
            "author": [
                "CryptoGlobe"
            ],
            "content": [
                "Binance, which is the world’s largest crypto exchange by trading volume, has raised $500 million for a fund that will invest in Web3 despite the current bear market.",
                "According to a report by CNBC published on June 1, Binance Labs, the venture capital arm of Binance, has “raised $500 million for its debut start-up fund, securing backing from venture capital firms DST Global and Breyer Capital as well as unnamed family offices and corporations.” ",
                "Despite the new funds appearing across the industry, the crypto markets appears to be entering a bear cycle. As noted in the report, Bitcoin has plunged more than 50% since reaching its all-time high near $69,000 last November. Coinbase, a leading U.S.-based exchange, has watched its shares decline 69% since the start of the year. ",
                "Ken Li, Binance Labs’ executive director of investments and M&A, told CNBC:",
                "“We are looking for projects with the potential to drive the growth of the Web3 ecosystem.”",
                "CNBC’s report pointed out that although Binance has “made a series of high-profile equity investments in the past year,” this marks “the first time the company has formally raised a VC fund with financing from external investors.”",
                "It is worth mentioning that Silicon Valley-based venture capital firm Andreessen Horowitz (“a16z”) announced on May 25 the launch of a $4.5 billion fund since they believe that “we are now entering the golden era of web3.”",
                "In its blog post, a16z said:",
                "“We think we are now entering the golden era of web3. Programmable blockchains are sufficiently advanced, and a diverse range of apps have reached tens of millions of users. More importantly, a massive wave of world-class talent has entered web3 over the last year. They are brilliant and passionate and want to build a better internet.",
                "“That’s why we decided to go big. We’ve been investing in crypto since 2013, and today we’re announcing our fourth crypto fund, totaling $4.5B. Of that, approximately $1.5B will be dedicated to seed investments, and $3B to venture investments. This brings our total crypto/web3 funds raised to over $7.6B.“",
                "To make sure you receive a FREE weekly newsletter that features highlights from our most popular stories, click here.",
                "The views and opinions expressed by the author, or any people mentioned in this article, are for informational purposes only, and they do not constitute financial, investment, or other advice. Investing in or trading cryptoassets comes with a risk of financial loss."
            ],
            "href": "https://www.cryptoglobe.com/latest/2022/06/bear-market-not-stopping-binance-from-investing-500m-into-web3-startups/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/f2d55aac2ebd4b0bb6874167335dc787.png",
            "timestamp": "2 hours ago",
            "title": "Bear Market Not Stopping Binance From Investing $500M Into ‘Web3’ Startups"
        },
        {
            "author": [
                "CoinGape"
            ],
            "content": [],
            "href": "https://coingape.com/web-stories/first-cybersecurity-firm-to-convert-its-balance-sheet-into-bitcoin/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/c43fc9841b7a4dbd9f546be172a6825c.png",
            "timestamp": "2 hours ago",
            "title": "First Cybersecurity Firm To Convert Its Balance Sheet Into Bitcoin"
        },
        {
            "author": [
                "Feed - Cryptopotato.Com"
            ],
            "content": [
                "Has bitcoin finally changed its price direction after closing its first week in the green following 9 consecutive ones in the red?",
                "After nine consecutive weeks of closing lower than the previous one, bitcoin finally managed to break this negative trend and marked its first green weekly candle since late March. This came as the asset jumped to and beyond $30,000 in the past 12 hours.",
                "It was at the end of March when the landscape around the primary cryptocurrency seemed significantly more bullish. At that point, bitcoin had added over $10,000 in two weeks and looked primed to challenge the coveted $50,000 line. However, what followed was precisely the opposite.",
                "Instead of heading further north, BTC started retracing, sometimes more gradually, sometimes more violently. Weeks later, it equaled a negative record in terms of consecutive weekly candles closed in the red (6). However, the streak continued, and bitcoin saw its 9th such candle in a row last week.",
                "The past seven days were more positive as BTC even spiked above $32,000 mid-week. Despite failing there and returning below $30,000, the cryptocurrency still managed to close the week above $29,250 (the closing price at the end of last week). As such, it saw its first weekly green candle since March 21st.",
                "Just hours after that, the situation took another turn for the better as BTC jumped above $30,000 and now sits even north of $31,000.",
                "With bitcoin losing over $20,000 in two months at one point, many community analysts started speculating on whether the asset had finally found its local bottom. The latest such discussions, as reported by CryptoPotato yesterday, touched upon the capitulation phase, which, according to CryptoQuant, has seen investors dumping large portions of their BTC holdings.",
                "The analysts argued that the markets tend to bottom out in such conditions when investors have disposed of their assets, even at a loss. “In bear markets, long-term holders’ capitulation usually marks a multi-year bottom,” they added.",
                "Nevertheless, CryptoQuant warned that this sell-off could take weeks or even months to finish and not be a one-time thing.",
                "\n\t\t\t\t\t\t\t\t\t\t\tJordan got into crypto in 2016 by trading and investing. He began writing about blockchain technology in 2017. He has managed numerous crypto-related projects and is passionate about all things blockchain. Contact Jordan: LinkedIn\n",
                " ",
                "Sign-up FREE to receive our extended weekly market update and coin analysis report"
            ],
            "href": "https://cryptopotato.com/change-of-direction-bitcoin-finally-ended-its-longest-ever-sequence-of-9-red-weeks/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/082d421b11d443c7a39f0d3614c8049e.png",
            "timestamp": "3 hours ago",
            "title": "Change of Direction? Bitcoin Finally Ended its Longest Ever Sequence of 9 Red Weeks"
        },
        {
            "author": [
                "Blockchain News"
            ],
            "content": [
                "As the recent crypto sell-off continues to elicit mixed reactions and concerns, Michael Saylor, MicroStrategy CEO, has told investors that they should not be discouraged by Bitcoin’s short-term volatility.",
                "",
                "For investors who see cryptos as a short-term investment and a fast track to becoming richer, their analysis is wrong. In an interview with ‘The Block’ last week after appearing at CoinMarketCap’s The Capital virtual conference, the MicroStrategy CEO said that investors should understand Bitcoin as a long-term investment.",
                "The majority of investors fail to make money because they don’t understand Bitcoin. Saylor said that Bitcoin’s near-term volatility is largely irrelevant once investors understand the fundamentals of the flagship cryptocurrency. ",
                "While Saylor suggested that people who have spent at least $100 on Bitcoin can speak about the crypto, he allowed that but indicated that such traders probably “shouldn’t have anything to say about it.”",
                "According to the MicroStrategy CEO: \"Bitcoin is the most certain thing in a very uncertain world, it's more certain than the other 19,000 cryptocurrencies, it's more certain than any stock, it's more certain than owning property anywhere in the world.” ",
                "Bitcoin is normally considered as almost three times more volatile than traditional investments (like stocks) in the short term. But Saylor thinks that the crypto volatility presents both risk and opportunity for financial investments.",
                "Most small investors fail to reap opportunities in Bitcoin trading because their trade is often based on short-term volatility. They are too pessimistic about downtrends, which eventually affects their decision-making. ",
                "The MicroStrategy CEO said that investors should keep a long-time horizon with respect to investing in Bitcoin.",
                "The executive advised investors that they should not feel down that Bitcoin prices are well off their all-time highs.",
                "Seasonal investors don’t take the risk of trading Bitcoin in the short term to increase their gains because their gains will be large enough to satisfy them if they wait long enough.",
                "\"My time horizon is a decade or more,\" Saylor said in February during an interview with Yahoo Finance Live.",
                "The executive has been putting his money where his mouth is on Bitcoin.",
                "MicroStrategy bought 660 Bitcoins for about $25 million between December 2021 and January 2022 at an average price of $37,865 per coin. ",
                "Currently, the firm holds 125,051 Bitcoins valued at about $4.8 billion, which reflects Saylor's focus on diversifying the software firm into a promising technology.",
                "Subscribe now and get exclusive news, interviews and stories.",
                "\r\n                                With blockchain, we will put an end to the monopoly of government-issued currencies, as suggested in the title of Hayek’s work – “Denationalization of Money.” Blockchain will simplify the set of concepts revolving around financial services and the complexity of the IT systems. With blockchain, we will have a cryptocurrency that is more stable and safer than any currency that has ever existed before it. This will bring about true \"monetary and financial freedom.\" (Read More)\n",
                "- Kun Hu (CEO of Worldmoney)",
                "Subscribe today and get the latest news, exclusive interviews and analyses.",
                "Copyright © 2022 Blockchain News. All Rights Reserved.",
                "\r\n                        We use cookies to improve your user experience and our services. By clicking “Accept” or continuing to use our site, you agree to the terms of our Privacy Policy.\r\n                    "
            ],
            "href": "https://Blockchain.News/news/bitcoin-short-term-volatility-is-irrelevant-once-investors-understand-its-fundamentalssays-microstrategy-ceo",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/f2d55aac2ebd4b0bb6874167335dc787.png",
            "timestamp": "3 hours ago",
            "title": "Bitcoin’s Short-Term Volatility Is Irrelevant Once Investors Understand Its Fundamentals, Says MicroStrategy CEO"
        },
        {
            "author": [
                "Blockchain News"
            ],
            "content": [
                "Coinbase is the safest among all cryptocurrency exchanges globally in 2022, according to research by BrokerChooser.",
                "",
                "The largest crypto exchange in the US by trading volume is well known for its robust security features, according to the research.",
                "On a scale of 5, Coinbase received 4.1 for the overall safety score. The exchange was also ranked as a tier 1 for other sub-categories.",
                "While FTX US Derivatives was second with a score of 4.0 and Bitstamp was third with a score of 3.8.",
                "BrokerChooser analysed the largest cryptocurrency exchanges on four main pillars: regulation, consumer protection, market fairness and transparency to reveal the safest exchanges for investors.",
                "In terms of safest exchanges for regulation, FTX US Derivatives, Gemini and Kraken Futures shared the top spot with an overall score of 5 on a scale of 5, BrokerChooser revealed.",
                "The research also revealed that the least safe exchange for regulation was Kucoin and Bybit, with an overall score of 1 each.",
                "In the safest exchange for consumer protection category, Gemini led the table with a 4.8 score out of 5. ",
                "The research revealed that Gemini has a high level of protection for both crypto and fiat holdings, and the exchange has not experienced a hacking incident in the last five years.",
                "The least safe in the same category was OKX, with a score of 1, as the exchange has lacked in sharing information on how they protect either crypto or fiat holdings.",
                "The company has also been a victim of two major hacks. In October 2017, around $3 million worth of crypto was stolen, with $5.6 million being taken in a separate incident in August 2020, BrokerChooser's research revealed.",
                "Regarding safest exchanges market fairness, FTX US Derivatives and Bittrex received a perfect score of 5 out of 5.",
                "The main reason to support this score was their appropriate policies to restrict proprietary trading and employee trading, BrokerChooser stated.",
                "While OKX, Gate.io and Bybit were the least safe crypto exchanges in the same category with a score of 1 out of 5, respectively.",
                "These exchanges have no credible data about measures in place against prop trading and employee trading or detailed coin listing criteria.",
                "Along with the availability and use of untrustworthy stablecoins on their platform, these exchanges also issue their own utility tokens.",
                "Transparency is an important aspect of crypto exchange platforms as it helps ensure customers feel protected. Coinbase was again the leader of this category with an overall score of 4.8 out of 5.",
                "Coinbase's key attraction for customers has been their readily available information for the public regarding corporate structure, financial statements and legal documents, and having a relatively simple product offering, BrokerChooser research revealed.",
                "While in the same category, Binance, OKX, KuCoin, Gate.io, Bybit and Phemex were the least safe, with a total score of 1 out of 5, respectively, as they all offer limited or no information about their finances and products. Also, the information that they do offer is not credible or is too complex for the average consumer to understand, the research added.",
                "Subscribe now and get exclusive news, interviews and stories.",
                "\r\n                                With blockchain, we will put an end to the monopoly of government-issued currencies, as suggested in the title of Hayek’s work – “Denationalization of Money.” Blockchain will simplify the set of concepts revolving around financial services and the complexity of the IT systems. With blockchain, we will have a cryptocurrency that is more stable and safer than any currency that has ever existed before it. This will bring about true \"monetary and financial freedom.\" (Read More)\n",
                "- Kun Hu (CEO of Worldmoney)",
                "Subscribe today and get the latest news, exclusive interviews and analyses.",
                "Copyright © 2022 Blockchain News. All Rights Reserved.",
                "\r\n                        We use cookies to improve your user experience and our services. By clicking “Accept” or continuing to use our site, you agree to the terms of our Privacy Policy.\r\n                    "
            ],
            "href": "https://Blockchain.News/research/coinbase-is-safest-crypto-exchange-overall-brokerchooser",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/c43fc9841b7a4dbd9f546be172a6825c.png",
            "timestamp": "3 hours ago",
            "title": "Coinbase is Safest Crypto Exchange Overall: BrokerChooser"
        },
        {
            "author": [
                "CoinGape"
            ],
            "content": [
                "PRODUCTS",
                "CAMPAIGNS",
                "CALENDARS",
                "Share",
                "",
                "",
                "",
                "",
                "",
                "Share",
                "",
                "",
                "",
                "",
                "In a surprise recovery, the world’s largest cryptocurrency Bitcoin (BTC) managed to give a successful weekly closing above $30,000. This was the first-ever positive close by Bitcoin over the last ten weeks.",
                "As of press time, Bitcoin is trading 4.32% up at a price of $31,096 and a market cap of $589 billion. On-chain data provider Santiment notes that the total whale holdings by Bitcoin have touched their one-month high. It states:",
                "The mega whale addresses of Bitcoin, comprised partially of exchange addresses, own their highest supply of $BTC in a year. We often analyze the 100 to 10k $BTC addresses for alpha, but accumulation from this high tier can still be a promising sign.",
                "Currently, there’s been an intense battle going on between the …"
            ],
            "href": "https://coinmarketcap.com/headlines/news/bitcoin-mega-whale-holdings-touch-one-year-high-as-btc-jumps-past-31000/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/082d421b11d443c7a39f0d3614c8049e.png",
            "timestamp": "3 hours ago",
            "title": "Bitcoin Mega Whale Holdings Touch One-Year High As BTC Jumps Past $31,000"
        },
        {
            "author": [
                "CoinGape"
            ],
            "content": [
                "PRODUCTS",
                "CAMPAIGNS",
                "CALENDARS",
                "Share",
                "",
                "",
                "",
                "",
                "",
                "Share",
                "",
                "",
                "",
                "",
                "Ethereum (ETH) tracked a broader recovery in the crypto market, jumping over 5% in the past 24 hours as sentiment improved.",
                "The token was last trading at $1,882.80, according to data from Coinmarketcap.com. But its latest bounce blindsided traders with a big short position on the token.",
                "Data from Coinglass shows that a whopping $682 million short positions were liquidated in the past four hours, with a majority of these occurring on crypto exchange Bitfinex.",
                "The exchange, which has a 100% short rate on Ethereum, saw nearly $670 million in liquidations in the past four hours, all of them short positions.",
                "With the liquidations on Bitfinex, Ethereum has seen its biggest amount of one-day liquidations in three years, …"
            ],
            "href": "https://coinmarketcap.com/headlines/news/ethereum-short-squeeze-bitfinex-670-mln-bloodbath/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/f2d55aac2ebd4b0bb6874167335dc787.png",
            "timestamp": "3 hours ago",
            "title": "Ethereum Short Squeeze: Bitfinex Sees $670 Mln Bloodbath After This"
        },
        {
            "author": [
                "Seeking Alpha"
            ],
            "content": [
                "    gesrey/iStock via Getty Images ",
                "gesrey/iStock via Getty Images"
            ],
            "href": "https://seekingalpha.com/news/3845746-hive-blockchain-reports-2734-btc-produced-in-may-2022?utm_source=coinmarketcap.com&utm_medium=referral",
            "img_src": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1226798658/image_1226798658.jpg?io=getty-c-w750",
            "timestamp": "3 hours ago",
            "title": "HIVE Blockchain reports 273.4 BTC produced in May 2022"
        },
        {
            "author": [
                "Cointelegraph.com News"
            ],
            "content": [
                "Please stand by, while we are checking your browser...",
                "Redirecting...",
                "Please enable Cookies and reload the page.",
                "Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.",
                "If you are on a personal connection, like at home, you can run an anti-virus scan on your device to make sure it is not infected with malware.",
                "If you are at an office or shared network, you can ask the network administrator to run a scan across the network looking for misconfigured or infected devices.",
                "\nCloudflare Ray ID: 7170048aa84bc6f0\n•\nYour IP: 103.253.89.23\n•\nPerformance & security by Cloudflare\n"
            ],
            "href": "https://cointelegraph.com/news/defi-community-rallies-behind-pooltogether-to-hit-1-4m-nft-defense-funding-target",
            "img_src": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDYvODE4NTA1NTEtYWQxMi00MjRhLTk2MjktMjg4YTQ5NDA2YjA4LmpwZw==.jpg",
            "timestamp": "4 hours ago",
            "title": "DeFi community rallies behind PoolTogether to hit $1.4M NFT defense funding target"
        },
        {
            "author": [
                "NewsBTC"
            ],
            "content": [
                "PRODUCTS",
                "CAMPAIGNS",
                "CALENDARS",
                "Share",
                "",
                "",
                "",
                "",
                "",
                "Share",
                "",
                "",
                "",
                "",
                "Ethereum found support near $1,735 and corrected higher against the US Dollar. ETH is now facing a major resistance near $1,885 and $1,920.",
                "Ethereum spiked below the $1,760 support zone. However, ETH remained well bid above the $1,720 level. A low was formed near the $1,734 and the price started a fresh increase.",
                "There was a clear move above the $1,800 and $1,820 levels. Besides, there was a break above …"
            ],
            "href": "https://coinmarketcap.com/headlines/news/ethereum-bulls-keeps-pushing-1920/",
            "img_src": "https://s3.coinmarketcap.com/static-gravity/image/c43fc9841b7a4dbd9f546be172a6825c.png",
            "timestamp": "4 hours ago",
            "title": "TA: Ethereum Bulls Keeps Pushing, Why ETH Could Rise Steadily"
        },
        {
            "author": [
                "Cointelegraph.com News"
            ],
            "content": [
                "Please stand by, while we are checking your browser...",
                "Redirecting...",
                "Please enable Cookies and reload the page.",
                "Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.",
                "If you are on a personal connection, like at home, you can run an anti-virus scan on your device to make sure it is not infected with malware.",
                "If you are at an office or shared network, you can ask the network administrator to run a scan across the network looking for misconfigured or infected devices.",
                "\nCloudflare Ray ID: 7170048c6f4bc70c\n•\nYour IP: 103.253.89.23\n•\nPerformance & security by Cloudflare\n"
            ],
            "href": "https://cointelegraph.com/news/ugandan-central-bank-u-turns-on-crypto-welcoming-firms-to-regulatory-sandbox",
            "img_src": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDYvMGZmYTg4ZjgtNTNiMC00YzBjLWE3MTgtM2ZhZDVlOGY5OWZjLmpwZw==.jpg",
            "timestamp": "4 hours ago",
            "title": "Ugandan central bank U-turns on crypto welcoming firms to regulatory sandbox"
        },
        {
            "author": [
                "Cointelegraph.com News"
            ],
            "content": [
                "Please stand by, while we are checking your browser...",
                "Redirecting...",
                "Please enable Cookies and reload the page.",
                "Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.",
                "If you are on a personal connection, like at home, you can run an anti-virus scan on your device to make sure it is not infected with malware.",
                "If you are at an office or shared network, you can ask the network administrator to run a scan across the network looking for misconfigured or infected devices.",
                "\nCloudflare Ray ID: 7170048cecb8c6e8\n•\nYour IP: 103.253.89.23\n•\nPerformance & security by Cloudflare\n"
            ],
            "href": "https://cointelegraph.com/news/ugandan-central-bank-u-turns-on-crypto-welcoming-firms-to-regulatory-sandbox",
            "img_src": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDYvMGZmYTg4ZjgtNTNiMC00YzBjLWE3MTgtM2ZhZDVlOGY5OWZjLmpwZw==.jpg",
            "timestamp": "4 hours ago",
            "title": "Ugandan central bank u-turns on crypto welcoming firms to regulatory sandbox"
        },
        {
            "author": [
                "Cointelegraph.com News"
            ],
            "content": [
                "Please stand by, while we are checking your browser...",
                "Redirecting...",
                "Please enable Cookies and reload the page.",
                "Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.",
                "If you are on a personal connection, like at home, you can run an anti-virus scan on your device to make sure it is not infected with malware.",
                "If you are at an office or shared network, you can ask the network administrator to run a scan across the network looking for misconfigured or infected devices.",
                "\nCloudflare Ray ID: 7170048d4b8ec6ec\n•\nYour IP: 103.253.89.23\n•\nPerformance & security by Cloudflare\n"
            ],
            "href": "https://cointelegraph.com/news/australian-mayor-downplays-crypto-volatility-recommends-it-for-rates-payments",
            "img_src": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDYvN2Y0ZGQ2YTgtODg2Mi00ZjUwLThkYjAtYTdhYTQ0NWNiYzRlLmpwZw==.jpg",
            "timestamp": "5 hours ago",
            "title": "Australian Mayor downplays crypto volatility, recommends it for rates payments"
        }
    ],
    "length": 20
}