{
    "data": [
        {
            "author": [
                "2 min read",
                "Kate Irwin"
            ],
            "content": "Indonesian Exchange Pintu Raises $113M to Be 'Coinbase of Southeast Asia' - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessIndonesian Exchange Pintu Raises $113M to Be 'Coinbase of Southeast Asia'Investors are bullish on the startup and its founder despite the current bear market.\nBy Kate IrwinJun 7, 2022Jun 7, 20222 min readPhoto by Bagus Ghufron on Unsplash.Create an account to save your articles.Overcoming recent headwinds in the crypto market, Indonesian cryptocurrency exchange and wallet Pintu announced today that it has raised $110 million in Series B funding from Lightspeed, Pantera Capital, Northstar Group, and Intudo Ventures.\nPintu says it will use the newly-raised funds to further develop its product offerings and expand its educational arm, Pintu Academy.\nWith an exchange, crypto wallet, and staking platform with its own token, the Pintu app has gone from zero to four million downloads in just two years, Eddy Chan, Founding Partner at Intudo, told Decrypt in an interview.\nAs a VC firm, Intudo is laser-focused on the Indonesian market. Chan is bullish on Pintu and Indonesia’s crypto economy despite the global market downturn in part because of what he calls a “very, very long-term view.”\n\nChan said he is a firm believer in Pintu founder and CEO Jeth Soetoyo, as well as Pintu’s user-friendly interfaces as well as its educational focus, saying the app could become “the Coinbase of Southeast Asia.”\nHe’s also bullish on crypto adoption in Indonesia specifically, and said that Indonesia’s fiat currency inflation, young demographics, rising middle class, growing population, and a national interest in cryptocurrency are why he’s optimistic on the future of crypto as a whole in the country.\n\nSoetoyo has a similar view.\n“Indonesia’s crypto market has demonstrated remarkable growth over the past year, fueled by regulatory encouragement and increased grassroots awareness,” Soetoyo said in a statement. “Crypto adoption in Indonesia is only in its beginning stages, and educating users on the fundamentals is critical to ensuring this growth continues in a healthy way.”\nInterest in crypto has certainly increased in the country, with the Indonesian Commodity Futures Trading Regulatory Agency reporting that the number of Indonesians trading crypto has doubled to more than 12 million traders in the past year. \nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102175/indonesian-crypto-exchange-pintu-raises-110-million",
            "id": "e2a2b77802c97222df8f21291451b260",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "Indonesian Exchange Pintu Raises $113M to Be 'Coinbase of Southeast Asia'"
        },
        {
            "author": [
                "3 min read",
                "André Beganski"
            ],
            "content": "English Premier League Files Crypto and NFT Trademarks - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessEnglish Premier League Files Crypto and NFT TrademarksNew trademark filings hint at expanded digital markets for the the top tier of England's football pyramid.\nBy André BeganskiJun 7, 2022Jun 7, 20223 min readManchester United is a soccer team in England. Image: ShutterstockCreate an account to save your articles.The English Premier League (EPL) has filed two cryptocurrency and NFT trademarks in the U.S., a sign the world’s most-watched sports league is gearing up to expand its brand into the digital scene.\nThe trademarks were filed with the United States Patent and Trademark Office (USPTO) last week and brought to light in a tweet by licensed trademark attorney Michael Kondoudis on June 6.\n\nThe Premier League has filed 2 US trademark applications for ▶️ NFTs, cryptocurrencies, digital tokens + collectibles ▶️ Digital asset trading  ▶️ Financial and crypto services ▶️ Virtual clothing, footwear, and sports gear#NFTs #Metaverse #Cryptocurrencies #PremierLeague pic.twitter.com/1tPOU0dIOp\n— Mike Kondoudis (@KondoudisLaw) June 6, 2022\n\nThe Premier League is the top level of professional English football, comprising 20 teams.\nThe two filings pertain to the U.S. use of trademarks associated with the league, one centered on the league’s name and logo of a “lion wearing a crown in three-quarter view” and the other regarding a “loving cup trophy” adorned with lions on each handle and a crown on top.\nThe trademark filings are expansive in scope, and cover the creation and sale of digital assets, virtual clothing, cryptocurrencies, and media files verified by NFTs. They also include the use of Premier League trademarks in “virtual, augmented, and mixed reality software.”\n\nAn NFT is a digital asset that represents the ownership of media, often digital illustrations, profile pictures, or music. They are minted on public blockchains like Ethereum or Solana, and each token is unique.\nThe market for NFTs has grown in recent years as more companies cast their hats into the ring. One of the most notable NFT projects in the sports world is NBA Top Shot, launched in 2020. The collection recently surpassed over $1 billion in sales, according to CryptoSlam. \n\nWhile demand for cryptocurrencies and NFTs has cooled in light of a recent decline in the overall crypto market, NFT sales are still on pace to exceed the $20 billion in volume recorded last year. The space has been a growing area for celebrities, artists and cultural icons to connect with their fans and cultivate a sense of community online.\nThe application of digital currencies is becoming increasingly common throughout the sports world, especially among football clubs. Last month, Arsenal announced a partnership with Unagi as part of their free to play game where player cards could be purchased as NFTs.\n\nThe game allows its users to keep player cards as collectables, sell them on an open market for in-game currency or trade the cards with other players. For fans of football, it could be a sign of what’s to come in the future for the Premier League.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102165/english-premier-league-files-crypto-and-nft-trademarks",
            "id": "3b37f6df9f16132f0851e032d64d909e",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "English Premier League Files Crypto and NFT Trademarks"
        },
        {
            "author": [
                "3 min read",
                "Kate Irwin"
            ],
            "content": "Epic Games CEO Bashes Crypto Exchanges Over Fake Fortnite Token - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsCoinsEpic Games CEO Bashes Crypto Exchanges Over Fake Fortnite TokenSweeney took a shot at decentralized exchanges like PancakeSwap for \"enabling\" trading of the unauthorized token.\nBy Kate IrwinJun 6, 2022Jun 6, 20223 min readFortnite is Epic Games' flagship title. Image: ShutterstockCreate an account to save your articles.Epic Games CEO and Co-Founder Tim Sweeney called out “cryptocurrency marketplaces” today for allegedly “enabling” unofficial and unauthorized cryptocurrencies bearing the “Fortnite” name.\nFortnite is Epic’s massively popular Battle Royale shooter game. First released in 2017, it now has more than 350 million registered users worldwide.\n“There isn’t a Fortnite cryptocurrency,” Sweeney wrote. “The Twitter accounts promoting such a thing are a scam. Epic’s lawyers are on it. Also, shame on the cryptocurrency marketplaces that enable this kind of thing.”\n\nThere isn't a Fortnite cryptocurrency. The Twitter accounts promoting such a thing are a scam. Epic's lawyers are on it. Also, shame on the cryptocurrency marketplaces that enable this kind of thing.\n— Tim Sweeney (@TimSweeneyEpic) June 6, 2022\n\nSpecifically, Sweeney is referring to the “Fortnite Token” (FNT), which is reportedly trading on decentralized exchanges SushiSwap, PancakeSwap, and CronaSwap.\nA quick search for the alleged scam token on those exchanges does not currently return any results, though these decentralized exchanges enable their users to trade virtually any token so long as those users manually input the token’s contract address.\n“This account is operating a scam,” Sweeney wrote, referring to the Twitter account @fortnite_token. “Anybody involved in this is being scammed,” he added in another response.\n\nThe Twitter account behind the unauthorized Fortnite token tried to argue that it wasn’t a scam despite the “CEO of Fortnite” stating numerous times it was one.\n“This is a fair-launch, community-driven, Fortnite game fans-created cryptocurrency project with no specified owner or company structure behind it or a CEO deciding on its future,” the token’s account responded.\nSweeney was not amused.\n“You can't use the Fortnite name and images without permission to market an unrelated product,” he replied.\nSweeney made at least 10 tweets in response to the \"Fortnite token\" he calls a \"scam.\" Image: Twitter.\nThe alleged scammers are also encouraging Fortnite fans to mint NFTs with their tokens, which Sweeney called—unsurprisingly—a “scam.”\nAccording to Nomics data, it appears that few are trading the FNT token. Since January, FNT is down 96% from its all-time high and is worth nearly zero at $0.0000007673. In the past 24 hours, the token has only seen about $250 in total volume traded.\nThis isn’t the first time malicious actors have reportedly used Fortnite’s branding without Epic’s consent. Back in October, reports surfaced that scammers were promising gamers that they could exchange their V-Bucks, Fortnite’s non-crypto, digital currency, for dollars using an unauthorized “Fortnite Coin.”\n\nWhile Epic Games doesn’t have any Fortnite-related cryptocurrency, the company is leaning into Web3. Gala Games’ upcoming release GRIT—which features NFTs—will be the first blockchain game to be released on the Epic Games store. NFTs are unique tokens that are used to demonstrate ownership over digital assets, such as in-game items.\nSweeney previously shared back in September, however, that Epic Games isn’t “touching NFTs as the whole field is currently tangled up with an intractable mix of scams.”\nToday, he clarified his position.\n“When new technology emerges, some put it to good use, and others put it to bad use. It would be terribly shortsighted to ban an entire field of technology for such a reason.”\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102157/epic-games-ceo-bashes-crypto-exchanges-fake-fortnite-token",
            "id": "74c64760256448bc9e186746841f2da4",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "Epic Games CEO Bashes Crypto Exchanges Over Fake Fortnite Token"
        },
        {
            "author": [
                "3 min read",
                "Ryan Ozawa"
            ],
            "content": "SEC Targets Binance's BNB ICO for Potential Violations: Report - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessSEC Targets Binance's BNB ICO for Potential Violations: ReportThe launch of Binance Coin (BNB) five years ago fostered the world's largest crypto exchange. Today, it's getting a fresh look from U.S. regulators, according to Bloomberg.\nBy Ryan OzawaJun 6, 2022Jun 6, 20223 min readCreate an account to save your articles.The initial coin offering that served as the cornerstone of the launch of the Binance cryptocurrency exchange in 2017 is getting a fresh look from federal regulators.\nAccording to anonymous sources cited in a Bloomberg report today by Tom Schoenberg and colleagues, the Securities and Exchange Commission (SEC) is revisiting the origins of the exchange's Binance Coin (BNB) for potential violations of securities regulations. Since its launch in 2017, Binance has become far and away the largest cryptocurrency exchange on the market by trading volume.\nNews of the federal regulatory probe comes just as Reuters released the results of an unrelated investigation in which the news service claims that at least $2.35 billion in illicit funds have been laundered through Binance between 2017 and 2021.\n\nIt is unclear what prompted this latest look back by the SEC, but BNB is currently the fifth-largest cryptocurrency, according to CoinMarketCap, logging a total market cap of $48 billion and 24-hour trading volume of $1.4 billion as of this writing.\n\nAt the heart of the case is the SEC's regulatory authority over investment contracts, and whether digital currencies qualify as such—particularly if they are sold to investors as a way to fund a company with the promise of profiting from the company’s efforts.\nBNB was created in July 2017 as an ERC-20 token on the Ethereum blockchain before shifting to a separate Binance Chain. The initial coin offering of 100 million tokens at 15 cents per token raised $15 million. Now the native currency on the Binance crypto exchange, BNB can be traded directly, used to make purchases and payments, and pay a discounted rate on Binance transaction fees.\n\nBloomberg asserts that Binance \"faces multiple investigations in Washington,\" which in turn are part of dozens of enforcement actions over ICOs.\nIn a statement to the financial news outlet, Binance said, “It would not be appropriate for us to comment on our ongoing conversations with regulators, which include education, assistance, and voluntary responses to information requests,” adding, “We will continue to meet all requirements set by regulators.”\n\nThose regulators may also be looking at Binance US, an affiliate company founded in 2019, and whether it's sufficiently separated from its global parent.\nBloomberg quoted company officials in clarifying that “Binance.US is a separate US-focused trading platform that services US users by offering products and services that are compliant with US federal and state regulations,\" and a separate statement from Binance US affirming its commitment to compliance.\n\nIn March, Binance was hit with a $5 million class-action lawsuit in which users claimed the exchange sold them 79 different crypto assets (including Dogecoin, Solana, and Cardano) that should have been handled as licensed securities.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102150/sec-binance-bnb-ico-report",
            "id": "5a1a9e7f68fd06996e89e61ea243de97",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "SEC Targets Binance's BNB ICO for Potential Violations: Report"
        },
        {
            "author": [
                "2 min read",
                "Stacy Elliott"
            ],
            "content": "Weekly Bitcoin Inflows Totaled $126M as Institutions Keep 'Buying the Dip' - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsCoinsWeekly Bitcoin Inflows Totaled $126M as Institutions Keep 'Buying the Dip'And for a ninth straight week, Ethereum-based funds saw outflows.\nBy Stacy ElliottJun 6, 2022Jun 6, 20222 min readSource: ShutterstockCreate an account to save your articles.More than half a billion dollars has been invested in exchange-traded Bitcoin funds since the start of the year, with $126 million of it flowing into ETPs last week, according to Coinshares.\nBut more broadly, digital asset investment products saw net inflows totaling $100 million last week. That’s because the Bitcoin and multi-asset product inflows of $4.3 million were offset by investors pulling money out of Ethereum-based funds.\n“Ethereum continues to suffer, with another week of outflows totaling US$32m,” wrote James Butterfill, Coinshares’ director of research. “Ethereum has endured 9 straight weeks of outflows implying enduring negative investor sentiment.”\n\n2/ from our weekly fund flows report - last week, investors added to #bitcoin positions, with $126M in net inflows into publicly traded bitcoin products\nwith 2 consecutive weeks of net inflows across all crypto products, investors are buying the dip 🍲https://t.co/MZT9Ea1fdu\n— Meltem Demirors (@Melt_Dem) June 6, 2022\n\nIt shows there’s a stark contrast in sentiment among investors when it comes to the two most popular cryptocurrencies.\nOn Monday, Bitcoin and Ethereum were up slightly from Sunday. BTC was trading at $31,314.94, up 5%, with a market cap of $597 billion, according to CoinMarketCap. Meanwhile, ETH was up 2% to $1,862.94, with a market cap of $225 billion.\n\nWith the latest outflow, Ethereum-based funds have now lost $357 million since the start of the year.\nAlthough blockchain equity funds as a category saw outflows totaling $26.3 million last week, Fidelity’s new crypto ETFs (which launched in April) bucked the trend. \nThe Fidelity crypto fund’s portfolio contains shares of publicly traded companies that are active in the crypto industry, like Block Inc. (BLOCK), Coinbase (COIN), and Marathon Digital (MARA). Its metaverse fund holds shares of companies like the recently rebranded Meta Platforms (formerly Facebook) and Adobe (ADBE).\nMany crypto companies have implemented hiring freezes, layoffs or rescinded job offers in an attempt to brace for Crypto Winter. Despite that, and the funds receiving criticism from Sens. Elizabeth Warren of Massachusetts and Tina Smith of Minnesota, Fidelity now manages a combined $22 million over two crypto funds.\n\nThe Fidelity Crypto Industry and Digital Payments ETF added $2.4 million, and the Fidelity Metaverse ETF added $1.1 million. Each of the funds has a total of $11 million in assets under management, according to Coinshares.\nThe biggest outflow last week came from the Invesco Coinshares Global Blockchain UCITS ETF, which saw investors pull $21.6 million—82% of the $26.3 million net outflow that Monday’s report noted for blockchain equity funds.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102149/bitcoin-inflows-totaled-126m-as-institutions-keep-buying-the-dip",
            "id": "a9733c33b37dd8d0916c25ef0da8f0d9",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "Weekly Bitcoin Inflows Totaled $126M as Institutions Keep 'Buying the Dip'"
        },
        {
            "author": [
                "2 min read",
                "Mat Di Salvo"
            ],
            "content": "Crypto IRA Company Sues Gemini Over $36M Theft of Bitcoin, Ethereum - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessCrypto IRA Company Sues Gemini Over $36M Theft of Bitcoin, EthereumIRA Financial Trust says New York-based exchange is to blame for the massive February hack. Gemini denies the allegations.\nBy Mat Di SalvoJun 6, 2022Jun 6, 20222 min readCreate an account to save your articles.In brief\nIRA Financial Trust lost $36 million in crypto in a February hack. \nThe company uses New York-based crypto exchange Gemini to hold its digital assets. \nIt alleges that Gemini \"did not have proper safeguards in place to protect customer crypto assets\"—and wants to sue the exchange. \nIRA Financial Trust, a company which manages individual retirement accounts in non-traditional assets such as Bitcoin, today announced a lawsuit against cryptocurrency exchange Gemini. \nIRA Financial was hacked for $36 million-worth of crypto back in February. Criminals stole $21 million in Bitcoin and $15 million in Ethereum from retirement accounts in the hack. \nIRA uses Gemini's platform to hold cryptocurrencies and it alleges that the New York-based exchange's systems were to blame because it \"failed to freeze accounts within a sufficient time frame immediately following the incident.\"\n\n\"As stated in the complaint, the lawsuit, IRA Financial Trust v. Gemini Trust Company, LLC, alleges that the Gemini cryptocurrency exchange platform did not have proper safeguards in place to protect customer crypto assets,\" the announcement today said. \n\"IRA Financial Trust has been working to find resolution for its impacted customers since this incident occurred and is pledging to use the proceeds from the lawsuit to reimburse IRA Financial customers impacted by the February 8, 2022, incident,\" it added.\n\nGemini responded to the allegations in a statement provided to Decrypt: \"We reject the allegations in the lawsuit. Our security standards are among the highest in the industry and we are constantly updating them to ensure our customers are always protected. In this matter, as soon as IRA Financial notified us of their security incident, we acted quickly to mitigate the loss of funds from their accounts.\"\nMiami-based IRA Financial manages individual retirement accounts—tax-advantaged savings instruments for U.S. workers, who can deduct their contributions from their income. \nGemini is a popular exchange run by billionaire brothers Cameron and Tyler Winklevoss. The two are famous in the crypto world because of their relatively early Bitcoin investment that made them billions. \n\nBut Gemini has had a string of bad luck lately: the Commodity Futures Trading Commission (CFTC) last week filed a complaint against the exchange, alleging that it misled regulators \"for making material false or misleading statements\" in an effort to gain approval for its Bitcoin futures product.\nAnd the exchange also announced this month that it was laying off 10% of staff in an effort to help the firm weather \"crypto winter.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102144/ira-financial-trust-gemini-lawsuit",
            "id": "83e7b2dccab5cc9b2eead4704e9b7b39",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "Crypto IRA Company Sues Gemini Over $36M Theft of Bitcoin, Ethereum"
        },
        {
            "author": [
                "3 min read",
                "Andrew Hayward"
            ],
            "content": "Ethereum NFT Game Illuvium Sells Over $72M in Digital Land Plots - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsGamingEthereum NFT Game Illuvium Sells Over $72M in Digital Land PlotsThe role-playing game’s first land sale on Immutable X yields a huge stash of crypto, even in a bear market for NFTs.\nBy Andrew HaywardJun 6, 2022Jun 6, 20223 min readIlluvium is an Ethereum-based role-playing game. Image: IlluviumCreate an account to save your articles.In brief\nEthereum-based game Illuvium sold over $72 million worth of NFT digital land plots.\nThe land plots provide various benefits in the upcoming PC and Mac game, due out later this year.\nIlluvium, an upcoming Ethereum-based role-playing game, sold more than $72 million worth of digital land plots as NFTs during a sale that ended on Sunday.\nThe sale, which began Thursday, ultimately saw nearly 20,000 digital land plots sold to investors and prospective players. Illuvium’s land NFTs run on Immutable X, a layer-2 scaling solution for Ethereum that enables cheaper, faster, and more energy-efficient transactions.\nAn NFT is a blockchain token that proves ownership of a digital asset, such as artwork or collectibles, and in the video game space that can mean land, player avatars and apparel, or weapons.\nIlluvium’s game world ultimately will feature 100,000 total land plots, holders of which will receive access to various in-game benefits, such as extracting fuel that can be sold to other players for a potential profit. Illuvium is set to launch on Windows and Mac computers later this year.\n\nThe Illuvium Land Sale is officially over!🥳🥳🥳\n💥 All Land Plots Sold Out💥 $72M+ in Total Sales💥 239,388 sILV2 to be burned💥 4,018 ETH to be redistributed 💥 NO GAS WARS\nMASSIVE thank you to all participants and partners that helped make this a historic success ♊️ pic.twitter.com/adMTq6PpKe\n— Illuvium (@illuviumio) June 5, 2022\n\nAmong the initially offered 20,000 plots, 29 were retained by the developers for future giveaways, while two additional Tier 5 plots—the most valuable in the game—each will be auctioned off using a standard auction format.\nFor the 19,969 plots that were sold, Illuvium used a Dutch auction format that saw the price of each plot decrease gradually during each batch of plots put up for sale. Prices started at 2 ETH (currently $3,700) for Tier 1 plots, 6 ETH ($11,100) for Tier 2, 20 ETH ($37,000) for Tier 3, and 80 ETH ($148,000) for Tier 4.\n\nIlluvium took in more than $72 million during the sale. The creators, according to a tweet, said that some 4,018 ETH (over $7.4 million today) will be redistributed to holders of the game's ILV token that have it staked. Meanwhile, 239,388 of the game’s sILV2 token (about $22 million worth) will be burned or permanently destroyed, thus reducing the total supply.\n\"Inflation bad, deflation good,\" reads an official explainer regarding the planned burn.\nVirtual land sales have generated hundreds of millions of dollars for blockchain-based metaverse games like The Sandbox and Decentraland. A report from MetaMetric Solutions claimed that some $501 million worth of virtual land was sold throughout 2021, with another $85 million in January 2022 alone.\n\nIlluvium’s land sale isn’t quite a record—fellow Ethereum-based game Ember Sword had a $203 million sale last July—but it’s notable due to the current bear market for NFTs, which have suffered alongside crypto markets.\nLeading NFT marketplace OpenSea has seen daily trading volumes in the $25 million to $40 million range of late, following a record-setting single day of $476 million on May 1, while top projects like the Bored Ape Yacht Club have seen sinking valuations.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102139/ethereum-nft-game-illuvium-sells-over-72m-in-digital-land-plots",
            "id": "a225430af1bd0609e4050223ace8141b",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "Ethereum NFT Game Illuvium Sells Over $72M in Digital Land Plots"
        },
        {
            "author": [
                "4 min read",
                "Jason Nelson"
            ],
            "content": "Justin Aversano’s Quantum Opens Physical NFT Gallery in LA to ‘Uplift Other Artists’ - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsNFTsJustin Aversano’s Quantum Opens Physical NFT Gallery in LA to ‘Uplift Other Artists’Aversano's L.A. hub, the first of potentially many Quantum Spaces, is designed for fostering real-world Web3 communities.\nBy Jason NelsonJun 6, 2022Jun 6, 20224 min readJustin Aversano poses at his new Quantum Art gallery in Santa Monica, CA, on June 3, 2022. (Photo: Jason Nelson)Create an account to save your articles.A new art installation co-founded by prominent NFT photographer Justin Aversano has opened its doors on the iconic Third Street Promenade in Santa Monica, California. Quantum Space LA is the latest in a growing trend of physical NFT galleries, in which artists can showcase their digital work in a real-world setting. \nAversano, known for the in-demand Twin Flames NFT photography collection, used the grand opening of Quantum Space LA on Friday to launch his newest project, Doppelgänger, a collection of 1,000 outtakes from Twin Flames. It continues Aversano's theme of photographing twins and turning those images into collectible NFT assets.\nNFTs are cryptographically unique tokens linked to digital and sometimes physical content, providing proof of ownership, membership to an exclusive club, or other potential perks. They are often used to represent digital goods such as photos, illustrations, and collectibles.\n\nQuantum Art is a photography-centric NFT platform that Aversano co-founded last fall. In February, the platform raised $7.5 million in funding. The Santa Monica space was announced in April ahead of its grand opening this weekend.\nLarge flat-screen televisions line the walls throughout the location, displaying images from various digital artists who have partnered with the startup to showcase and sell their work. Photos of twin siblings taken by Aversano all around the world are projected onto large hanging curtains in the center of the space.\n\"Twin Flames basically gave birth to Quantum. The success of Twin Flames, the community around Twin Flames, pushed me to support other photographers,\" Aversano told Decrypt at Friday’s opening event.\n\nAversano said that the Santa Monica space is an experiment; the next opening is planned for this fall in New York, with hopes to launch similar installations worldwide.\"We plan to open one a month next year,\" Aversano said. \"We want to have 20 to 50 spaces around the world.\"  \n“I'm thrilled and really interested to see how it kind of plays out, and how we could potentially change the narrative of ‘NFTs are bad’ and ‘NFTs are not eco-friendly,’” said UnicornDAO’s Rebecca Lamis, who also manages Quantum Space LA. “I think there's a lot of impact we can do in that capacity.”\nLamis said that the June 3rd opening was a soft launch of the space, but passersby appeared to be immediately interested, clamoring to come into the space to find out what it was all about.\nAs Aversano explained, the Quantum Spaces are paid for with the money raised from selling NFT minting keys ahead of time. The Quantum Keys were minted in March for the LA location, and now start at 4.15 ETH ($7,700) on secondary marketplaces. NFT holders gain access to an exclusive area of the gallery, and can use the venue to host events.\n\"We have enough treasury funding to work with artists and commission them to do mints,\" Aversano told Decrypt. He added that each future Quantum Space location will mint its own NFT collection to ensure that each location is unique and has its own membership group.\nAversano explained that Quantum is not just about him, but about also enabling other artists and creators through his own prosperity. \"I was able to uplift other artists with my success, which is what I love to do,\" he said. “And I want to share the abundance, because that's what being an artist and a good person is about—to share the wealth.\"\nWhile Quantum Art was founded with an initial focus on photography, the platform will branch out to encompass other types of artwork. Aversano said that it could include contributions from sculptors, painters, digital artists, fashion designers, and others building the nascent metaverse.\n\"We want to put up quality art, with a quality community of people that get together and thrive off each other, and support each other,\" Aversano said.\n\"I think that's why IRL spaces are important. Especially after a pandemic, we want it even more,\" he added. \"Quantum is in the perfect position to build these community hubs around the world.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102124/justin-aversanos-quantum-opens-physical-nft-gallery-in-la-to-uplift-other-artists",
            "id": "ba8696638c17e57b00472c2982606cc1",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "Justin Aversano’s Quantum Opens Physical NFT Gallery in LA to ‘Uplift Other Artists’"
        },
        {
            "author": [
                "4 min read",
                "Stacy Elliott"
            ],
            "content": "At Least $2.4B in Crypto Has Been Laundered Through Binance: Report - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessAt Least $2.4B in Crypto Has Been Laundered Through Binance: ReportA Reuters report says $2.4B in stolen funds have been laundered through Binance. The exchange calls it a \"woefully misinformed op-ed.\"\nBy Stacy ElliottJun 6, 2022Jun 6, 20224 min readBinance is one of the world's biggest crypto exchanges. Image: ShutterstockCreate an account to save your articles.A new report from Reuters estimates that at least $2.35 billion in illicit funds have been laundered through Binance between 2017 and 2021. \nThe news agency analyzed court records, spoke with law enforcement, and worked with blockchain analysis firms Chainalysis and Crystal Blockchain to track illicit funds on the exchange.\nAs of Monday morning, Binance was the largest crypto exchange, accounting for $10.5 billion in spot and $41.4 billion in derivatives volume over the last day, according to CoinMarketCap. \nThe report quotes Binance Chief Communications Officer Patrick Hillman, who told Reuters that he did not believe its analysis was accurate. \nHe did tell the news agency that the company was in the process of assembling \"the most sophisticated cyber forensics team on the planet\" that would \"further improve our ability to detect illegal crypto activity on our platform.\"\nA Binance spokesperson shared a response to the article with Decrypt, saying that the company has received \"an outpouring of support from partners in law enforcement across the globe\" since the article was published on Monday morning.\n\"We're aware of Angus Berwick's latest woefully misinformed op-ed,\" the spokesperson said in an email. \"It should be noted that the article uses outdated information from 2019 and unverified personal attestations as a crutch to establish a false narrative.\"\nThe report connects several notable events and platforms, including the hack of a Slovakian crypto exchange Eterbase, darknet marketplace Hydra, and the North Korean hacking group Lazarus, each of which involved Binance to facilitate various crypto transactions.\nEterbase\nIn September 2020, attackers from the Lazarus group created anonymous Binance accounts and used them to launder a portion of $5.4 million stolen from Slovakian cryptocurrency exchange Eterbase, according to the Reuters analysis.\n\"Binance had no idea who was moving money through their exchange,\" said Eterbase co-founder Robert Auxt. \nAfter the hack, Eterbase sought to work with Binance to recover the stolen funds. On September 9, 2020, Reuters reported that Binance CEO Changpeng Zhao tweeted that the exchange would \"do what we can to assist\" Eterbase.\n\nEmails shared with Reuters reportedly show that Binance declined to share information or account data without a request from law enforcement. \nEterbase eventually shut down its exchange and eventually filed for bankruptcy.\nThe company filed a criminal complaint with Slovakia's National Crime Agency (NCA) in June 2021. After the NCA sent two requests to Binance, according to the report, the exchange sent records for 24 accounts that were linked to usernames like \"benjaminfranklin\" and \"garathbale.\"  \nHydra\nThe Reuters report also estimates that Russian-language darknet site Hydra used Binance to process payments for drugs totaling $780 million.  \nHillman told Reuters that the total was \"inaccurate and overblown.\"\nEarlier this year, the U.S. Justice Department announced that it had cooperated with German law enforcement to seize Hydra's servers. At the time, the DOJ estimated that Hydra was responsible for 80% of all darknet crypto transactions and that it had received $5.2 billion since 2015.\n\nPosts reviewed by Reuters from Hydra show that in March 2018, Binance was the preferred way to process payments because of the minimal identifying information required to create an account.\n\"This is the fastest and cheapest way I've tried,\" one user wrote, according to Reuters.\n\nLazarus Attacks\nThe report frequently mentions Lazarus, a group of hackers that U.S. law enforcement has said uses its ill-gotten gains to fund North Korea's nuclear weapons program. As a result, the U.S. sanctioned Lazarus in 2019. \nChainalysis, which worked with Reuters on the report, estimates that the group had stolen crypto worth $1.75 billion by 2020.\n\nAccording to Reuters, Lazarus used Binance to launder money from the $5.4 million Eterbase attack in 2020 too, and the $622 million attack on the Ronin sidechain that connects Axie Infinity to the Ethereum network.\nHilman told Reuters that Binance has identified and frozen more than $5 million connected to the Ronin sidechain hack. He also said that the exchange continues to work with law enforcement agencies in the investigation.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102128/2-4b-crypto-has-been-laundered-through-binance-report",
            "id": "d64248eacc2e46756dbbf1392dc0eb16",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "At Least $2.4B in Crypto Has Been Laundered Through Binance: Report"
        },
        {
            "author": [
                "3 min read",
                "Liam J. Kelly"
            ],
            "content": "Twitter May Not Get Its Crypto-Friendly Owner: Elon Musk Seeks Exit From Deal - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessTwitter May Not Get Its Crypto-Friendly Owner: Elon Musk Seeks Exit From DealA letter contends that Musk is within his right “to terminate the merger agreement” should Twitter withhold information about bot activity.\nBy Liam J. KellyJun 6, 2022Jun 6, 20223 min readTesla CEO Elon Musk. Image: ShutterstockCreate an account to save your articles.The latest chapter of Elon Musk's Twitter acquisition may be the saga's last: A new letter to Twitter's general counsel alleges that the company hasn't met its obligations in closing the deal.\nThe Tesla and SpaceX CEO said he's been eager to gather precise data on spam and bot activity on the platform. In May, Musk said that the $44 billion acquisition was \"temporarily on hold\" until he could verify that fewer than 5% of Twitter users were fake. \nBut, according to Musk's counsel, Twitter has only ever provided details about its methodology for measuring such activity, not exactly how much of it occurs.\n\"Twitter's latest offer to simply provide additional details regarding the company's own testing methodologies, whether through written materials or verbal explanations, is tantamount to refusing Mr. Musk's data requests,\" reads the letter prepared by Musk's attorneys. \nIt continues by stating that Musk doesn't find these methodologies \"adequate\" and that he \"must conduct his own analysis.\"\nPerhaps most important, however, this tussle has been deemed a \"clear material breach\" of the two parties' merger agreement and gives Musk the right \"to terminate the merger agreement\" altogether. \n\n\"Breach of agreement\"\nRead: I made a stupid deal, but rules/laws don't apply to me.\n— Scott Galloway (@profgalloway) June 6, 2022\n\nTwitter shares are down about 3.4% to $38.81 as of this writing.\nIf the deal falls through, the social media platform may never see a host of crypto-infused upgrades Musk has hinted at since the deal began gaining traction.\n\nCrypto integration\nBesides becoming crypto Twitterati's poster boy, Musk does actually have a few ideas about how to integrate Web3 technology into the platform.\n\nFor starters, he'd look to tackle scams. \"If I had a Dogecoin for every crypto scam I see, I'd have 100 billion Dogecoins,\" he said in a recent interview. \nHe's also suggested using Dogecoin (or potentially another cryptocurrency) as a payment option for Twitter's premium Blue membership. \n\nTurning to crypto for payments has been a common thread running through Musk's plans. When discussing the potential of turning Twitter into a WeChat-esque \"super app,\" he noted that crypto payments could be one such feature.\nTwitter has yet to comment publicly, but already several business and media experts have weighed in.\nStephanie Ruhle of MSNBC reminded Twitter followers that Musk \"waived the right to due diligence in the merger agreement,\" meaning that it should be much harder for him to exit the deal.\nMeanwhile, Brian Quinn, a Boston College law professor, indicated that today's news shows that Musk wants out \"or something that will get leverage for a renegotiation of the price.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102125/twitter-may-not-get-crypto-friendly-owner-musk-seeking-exit-deal",
            "id": "1e0fa1894edc8c84b9b528918ca6db91",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Twitter May Not Get Its Crypto-Friendly Owner: Elon Musk Seeks Exit From Deal"
        },
        {
            "author": [
                "3 min read",
                "Andrew Asmakov"
            ],
            "content": "Binance Labs Makes Undisclosed ‘Strategic Investment’ in PancakeSwap - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessBinance Labs Makes Undisclosed ‘Strategic Investment’ in PancakeSwapBinace Labs has announced a strategic investment in PancakeSwap’s governance and utility token CAKE.\nBy Andrew AsmakovJun 6, 2022Jun 6, 20223 min readA stack of pancakes. Image: UnsplashCreate an account to save your articles.Binance's venture capital and incubation arm announced it invested in CAKE, the utility and governance token of decentralized exchange (DEX) PancakeSwap.\nThe undisclosed investment is part of the entity's \"mission to facilitate the next wave of global blockchain adoption by providing technology development, marketing and community support, and enterprise solutions for Web3 transformation,\" said Binance Labs.\n\nBinance Labs Makes Strategic Investment in PancakeSwap | Binance Blog https://t.co/GoGE1F5vVX\n— Binance Labs Fund (@BinanceLabs) June 6, 2022\n\nLaunched in September 2020, PancakeSwap is an automated market maker (AMM), allowing users to trade, swap, and stake BEP-20 tokens issued on Binance's BNB Chain.\nAccording to Binance Labs, PancakeSwap is currently the network's biggest decentralized app (dApp), with over 400,000 daily active users. In terms of total value locked (TVL) on the platform, DeFi Llama reports that the platform currently boasts $4.82 billion, making it BNB Chain's most valuable application too.\nBoasting $387 million in trading volume over the past 24 hours, PancakeSwap (v2)—the latest iteration of the protocol—is now the third-largest DEX behind Uniswap (v3) and dYdX only, per CoinMarketCap.\n\"PancakeSwap has been leading the development and mass adoption of BNB Chain. Given that PancakeSwap is the most widely used dApp and the DeFi project with the highest TVL on BNB Chain, we have and will continue to provide strong support for the project,\" Bill Qian, head of Binance Labs, said in a statement.\n\nBinance, which operates its own DEX, doesn't control or operate PancakeSwap, which was built by anonymous developers. It is not immediately clear whether this will change following today's announcement.\nDecrypt reached out to Binance Labs and will update the story accordingly, should we hear back.\nBinance, Cake, and PancakeSwap\nThe price of CAKE rallied to a weekly-high of $4.84 following the announcement, before correcting to $4.66 by press time, which is still up 7.14% over the last day.\nWith a market capitalization close to $761 million, CAKE is currently the industry's 66th-largest crypto asset.\n\nSince its launch in 2018, Binance Labs—marketed as \"a social impact fund and an initiative to incubate, invest, and empower blockchain and cryptocurrency entrepreneurs, projects, and communities\"— has invested in over 100 projects.\nIts portfolio includes such major projects as Audius, Axie Infinity, Dune Analytics, Elrond, Polygon, Optimism, The Sandbox, and 1inch, among others.\nLast week, Binance Labs announced a new $500 million investment fund dedicated to discovering and supporting \"projects and founders with the potential to build and to lead Web3 across DeFi, NFTs, gaming, Metaverse, social, and more.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102117/binance-labs-makes-undisclosed-strategic-investment-pancakeswap",
            "id": "710f60bb7100a1398e156416f341e26c",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Binance Labs Makes Undisclosed ‘Strategic Investment’ in PancakeSwap"
        },
        {
            "author": [
                "2 min read",
                "Sujith Somraaj"
            ],
            "content": "Justin Sun’s Terra-like Stablecoin Now Boasts Backing in Bitcoin, Tether, Tron - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsDeFiJustin Sun’s Terra-like Stablecoin Now Boasts Backing in Bitcoin, Tether, TronLaunched first as an algorithmic stablecoin, Tron's USDD has changed its operating model to avoid possible collapse like Terra’s UST.\nBy Sujith SomraajJun 6, 2022Jun 6, 20222 min readStablecoins (Image: Shutterstock)Create an account to save your articles.Created as an algorithmic stablecoin, Justin Sun’s Terra-like stablecoin USDD is now shifting gears towards a hybrid model with improved transparency. \nUSDD is now reportedly over-collateralized with a collateral ratio of 226.1%, according to data from Tron DAO, the organization responsible for maintaining the collateral of USDD. \nThe team behind USDD also promised a minimum collateral ratio of 130%, a ratio that it said was higher than the 120% collateral ratio maintained by MakerDAO’s DAI stablecoin. \nThis collateral ratio can also be much higher on MakerDAO depending on the asset one uses to mint more of the stablecoin. The range for borrowing DAI using Ethereum is between 130% and 170%. \nThe collateral backing USDD includes 14,040.6 Bitcoin, 240 million USDT, and approximately 1.9 billion Tron (TRX), the native token of the Tron ecosystem. \nThe backing can be verified using signatures on block explorers. \nCollateral backing USDD. Source: Tron DAO.\n“Congratulations to USDD on becoming the first over-collateralized decentralized stablecoin!” tweeted Justin Sun, the creator of USDD. \"A total of $1.37 billion of assets are backing the 667 million USDD in circulation.”\nTron (TRX), the native token of the Tron ecosystem, is up 5.21% over the past 24 hours and is changing hands at $0.084 apiece according to data from CoinMarketCap.\n\nWhat is USDD?\nLaunched on May 5, USDD is extremely similar to Terra’s stablecoin UST, an algorithmic stablecoin governed by smart contracts without any collateral backing. \nLast month UST crashed wiping out approximately $60 billion in investor wealth in a week’s time. Since then, algorithmic stablecoins have been heavily criticized, including USDD.\n\nUSDD’s dollar peg is governed by smart contract-based arbitrage algorithms between USDD and Tron.\nInvestors can always swap 1 USDD for $1 worth of TRX if the price of USDD trades above the dollar peg. By selling the newly-minted TRX, users can pocket arbitrage profits for keeping the coin at its dollar-peg, and vice-versa.\nThis same algorithm proved inefficient with UST, however. \nIt’s also the key reason that the Tron DAO has opted to change how its stablecoin operates.\n“This has been in the plan, but Terra/Luna definitely accelerated and prioritized this for our team” tweeted Justin Sun, the creator of USDD. “We want to have USDD to be overcollateralized.”\nNow, USDD has combined bits of collateralized stablecoins as well as algorithms to maintain its dollar peg.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102114/justin-sun-terra-stablecoin-boasts-backing-bitcoin-tether-tron",
            "id": "cbcdb4a9c0b5e6a6c4a924ed40d9c037",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Justin Sun’s Terra-like Stablecoin Now Boasts Backing in Bitcoin, Tether, Tron"
        }
    ],
    "length": 12,
    "timestamp": 1654580774.27762
}