{
    "data": [
        {
            "author": [
                "2 min read",
                "Andrew Asmakov"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "The prices of Bitcoin (BTC) and Ethereum (ETH) saw a 5% jump over the last day, giving investors renewed hopes for a much-anticipated market recovery after a brutal sell-off in May.",
                "Currently, Bitcoin is changing hands at $31,289, up 5.2% over the day, according to data provided by CoinMarketCap.",
                "The leading cryptocurrency last traded at these levels on June 1, when it entered a downward correction that dragged the price of BTC from above $32,000 below $30,000 for the most part of the weekend.",
                "Despite the latest spike, Bitcoin is still down more than 34% since the start of the year, with the Fear & Greed Index—a combination of variables measuring market sentiment—currently standing at 13, which corresponds to “extreme fear.”",
                "The price of Ethereum has meanwhile just hit an intraday high of $1,889, as it went up almost 6%, per CoinMarketCap.",
                "The second-largest cryptocurrency still faces a massive uphill battle to recover from the losses since the start of the year when it traded above $3,800.",
                "Ethereum's lackluster price action is compounded by a massive sell-off in the DeFi space. Over the last month, investors withdrew more than $40 billion from ETH-based apps, shrinking the total value locked (TVL) from over $113 billion on May 5 to $71.04 billion as of today, according to data from DeFi Llama.",
                "Elsewhere, major layer 1-networks Cardano (ADA) and Solana (SOL) both posted double-digit gains over the past 24 hours as their tokens rallied 13% and 11.4%, respectively.",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102104/bitcoin-ethereum-jump-crypto-market-rebounds",
            "img_src": "https://cdn.decrypt.co/resize/1536/wp-content/uploads/2020/04/shutterstock_6621196571-gID_5.jpg.webp",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Bitcoin, Ethereum Jump 5% as Crypto Market Rebounds"
        },
        {
            "author": [
                "2 min read",
                "Mat Di Salvo"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "The popular crypto game Stepn, which uses Solana NFTs, was hit with a number of distributed denial-of-service (DDoS) attacks this weekend, the third such occurrence in as many months.",
                "According to the app’s Twitter page, Stepn's devs were still working to fix the issue at the time of this writing.",
                "“We have been under multiple DDOS attacks in the past hours,” those behind the game said in a tweet on Sunday. “Securing the servers and recovery may take anywhere from 1 to 12 hours.”",
                "1/2We have been under multiple DDOS attacks in the past hours. Securing the servers and recovery may take anywhere from 1 to 12 hours. We recommend you take some rest during the maintenance or otherwise the work-outs may not be recorded properly.",
                "— STEPN | Public Beta Phase IV (@Stepnofficial) June 5, 2022",
                "",
                "Another tweet read: “We recommend you take some rest during the maintenance or otherwise the work-outs may not be recorded properly. Our engineers are working hard to fix the problems.”",
                "And yesterday, users also were notified that the game was experiencing “network congestion” after it was hit with 25 million DDoS attacks in a short period.",
                "A DDoS attack is when malicious actors try to bring down a website by overloading it with useless traffic. Such attacks are very common—particularly in the crypto world. ",
                "Stepn is a “move-to-earn” app where users are rewarded for moving outdoors. Players have to buy Solana-based NFT (non-fungible token) sneakers to play the game, and earn tokens when they run or walk. ",
                "",
                "The game, which calls itself a “Web3 lifestyle app,” has two tokens—one for utility (GST) and another for governance (GMT). ",
                "2/5. We were experiencing network issues due to a 25 million DDOS attack sent to the server within a short period of time. Due to network congestion, AI cannot receive user information and identify them as bots.",
                "— STEPN | Public Beta Phase IV (@Stepnofficial) June 4, 2022",
                "",
                "Hackers seem hellbent on bringing down the popular app: In April and again in May, the game announced people were trying to cripple it by sending millions of DDoS attacks.",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102091/move-to-earn-game-stepn-hit-with-ddos-attacks-again",
            "img_src": "https://cdn.decrypt.co/resize/1536/wp-content/uploads/2022/06/stepn_logo-e1654454261709-gID_1.jpg.webp",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "'Move-to-Earn' Game Stepn Hit With DDOS Attacks—Again"
        },
        {
            "author": [
                "2 min read",
                "Mat Di Salvo"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "A co-founder of the popular Bored Ape Yacht Club NFT collection yesterday lashed out at Discord after its server was exploited and NFTs worth 200 Ethereum ($358,962) were stolen from users. ",
                "Gordon Goner on Saturday wrote on Twitter that Discord, a chat app popular with the crypto community, “isn’t working for Web3 communities.”",
                "Discord isn’t working for web3 communities. We need a better platform that puts security first.",
                "— GordonGoner.eth (@GordonGoner) June 4, 2022",
                "",
                "“We need a better platform that puts security first,” he added.",
                "BAYC acknowledged the exploit on Twitter, adding, “The team caught and addressed it quickly.”",
                "Our Discord servers were briefly exploited today. The team caught and addressed it quickly. About 200 ETH worth of NFTs appear to have been impacted. We are still investigating, but if you were impacted, email us at discord@yugalabs.io.",
                "— Bored Ape Yacht Club (@BoredApeYC) June 4, 2022",
                "",
                "Yuga Labs, the team behind the NFT collection, said it was investigating the incident. But others in the crypto community said the hack was the fault of BAYC Discord users. ",
                "“Don’t blame Discord for users getting socially engineered, having DMs open and clicking phishing links,” wrote analyst OKHotshot. “Use the tool correctly first before blaming it.”",
                "While developer Cory.eth, who founded NFT collection OpenAvatar, added that users “just need to use the technology better.”",
                ".@GordonGoner you just need to use the technology better. Hit me up if you want an audit or implementation.https://t.co/zybdI0eICl",
                "— cory.eth (@cory_eth) June 4, 2022",
                "",
                "BAYC is a very sought-after collection of quirky ape profile pictures minted as NFTs on the Ethereum blockchain. Rich and famous people like Eminem, Madonna, and billionaire businessman Mark Cuban have all snapped them up.",
                "NFTs (non-fungible tokens) are deeds of ownership for digital items, and they're being used by some to help revolutionize the art and music worlds.",
                "",
                "Owners of Bored Apes have access to an exclusive Discord channel where they can discuss the NFTs.",
                "But Saturday’s exploit wasn’t the first time attackers leveraged BAYC’s social media channels. Just last month, BAYC’s official Instagram account was hacked, and thieves stole a total of $2.8 million by sharing a link to a scam website that pinched NFTs from users’ wallets.",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102076/bored-apes-co-founder-blames-discord-after-200-ethereum-snatched-in-exploit",
            "img_src": "https://cdn.decrypt.co/resize/1536/wp-content/uploads/2022/04/bored-ape-nfts-gID_2.jpeg.webp",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Bored Apes Co-Founder Criticizes Discord After NFTs Worth 200 Ethereum Snatched in Exploit"
        },
        {
            "author": [
                "2 min read",
                "Sujith Somraaj"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "More than 46,000 individuals have lost over a combined $1 billion in crypto-related scams since the beginning of last year, according to the Federal Trade Commission.",
                "Approximately $680 million in fraud was reported in 2021, and some $329 million was reported just in the first quarter of 2022, according to a report released Friday.",
                "Social media usage while holding crypto creates \"a combustible combination for fraud,\" the FTC wrote. \"Nearly half the people who reported losing crypto to a scam since 2021 said it started with an ad, post, or message on a social media platform.\"",
                "\"And most people are still unfamiliar with how crypto works,\" the report continued. \"These considerations are not unique to crypto transactions, but they all play into the hands of scammers.\"",
                "Bitcoin (70%), Tether (10%), and Ether (9%) were the most frequently stolen cryptocurrencies, according to the report.",
                "Nearly four out of every 10 dollars reported lost to scams that originated on social media since 2021 were linked to crypto, with Facebook (32%), Instagram (26%), and Whatsapp (9%) the most frequently cited platforms.",
                "Individuals age 20 to 49 were three times as likely to have reported being scammed compared with older age groups, but older individuals reported losing greater sums—the median amount for victims in their 70s was nearly $12,000.",
                "\"The stories people share about these scams describe a perfect storm: false promises of easy money paired with people's limited crypto understanding and experience,\" the FTC wrote. \"Investment scammers claim they can quickly and easily get huge returns for investors. But those crypto 'investments' go straight to a scammer's wallet.\"",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102080/roughly-70-of-1-billion-lost-to-crypto-scammers-since-2021-was-bitcoin-ftc",
            "img_src": "https://cdn.decrypt.co/resize/1536/wp-content/uploads/2022/06/ftc_hq_washington-e1654445244989-gID_1.jpg.webp",
            "timestamp": "Jun 5, 2022Jun 5, 2022",
            "title": "Roughly 70% of $1 Billion Lost to Crypto Scammers Since 2021 Was Bitcoin: FTC"
        },
        {
            "author": [
                "4 min read",
                "Tim Hakki"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "The two most striking conversations this week on the world's largest microblogging platform were Elon Musk's beef with Dogecoin co-creator Jackson Palmer, and Ethereum creator Vitalik Buterin's musings on a letter sent to Washington by crypto skeptics.",
                "On Monday, Australian news outlet Crikey published an interview with Palmer, who was promoting his new podcast, Griftonomics, when he laid into the crypto industry.",
                "\"I wish it was the end of crypto, but it's not,\" Palmer said, before turning his thoughts to Musk: \"He's a grifter. He sells a vision in hopes that he can one day deliver what he's promising, but he doesn't know that. He's just really good at pretending he knows.\"",
                "Palmer also said that he wrote a Python script that would automatically detect and report spam bots in a Twitter user's mentions. The Dogecoin-loving Musk allegedly reached out to Palmer and asked for the script, but, according to Palmer: \"It became apparent very quickly that he didn't understand coding as well as he made out. He asked, 'How do I run this Python script?'\"",
                "You falsely claimed ur lame snippet of Python gets rid of bots. Ok buddy, then share it with the world …",
                "— Elon Musk (@elonmusk) May 31, 2022",
                "",
                "The Tesla CEO responded by saying his children wrote better code than Palmer. Musk also called Palmer \"a tool.\"",
                "My kids wrote better code when they were 12 than the nonsense script Jackson sent me. ",
                "Like I said, if it’s so great, he should share it with the world and make everyone’s experience with Twitter better. If he does, you will see what I mean.",
                "Jackson Palmer is a tool.",
                "— Elon Musk (@elonmusk) May 31, 2022",
                "",
                "Palmer didn't reply directly to Musk's provocations, but he defended his spambot catcher in a subsequent mini-thread.",
                "I never said it was super complex, but this simple script definitely worked in catching and reporting the less sophisticated phishing accounts circa 2018... They've since evolved their tactics.",
                "I shared it with a lot of people, and it worked for them. https://t.co/iKPFsYHXEG",
                "— Jackson Palmer (@ummjackson) May 31, 2022",
                "",
                "On Wednesday, the Financial Times reported that a letter signed by 26 anti-crypto computer scientists, tech bloggers, and academics, including many former FAANG employees, had been presented to U.S. lawmakers.",
                "The letter urges regulators to \"take a critical, skeptical approach toward industry claims that crypto-assets are an innovative technology that is unreservedly good,\" and it asked them to \"resist pressure from digital asset industry financiers, lobbyists, and boosters.\"",
                "Ethereum creator Vitalik Buterin appeared to respond to the letter in a tweet thread on Friday.",
                "A big difference between the \"new idealistic movement\" scene 10-15 years ago vs today is that back then it felt possible to be on all the good-guy teams at the same time. Today, much more adversarial thinking and conflict.",
                "I've been trying to understand.. where to from here?",
                "— vitalik.eth (@VitalikButerin) June 2, 2022",
                "",
                "Buterin also stated that crypto fans were upset and confused that British-Canadian tech blogger Cory Doctorow was a signatory to the letter, because they’d considered him an ally. In 2018, Doctorow delivered a keynote speech called “Decentralize, Democratize, or Die” at DevCon, the annual Ethereum developer conference.",
                "As Cory mentioned, crypto was at first just decentralization enthusiasts, but now there's also various types of \"money people\".",
                "This is an inevitable part of becoming bigger. In non-financial movements too, various classes of normies and often soon grifters move in over time.",
                "— vitalik.eth (@VitalikButerin) June 2, 2022",
                "",
                "Buterin also mentioned that he's unhappy with the amount of infighting in the crypto community. He suggested it was a byproduct of success, because as businesses scale up they find themselves in more direct competition with each other.",
                "One important factor is that all of those movements *got much bigger* in the last decade. When something is small, even if you don't like it, it's not a threat, so it's easy to live-and-let-live. When everything is big, more competition, so more incentive to point out problems.",
                "— vitalik.eth (@VitalikButerin) June 2, 2022",
                "",
                "I guess the conclusion is, peacekeeping and cooperation-seeking needs to be an explicit effort rather than peace being an assumed default.",
                "— vitalik.eth (@VitalikButerin) June 2, 2022",
                "",
                "Lachlan Markay of Axios provided a pithy account of how Rep. Madison Cawthorn (R-SC), who's being investigated by the House Committee on Ethics for an alleged pump-and-dump scheme involving the \"Let's Go Brandon\" coin, spent the last 10 days of 2021.",
                "Wild chain of events:Dec 21: Madison Cawthorn buys up to $250k in Let's Go Brandon CoinDec 29: His IG post predicts LGB is going \"to the moon\"Dec 30: Previously undisclosed endorsement deal sends LGB skyrocketingDec 31: Cawthorn sells off LGB holdingshttps://t.co/yioN3uPJly",
                "— Lachlan Markay (@lachlan) June 1, 2022",
                "",
                "On Thursday, branded NFT creator Nifty’s announced a major partnership with Warner Bros.",
                "Tweety’s coming to Nifty’s! And that's not all folks. 😉",
                "We're partnering with @WarnerBros to bring you Looney Tunes: What's Up Block?, a story-driven @LooneyTunesNFT program for the ultimate fan. There will be 10,000 Tweety Avatars at $80 each and more characters coming soon! pic.twitter.com/a7pqsXf0NM",
                "— Nifty's (@Niftys) June 2, 2022",
                "",
                "Also that day, blockchain sleuth ZachXBT wrote a lengthy thread about Animoon, an NFT scam that couldn’t be more blatant to anyone even dimly aware of recent pop culture.",
                "1/ Let’s breakdown the $6.3m NFT rug Animoon, a project that has constantly screwed over its holders since day 1. pic.twitter.com/pEPhQ2bfeQ",
                "— ZachXBT (@zachxbt) June 2, 2022",
                "",
                "Barry Silbert, founder of the Digital Currency Group (which includes crypto asset management giant Grayscale), took issue with a proposal by the New York State Senate to impose a two-year moratorium on all fossil fuel-powered proof-of-work crypto mining, calling it a \"job killer.\"",
                ".@SenKennedy -- we're one of the biggest employers in western NY with 150 employees in Rochester and we're building a second massive office in Buffalo. This moratorium bill is a job killer and sends a terrible message to crypto entrepreneurs. Please support innovation and vote no https://t.co/ON90oeYRbc",
                "— Barry Silbert (@BarrySilbert) June 3, 2022",
                "",
                "But State Senate Bill S6486D passed 36-27 on Friday morning. It's now headed to the desk of Gov. Kathy Hochul, who gets 10 days to sign it into law or veto it.",
                "Coinbase, in the wake of a Q1 loss of $430 million, announced on Thursday it would not only be freezing hiring, it also would be rescinding offers recently accepted by candidates. Recruitment company Blind tweeted a job offer letter, which promised recipients the company wouldn't be rescinding offers, alongside an email doing exactly the opposite.",
                "Coinbase sent a welcome email to new hires 2 weeks ago promising that they won't rescind offers (1st image).",
                "Yesterday, they sent the rescind emails (2nd image) leaving candidates in frustration.",
                "We have a referral thread going on to help those who were impacted 👇 pic.twitter.com/lIQe0ph4rk",
                "— Blind (@TeamBlind) June 3, 2022",
                "",
                "And finally, Kanye West has decided that it is indeed time to ask him about NFTs.",
                "Kanye West believes in NFTs 🔥 pic.twitter.com/phzFpVQSRn",
                "— Blockworks (@Blockworks_) June 3, 2022",
                "",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102060/this-week-on-crypto-twitter-elon-musk-and-dogecoin-co-creator-jackson-palmer-exchange-words",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 5, 2022Jun 5, 2022",
            "title": "This Week on Crypto Twitter: Elon Musk and Dogecoin Co-Creator Jackson Palmer Exchange Words"
        },
        {
            "author": [
                "5 min read",
                "Shuyao Kong"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "Crypto conferences used to be quite the scene in Shanghai: fancy venues in five-star hotels, rooftop bars overlooking Huangpu River at The Bund, where chandeliers sparkled above well-dressed, champagne-sipping attendees, chatting the night away before heading out to clubs where more champagne gets poured.",
                "That scene is no more, now that China’s “zero Covid” policy has turned the buzzing city into a ghost town. Some residents have reported being cooped up in their homes for three months, not once stepping outside.",
                "But the lockdown did not stop ETH Shanghai from happening—this year, a virtual-only event.",
                "ETH Shanghai went live May 20 with an unusual list of speakers: a combination of high-flying Chinese and U.S. government officials, and O.G. Ethereum founders.",
                "The two groups couldn’t have been in greater contrast, and the dichotomy reflects how the crypto community is trying to survive in China: striking a balance between being politically correct (at least in public) but still true to crypto’s grassroots spirits.",
                "What’s really going on in the Chinese community these days?",
                "I just got a phone call from a business school friend. He had started an Invisalign-esque direct-to-consumer company in Shanghai in 2019. The team raised a bunch of VC money, but couldn’t gain adoption. As a result, he pivoted from oral health—a rather hot industry back in the day—to crypto. ",
                "My friend is far from alone. Web2 talent has been severely crippled by the Chinese government’s “zero COVID” policy and tech crackdown. Major tech giants’ stocks have halved, if not worse. Many brilliant engineers have seen no salary increases, nor equity bumps. What’s worse, many companies have started to lay off engineers in anticipation of a global economic slowdown.",
                "Tech giants have become tech dwarves.",
                "In the meantime, these brilliant engineers are seeing their not-so-talented friends getting rich by buying profile pictures, participating in algo-stable Ponzi schemes, or even walking on StepN.",
                "Many of them said they feel bitter, yet still want to join the Web3 Ponzi revolution.",
                "Now comes the tricky part. To join the revolution, these engineers must always account for regulation, because the Chinese government is not expected to revert its crypto ban any time soon.",
                "Three creative strategies have emerged as Chinese founders navigate the space: ",
                "Anonymity",
                "Most projects choose the anonymous route because it’s safer to stay under the radar. The issue, however, is the type of projects that Chinese founders tend to start. During DeFi summers, many simply forked existing western projects and launched yield farms. During NFT summers, many simply contracted a Fiverr designer and launched 10,000 monkey PFP projects with a fake roadmap.",
                "Not all Chinese projects are rugpulls, of course. But anyone who wants to build a serious business has to stay low key, which means they have to refrain from public marketing, shilling, or narrative building. Without marketing, projects struggle to take off. ",
                "Academia",
                "The second route allows you to be public about being a blockchain startup by waving the academic flag. Many of China’s layer-1 protocols like Conflux used this tactic. They openly collaborate with university professors, research labs, and innovation centers. Many also have an active student community that helps organize meetups, hackathons, even mini-conferences.",
                "Western Web2 companies want to collaborate with these “deep tech” companies as well, to keep up with the innovation curve. ",
                "These projects are in the safe zone, at least temporarily, because China wants to develop capability in the areas of distributed systems, cryptography, privacy, and blockchain.",
                "The main challenge these projects might face is if they ultimately launch a token, and that token becomes volatile. The Chinese government does not like volatility, and it might extend the ban to block these projects.",
                "Apart",
                "The last option, and an increasingly popular one, is a combination of having founders and marketers living abroad, while the tech and delivery team live quietly in China. This model allows teams to raise VC money from international funds, run campaigns that target global audiences, and build robust communities, enjoying China’s low-cost tech labor without the worry of being censored by the Chinese government.",
                "Amusingly, most projects that follow this model tend to claim that “we are not a China project,” as if being associated with China is bad.",
                " This brings to my next observation: China is not a place, it’s its people.",
                "As Chinese projects expand abroad in a time of increasing decentralization, China has become less a place and more about its people. The people can live in Singapore, Australia, America, or Europe. Location doesn’t stop them from organizing, supporting, and participating in ETH Shanghai.",
                "We’re already seeing Chinese diasporas making a mark in the crypto space. Remember earlier in the year when I predicted that China would produce a hit crypto game? Well, that’s already happened with the rise of StepN, a move-to-earn game that ignited an Axie Infinity-like frenzy.",
                "The project, standing at a market cap of $680M, is founded by Chinese diasporas in Australia, supported by VCs in India, China, America, and practically everywhere else. ",
                "Even as the world became increasingly segregated in the time of COVID, the boundaries around what it means to be Chinese are truly blurred. What unites us all isn’t so much nationality, but the spirit of crypto.",
                "Granted, that spirit is affected by a wider array of factors, judging from how many of my friends escaped China in recent months to start a nomadic, crypto-focused life.",
                "Still, I’m optimistic.",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102072/what-it-means-to-be-chinese-in-crypto",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 5, 2022Jun 5, 2022",
            "title": "What It Means to Be Chinese in Crypto"
        },
        {
            "author": [
                "2 min read",
                "Sujith Somraaj"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "Coinbase announced on Thursday it wasn’t just freezing hiring—the U.S.-based crypto exchange would be rescinding recently agreed-to offers with prospective employees.",
                "Understandably, many of those would-be employees are furious, especially after Coinbase, after reporting a $430 million Q1 loss, sought to reassure the new hires via email, literally writing, “... we will not be rescinding the offers of any employees who have already signed or have received offers from us.”",
                "The decision by Coinbase, announced the same day Gemini Trust Co. said it would be cutting 10% of its workforce, doesn’t just jeopardize some of these developers’ ability to pay bills—it puts at risk their ability to stay in the U.S.",
                "Coinbase sent a welcome email to new hires 2 weeks ago promising that they won't rescind offers (1st image).",
                "Yesterday, they sent the rescind emails (2nd image) leaving candidates in frustration.",
                "We have a referral thread going on to help those who were impacted 👇 pic.twitter.com/lIQe0ph4rk",
                "— Blind (@TeamBlind) June 3, 2022",
                "",
                "“I am left speechless of the irresponsibility Coinbase has shown in managing hires and helpless about my current situation,” Chung Wook Ahn, who accepted his offer in February, wrote on Linkedin. “As an international student on an OPT visa, I have only 90 days left to find another position before I no longer could maintain the status.”",
                "Other devs, including Tianyou Xiao and Bharat Mahajan, shared stories of similar peril.",
                "Adam Kopec, who’d already quit his previous job, appeared more optimistic than most, calling Coinbase’s decision “wild,” but adding, “Oh well. Who’s building cool stuff in Web3 / who should I meet with instead?”",
                "Welp, yesterday I was shocked to found out that @coinbase rescinded my IC7 Product Design accepted job offer after I already quit my job. Wild.",
                "Oh well. Who’s building cool stuff in web3 / who should I meet with instead?https://t.co/ja2F4Gyqjs",
                "— Adam Kopec ツ (@akopec) June 3, 2022",
                "",
                "Coinbase shares on Friday closed at $66.69, down more than 80% from their all-time high.",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102039/jilted-would-be-coinbase-employees-vent-online-after-jobs-they-accepted-are-eliminated",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 4, 2022Jun 4, 2022",
            "title": "Jilted Would-Be Coinbase Employees Vent Online After Jobs They Accepted Are Eliminated"
        },
        {
            "author": [
                "3 min read",
                "Daniel Roberts"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "If you don't think we're in Crypto Winter yet, consider these headlines from the week: Gemini laid off 10% of its staff; Coinbase instituted a hiring freeze and rescinded accepted job offers; Mexico's largest crypto exchange Bitso laid off 10% of its staff; and Argentina-based crypto exchange Buenbit laid off 45% of its staff.",
                "The news is bad. And if you're an engineer who got a letter from Coinbase canceling a job offer you already accepted, there's no silver lining here. It's enough to make someone sour on working in the crypto industry at all.",
                "But if you zoom out, there's reason not to panic.",
                "Those calling this period the end of crypto (and there are so many saying it) clearly weren't in this industry in 2018. During that time, in which Bitcoin tanked 70% after peaking at $20,000, I kept hearing the same refrain from crypto execs and entrepreneurs I'd welcome on Yahoo Finance live shows: \"We're putting our heads down and building now.\" It was difficult not to scoff at that talking point back then, because what else could they say? But many of the tools and platforms built during that time became the key success stories of the pandemic-prompted crypto boom in 2020 and 2021. They really did build things.",
                "This is why it's reasonable for Dan Held, a Bitcoin O.G. who sold his price app ZeroBlock to Blockchain.com in 2013 long before he was a Twitter influencer with 600,000 followers, to declare that this Crypto Winter will be milder than past winters.",
                "Held joined me for a chat at CoinMarketCap's virtual conference last week and said people are now going back \"from HODL to BUIDL... The original Bitcoin ethos was all about building. Back in the early era, everyone had their own side project because they needed to go build something to make the ecosystem better. ... Now we've got A-players across all of tech wanting to come build things in the crypto ecosystem, we've got VC funds raising tens of billions of dollars in aggregate to go deploy into this ecosystem, so I don't think this winter is going to be as harsh as the other ones.\"",
                "Another crucial point about this Crypto Winter is that non-crypto tech stocks aren't faring any better right now. Pandemic darlings Peloton (PTON) and Zoom (ZM) are down 60% and 40% this year, respectively. How about those once-hallowed FAANG names? Facebook (changing its stock ticker to META next week) is down 45% this year, Amazon (AMZN) is down 28%, Apple is down 20%, Netflix (NFLX) is down 68% (goodness gracious), and Alphabet (GOOG) is down 22%.",
                "No matter what, rescinding job offers is a terrible look, and Coinbase's reputation will now take yet another P.R. hit. But companies often have to cut head count during downturns—it's what they do to survive. When other large companies make job cuts (like in March 2020) the media reaction is not to declare their industry dead. But crypto, in the big scheme of things, is still so new (even after 13 years for Bitcoin) that skeptics still insist the entire thing could collapse.",
                "It will not.",
                "This is Roberts on Crypto, a weekend column from Decrypt Editor-in-Chief Daniel Roberts and Decrypt Executive Editor Jeff John Roberts. Sign up for the Decrypt Debrief email newsletter to receive it in your inbox every Saturday. And read last weekend's column: Ethereum's Merge is Coming and the Stakes Couldn't Be Higher.",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102031/crypto-winter-layoffs-gemini-coinbase",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 4, 2022Jun 4, 2022",
            "title": "Crypto Winter Layoffs Hit Hard—But Won’t Kill the Industry"
        },
        {
            "author": [
                "5 min read",
                "Tim Hakki"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "After eight straight downward weeks, cryptocurrency markets began to level off.",
                "Market leader Bitcoin grew almost 2% over the last seven days to trade at $29,599 as of this writing, while Ethereum remained practically unchanged at $1,778.",
                "Most of the biggest cryptocurrencies were little changed from a week ago, but a handful of projects, as of this writing, had made significant gains:  The privacy coin Monero blew up more than 8% to $192, Stellar rallied more than 16% to $0.14, NEAR rose almost 9% to $5.26, and Cardano jumped almost 22% to $0.56.",
                "",
                "There were no major losses among the top 30 cryptocurrencies by market capitalization, except for Solana, which crashed more than 10% to $37.57 in large part because on Wednesday the blockchain went down for more than four hours.",
                "The week began with news that this year’s Eurovision winners, Kalush Orchestra, raised 500 ETH—nearly a million dollars—for their beleaguered homeland, Ukraine. The group raised the money by auctioning their Eurovision trophy together with an NFT of it.",
                "Kalush Orchestra wrote on Facebook: “You guys are amazing. We appreciate each and every one of you who donated to this auction and a special thanks to the team WhiteBit who purchased the trophy for $900,000 and are now the rightful owners of our trophy.”",
                "The Bank of England on Tuesday announced it soon will have the power to intervene over collapsing stablecoins if it decides a stablecoin issuer “has reached systemic scale fail.”",
                "The British government wants to amend the UK’s Financial Market Infrastructure Special Administration Regime to bring crypto within the jurisdiction of the central bank by broadening the legal definition of a “payment system” to include it. This would provide the British central bank with sweeping powers of “direction” and “oversight” over failing stablecoin issuers.",
                "That same day, local press reported that the South Korean government is launching a Digital Assets Committee to oversee crypto exchanges as early as next month.",
                "“The launch of the Digital Assets Committee will be immediately after the inauguration of the new Financial Services Commission (FSC) Chairman,” a government official told NewsPim. The FSC is the country’s top financial regulator, and newly elected President Yoon Suk-yeol is expected to appoint a new chair in the coming weeks.",
                "The Digital Assets Committee will make policy recommendations, including the criteria for cryptocurrencies to be listed on exchanges, schedule ICOs (initial coin offerings), and enforce investor protections ahead of the Digital Asset Basic Act (DABA)—a major crypto policy package to be enacted next year.",
                "On Wednesday, the Financial Times reported that an anti-crypto letter signed by 26 computer scientists, tech bloggers, and academics had been presented to U.S. lawmakers in Washington. The letter quickly drew a response from the crypto community, which took umbrage with the fact that so few of the letter’s signatories had blockchain industry credentials. Several were extremely unhappy about the letter’s misleading claim that blockchain transactions are irreversible.",
                "It came to light on Wednesday that rap star Kanye West has filed 17 trademark applications with the U.S. Patent and Trademark Office. Some of the filings mention potential “non-fungible assets,” “metaverse experiences,” and “providing an online marketplace for buyers of crypto and/digital collectibles, currencies, tokens, and assets.” ",
                "West’s applications focus on his brand YEEZUS, also the name of his 2013 album and promotional tour. Earlier this year, West wrote on Instagram: “STOP ASKING ME TO DO NFT’s ... FOR NOW I’M NOT ON THAT WAVE I MAKE MUSIC AND PRODUCTS IN THE REAL WORLD.”",
                "On Thursday, leading small business retirement planners ForUsAll announced that it’s suing the U.S. Department of Labor for planning to restrict companies from offering crypto investment options to 401(k) retirement plan holders.",
                "“The DOL plays several important roles that serve American workers—but ‘armchair financial adviser’ shouldn’t be one of them,” ForUsAll CEO Jeff Schulte said.",
                "That same day, pop star The Weeknd announced a Binance-sponsored “crypto-powered world tour” in support of his fourth album, “After Hours.” The crypto exchange will work with Toronto’s HXOUSE incubator to develop an NFT collection for the tour. Concertgoers will receive virtual ticket stubs redeemable for commemorative NFTs.",
                "Binance is also donating $2 million to The Weeknd’s XO Humanitarian Fund, which was formed early this year. The Weeknd and Binance will collaborate on additional NFTs and donate 5% of all sales to the fund.",
                "Finally, the New York State Senate on Friday passed a bill to impose a two-year moratorium on all fossil fuel-powered proof-of-work crypto mining operations. Senate Bill S6486D passed 36-27 during a morning vote, and now it’s headed to the desk of Gov. Kathy Hochul, who has a 10-day window to sign it into law or veto it.",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102033/this-week-in-coins-markets-flatten-kanye-files-web3-trademarks-eurovision-winners-sell-trophy-to-benefit-ukraine",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 4, 2022Jun 5, 2022",
            "title": "This Week in Coins: Markets Flatten, Kanye Files Web3 Trademarks, Eurovision Winners Donate Ethereum to Ukraine"
        },
        {
            "author": [
                "3 min read",
                "Liam J. Kelly"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "Lots of strange things happen when your voting rights can be easily swapped for cash.",
                "In meatspace politics, this is true and we see its symptoms regularly. We see it when powerful lobbying groups buy elected officials to shill more toothpaste or when campaigns spend tons on advertising.",
                "But only in crypto can your vote be quite literally exchanged for money.",
                "Just look at the various governance tokens with trading volumes in the hundreds of millions. The equivalent would be like telling someone that your one vote for U.S. president has just fallen below its 50-day moving average and is now entering a cup-and-balls formation—in trading terms, extremely bearish.",
                "And this week the cryptosphere enjoyed yet another opportunity to dig into this dynamic when Optimism, the Ethereum scaling solution project, doled out 5% of its OP token supply in an airdrop to a variety of users.",
                "Recipients of the OP token can either hold the tokens and become members of the DAO, or they can delegate their holdings to someone who has perhaps more knowledge or more time to help grow the project.",
                "Ethereum Name Service (ENS) did something quite similar with its airdrop, creating a sort of federalized system.",
                "Nathan van der Heyden, a crypto governance guru at Snapshot Labs, told Decrypt, “The values of the Optimism collective were clearly defined and users were able to opt in to governance, or delegate to someone who matches their view. This clear framework allows quality governance. Well-defined processes are the key to steering a community in the right direction, even more so than good values.”",
                "And the reason the above-tiered system is used is based on the assumption that people who use Optimism and/or adjacent services (i.e. layer-2 solutions or governance in crypto) are also incentivized to see that this service continues to improve and thrive (regardless of token performance).",
                "It’s a noble cause with good intentions. Still, crypto is a rather cynical industry.",
                "Pretty much as soon as the airdrop officially launched, OP plummeted. CoinMarketCap shows that the token entered the market at roughly $4.50 at 1:30 p.m. EST, before dropping as low as $0.79 just a few hours later.",
                "That’s an 82% decrease. Yikes.",
                "What happened? People who received the OP token immediately dumped it.",
                "By collating data from both Dune Analytics and an Optimism-specific block explorer, we can see that roughly 31,800 eligible addresses had dumped their holdings by press time.",
                "The mass selloff has drawn ire from many in the community, with critics saying that users are selling “responsibility” and ownership of the project.",
                "Bridges literally running out of liquidity as shameless degens dump their $OP and flee back to mainnet 😂😂",
                "Not so much passion for responsibility tokens and public goods funding during the bera 😂😂 https://t.co/7j6SmvN1hK",
                "— kamikaz ΞTH (@kamikaz_ETH) June 1, 2022",
                "",
                "But as van der Heyden told Decrypt, “People are mad at airdrop dumpers because they feel like the airdrop comes with some sort of digital handshake. ‘I’ll give you this free money, in exchange you participate in governance and you help our network grow.’”",
                "“In reality,” he added, an airdrop “comes with no strings attached.”",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102025/what-responsibility-do-token-airdrop-recipients-have",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 4, 2022Jun 4, 2022",
            "title": "What ‘Responsibility’ Do Token Airdrop Recipients Have?"
        },
        {
            "author": [
                "3 min read",
                "Sujith Somraaj"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "The ApeCoin community is eyeing a potential departure from Ethereum following a tumultuous token launch back in March. ",
                "Dubbed ApeCoin Improvement Proposal (AIP) 41, the vote asks token holders, many of which are also Bored Ape Yacht Club (BAYC) NFT owners, whether they stand with Yuga Lab’s commentary to launch a proprietary blockchain just for the community.",
                "The idea came after the initial ApeCoin drop. As demand for the token skyrocketed, gas fees on Ethereum soared, rendering the number two crypto network prohibitively expensive for many users. ",
                "“We're sorry for turning off the lights on Ethereum for a while,” the company behind the popular NFT collection tweeted following the ApeCoin airdrop. “It seems abundantly clear that ApeCoin will need to migrate to its own chain in order to properly scale. We'd like to encourage the DAO to start thinking in this direction.”",
                "The suite of Yuga Labs’ creations include the BAYC collection, Mutant Ape Yacht Club (MAYC), and Bored Ape Kennel Club (BAKC). All of these currently projects exist on Ethereum. ",
                "The community is now voting on whether it should indeed migrate, as per Yuga Labs’ encouragement. ",
                "",
                "Specifically, AIP-41 states that “at least for the time being, ApeCoin should remain within the Ethereum ecosystem, and not migrate elsewhere to an L1 chain or sidechain not secured by Ethereum.” ",
                "Votes are then pulled from ApeCoin holders who either agree or disagree this statement.",
                "“First, my primary concern is that migrating to a different chain is a highly complex decision and shouldn't be rushed,” the co-author of the proposal Matt Galligan told Decrypt. “I believe staying within Ethereum gives ApeCoin the strongest security model.”",
                "The voting has thus far been heavily one-sided, with nearly 91% of the ApeCoin holders supporting the proposal. ",
                "Just 9% of holders have voted against the proposal, supporting a migration.The vote will end by June 9, 2022.",
                "“Staying in the Ethereum ecosystem is profitable for APE holders. This is because Ethereum is the financial hub of blockchains.” R3RUCHI, an ApeCoin holder who voted for the proposal told Decrypt. “Since APE aims to be the metaverse currency, it has to be in the hub.”",
                "If passed, this proposal would prevent any future proposals from Yuga Labs regarding the migration of ApeCoin for a period of three months from the end of this vote. ",
                "After that, though, anything is possible. ",
                "And with a bit more time to discuss such a transition, perhaps the community will have changed its mind. ",
                "“This AIP is essentially two things,” said Galligan. “[It’s] a temperature check for the DAO's desire to stay within the Ethereum ecosystem and [secondly] its a three-month delay to set up a more diligent governance process for big and likely irreversible decisions.”",
                "APE currently trades at $6.1o, up 0.5% over the past 24 hours, according to CoinMarketCap.",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102024/apecoin-community-looks-set-stay-ethereum-for-now",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 4, 2022Jun 4, 2022",
            "title": "ApeCoin Community Looks Set to Stay on Ethereum—For Now"
        },
        {
            "author": [
                "3 min read",
                "Andrew Hayward"
            ],
            "content": [
                "Menu",
                "Search",
                "About",
                "A fast food joint called Bored & Hungry — the first eatery inspired by a Bored Ape Yacht Club NFT — opened in Los Angeles this spring. Now the team behind that eatery is bringing in rapper and NFT enthusiast Snoop Dogg to open up its next NFT-themed restaurant.",
                "Snoop Dogg and Food Fighters Universe—a startup co-founded by Andy Nguyen, Kevin Seo and Phillip Huynh—have announced plans to open Dr. Bombay’s Sweet Exploration, an “immersive retail dessert experience” that will similarly take root in Los Angeles.",
                "Dr. Bombay is the name that Snoop (born Calvin Broadus Jr.) has given his Bored Ape Yacht Club avatar. The Bored Ape Yacht Club is one of the most popular Ethereum NFT collections, spanning 10,000 unique avatars depicting disinterested cartoon apes. The NFTs have collectively generated more than $2.1 billion in secondary market trading volume to date.",
                "Announcing the newest member on the Food Fighters Universe team @SnoopDogg AKA Dr. Bombay 👀 pic.twitter.com/itZqpG3neQ",
                "— Food Fighters Universe (@FoodFightersU) June 3, 2022",
                "",
                "The Bored Ape Yacht Club, created by startup Yuga Labs, grants its NFT holders the right to commercialize their owned images. As such, Bored Apes have been used for products ranging from apparel to beer and marijuana packaging, as well as virtual band projects and upcoming film and TV productions.",
                "In other words, Snoop’s dessert restaurant isn’t an “official” Bored Ape restaurant created by Yuga Labs, but the rapper is well within his rights to use his owned NFT image for it. An NFT serves as a proof of ownership for an item—in this case, a digital image of an ape that also provides access to a community of owners, plus commercial rights and other perks.",
                "Bored & Hungry takes the same approach as the upcoming dessert shop. It features branding and decor inspired by Bored Ape and Mutant Ape Yacht Club NFTs owned by the restaurant’s creators, as Decrypt discovered when visiting the eatery in April. Food Fighters Universe plans to launch its own NFTs that provide various benefits around its restaurants.",
                "Snoop Dogg is already deeply entrenched in the NFT space. He owns Bored Ape Yacht Club NFTs and has collaborated with projects such as The Sandbox on Ethereum and Clay Nation on Cardano. He also released NFTs based on the classic Nyan Cat meme.",
                "The rapper also claims to be the person behind Cozomo de’ Medici, a pseudonymous Crypto Twitter personality and NFT collector with a valuable multi-million-dollar collection including CryptoPunks, Art Blocks, and XCOPY pieces. Snoop’s son, Cordell Broadus, goes by the name Champ Medici on Twitter and is also involved in the restaurant initiative.",
                "“Food Fighters Universe is bridging food and Web3 and blazing a trail with real-life utility for NFTs,” said Cordell, in a release. “It’s the future of the restaurant industry, and my dad and I are thrilled to join the team and utilize their expertise to bring Dr. Bombay to life.”",
                "Copy article link",
                " "
            ],
            "href": "https://decrypt.co/102008/snoop-dogg-to-open-bored-ape-nft-themed-dessert-restaurant",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 4, 2022Jun 4, 2022",
            "title": "Snoop Dogg to Open Bored Ape NFT-Themed Dessert Restaurant"
        }
    ],
    "length": 12
}