{
    "data": [
        {
            "author": [
                "4 min read",
                "Jason Nelson"
            ],
            "content": "Justin Aversano’s Quantum Opens Physical NFT Gallery in LA to ‘Uplift Other Artists’ - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsNFTsJustin Aversano’s Quantum Opens Physical NFT Gallery in LA to ‘Uplift Other Artists’Aversano's L.A. hub, the first of potentially many Quantum Spaces, is designed for fostering real-world Web3 communities.\nBy Jason NelsonJun 6, 2022Jun 6, 20224 min readJustin Aversano poses at his new Quantum Art gallery in Santa Monica, CA, on June 3, 2022. (Photo: Jason Nelson)Create an account to save your articles.A new art installation co-founded by prominent NFT photographer Justin Aversano has opened its doors on the iconic Third Street Promenade in Santa Monica, California. Quantum Space LA is the latest in a growing trend of physical NFT galleries, in which artists can showcase their digital work in a real-world setting. \nAversano, known for the in-demand Twin Flames NFT photography collection, used the grand opening of Quantum Space LA on Friday to launch his newest project, Doppelgänger, a collection of 1,000 outtakes from Twin Flames. It continues Aversano's theme of photographing twins and turning those images into collectible NFT assets.\nNFTs are cryptographically unique tokens linked to digital and sometimes physical content, providing proof of ownership, membership to an exclusive club, or other potential perks. They are often used to represent digital goods such as photos, illustrations, and collectibles.\n\nQuantum Art is a photography-centric NFT platform that Aversano co-founded last fall. In February, the platform raised $7.5 million in funding. The Santa Monica space was announced in April ahead of its grand opening this weekend.\nLarge flat-screen televisions line the walls throughout the location, displaying images from various digital artists who have partnered with the startup to showcase and sell their work. Photos of twin siblings taken by Aversano all around the world are projected onto large hanging curtains in the center of the space.\n\"Twin Flames basically gave birth to Quantum. The success of Twin Flames, the community around Twin Flames, pushed me to support other photographers,\" Aversano told Decrypt at Friday’s opening event.\n\nAversano said that the Santa Monica space is an experiment; the next opening is planned for this fall in New York, with hopes to launch similar installations worldwide.\"We plan to open one a month next year,\" Aversano said. \"We want to have 20 to 50 spaces around the world.\"  \n“I'm thrilled and really interested to see how it kind of plays out, and how we could potentially change the narrative of ‘NFTs are bad’ and ‘NFTs are not eco-friendly,’” said UnicornDAO’s Rebecca Lamis, who also manages Quantum Space LA. “I think there's a lot of impact we can do in that capacity.”\nLamis said that the June 3rd opening was a soft launch of the space, but passersby appeared to be immediately interested, clamoring to come into the space to find out what it was all about.\nAs Aversano explained, the Quantum Spaces are paid for with the money raised from selling NFT minting keys ahead of time. The Quantum Keys were minted in March for the LA location, and now start at 4.15 ETH ($7,700) on secondary marketplaces. NFT holders gain access to an exclusive area of the gallery, and can use the venue to host events.\n\"We have enough treasury funding to work with artists and commission them to do mints,\" Aversano told Decrypt. He added that each future Quantum Space location will mint its own NFT collection to ensure that each location is unique and has its own membership group.\nAversano explained that Quantum is not just about him, but about also enabling other artists and creators through his own prosperity. \"I was able to uplift other artists with my success, which is what I love to do,\" he said. “And I want to share the abundance, because that's what being an artist and a good person is about—to share the wealth.\"\nWhile Quantum Art was founded with an initial focus on photography, the platform will branch out to encompass other types of artwork. Aversano said that it could include contributions from sculptors, painters, digital artists, fashion designers, and others building the nascent metaverse.\n\"We want to put up quality art, with a quality community of people that get together and thrive off each other, and support each other,\" Aversano said.\n\"I think that's why IRL spaces are important. Especially after a pandemic, we want it even more,\" he added. \"Quantum is in the perfect position to build these community hubs around the world.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102124/justin-aversanos-quantum-opens-physical-nft-gallery-in-la-to-uplift-other-artists",
            "id": "ba8696638c17e57b00472c2982606cc1",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 7, 2022Jun 7, 2022",
            "title": "Justin Aversano’s Quantum Opens Physical NFT Gallery in LA to ‘Uplift Other Artists’"
        },
        {
            "author": [
                "4 min read",
                "Stacy Elliott"
            ],
            "content": "At Least $2.4B in Crypto Has Been Laundered Through Binance: Report - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessAt Least $2.4B in Crypto Has Been Laundered Through Binance: ReportA Reuters report says $2.4B in stolen funds have been laundered through Binance. The exchange calls it a \"woefully misinformed op-ed.\"\nBy Stacy ElliottJun 6, 2022Jun 6, 20224 min readBinance is one of the world's biggest crypto exchanges. Image: ShutterstockCreate an account to save your articles.A new report from Reuters estimates that at least $2.35 billion in illicit funds have been laundered through Binance between 2017 and 2021. \nThe news agency analyzed court records, spoke with law enforcement, and worked with blockchain analysis firms Chainalysis and Crystal Blockchain to track illicit funds on the exchange.\nAs of Monday morning, Binance was the largest crypto exchange, accounting for $10.5 billion in spot and $41.4 billion in derivatives volume over the last day, according to CoinMarketCap. \nThe report quotes Binance Chief Communications Officer Patrick Hillman, who told Reuters that he did not believe its analysis was accurate. \nHe did tell the news agency that the company was in the process of assembling \"the most sophisticated cyber forensics team on the planet\" that would \"further improve our ability to detect illegal crypto activity on our platform.\"\nA Binance spokesperson shared a response to the article with Decrypt, saying that the company has received \"an outpouring of support from partners in law enforcement across the globe\" since the article was published on Monday morning.\n\"We're aware of Angus Berwick's latest woefully misinformed op-ed,\" the spokesperson said in an email. \"It should be noted that the article uses outdated information from 2019 and unverified personal attestations as a crutch to establish a false narrative.\"\nThe report connects several notable events and platforms, including the hack of a Slovakian crypto exchange Eterbase, darknet marketplace Hydra, and the North Korean hacking group Lazarus, each of which involved Binance to facilitate various crypto transactions.\nEterbase\nIn September 2020, attackers from the Lazarus group created anonymous Binance accounts and used them to launder a portion of $5.4 million stolen from Slovakian cryptocurrency exchange Eterbase, according to the Reuters analysis.\n\"Binance had no idea who was moving money through their exchange,\" said Eterbase co-founder Robert Auxt. \nAfter the hack, Eterbase sought to work with Binance to recover the stolen funds. On September 9, 2020, Reuters reported that Binance CEO Changpeng Zhao tweeted that the exchange would \"do what we can to assist\" Eterbase.\n\nEmails shared with Reuters reportedly show that Binance declined to share information or account data without a request from law enforcement. \nEterbase eventually shut down its exchange and eventually filed for bankruptcy.\nThe company filed a criminal complaint with Slovakia's National Crime Agency (NCA) in June 2021. After the NCA sent two requests to Binance, according to the report, the exchange sent records for 24 accounts that were linked to usernames like \"benjaminfranklin\" and \"garathbale.\"  \nHydra\nThe Reuters report also estimates that Russian-language darknet site Hydra used Binance to process payments for drugs totaling $780 million.  \nHillman told Reuters that the total was \"inaccurate and overblown.\"\nEarlier this year, the U.S. Justice Department announced that it had cooperated with German law enforcement to seize Hydra's servers. At the time, the DOJ estimated that Hydra was responsible for 80% of all darknet crypto transactions and that it had received $5.2 billion since 2015.\n\nPosts reviewed by Reuters from Hydra show that in March 2018, Binance was the preferred way to process payments because of the minimal identifying information required to create an account.\n\"This is the fastest and cheapest way I've tried,\" one user wrote, according to Reuters.\n\nLazarus Attacks\nThe report frequently mentions Lazarus, a group of hackers that U.S. law enforcement has said uses its ill-gotten gains to fund North Korea's nuclear weapons program. As a result, the U.S. sanctioned Lazarus in 2019. \nChainalysis, which worked with Reuters on the report, estimates that the group had stolen crypto worth $1.75 billion by 2020.\n\nAccording to Reuters, Lazarus used Binance to launder money from the $5.4 million Eterbase attack in 2020 too, and the $622 million attack on the Ronin sidechain that connects Axie Infinity to the Ethereum network.\nHilman told Reuters that Binance has identified and frozen more than $5 million connected to the Ronin sidechain hack. He also said that the exchange continues to work with law enforcement agencies in the investigation.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102128/2-4b-crypto-has-been-laundered-through-binance-report",
            "id": "d64248eacc2e46756dbbf1392dc0eb16",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "At Least $2.4B in Crypto Has Been Laundered Through Binance: Report"
        },
        {
            "author": [
                "3 min read",
                "Liam J. Kelly"
            ],
            "content": "Twitter May Not Get Its Crypto-Friendly Owner: Elon Musk Seeks Exit From Deal - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessTwitter May Not Get Its Crypto-Friendly Owner: Elon Musk Seeks Exit From DealA letter contends that Musk is within his right “to terminate the merger agreement” should Twitter withhold information about bot activity.\nBy Liam J. KellyJun 6, 2022Jun 6, 20223 min readTesla CEO Elon Musk. Image: ShutterstockCreate an account to save your articles.The latest chapter of Elon Musk's Twitter acquisition may be the saga's last: A new letter to Twitter's general counsel alleges that the company hasn't met its obligations in closing the deal.\nThe Tesla and SpaceX CEO said he's been eager to gather precise data on spam and bot activity on the platform. In May, Musk said that the $44 billion acquisition was \"temporarily on hold\" until he could verify that fewer than 5% of Twitter users were fake. \nBut, according to Musk's counsel, Twitter has only ever provided details about its methodology for measuring such activity, not exactly how much of it occurs.\n\"Twitter's latest offer to simply provide additional details regarding the company's own testing methodologies, whether through written materials or verbal explanations, is tantamount to refusing Mr. Musk's data requests,\" reads the letter prepared by Musk's attorneys. \nIt continues by stating that Musk doesn't find these methodologies \"adequate\" and that he \"must conduct his own analysis.\"\nPerhaps most important, however, this tussle has been deemed a \"clear material breach\" of the two parties' merger agreement and gives Musk the right \"to terminate the merger agreement\" altogether. \n\n\"Breach of agreement\"\nRead: I made a stupid deal, but rules/laws don't apply to me.\n— Scott Galloway (@profgalloway) June 6, 2022\n\nTwitter shares are down about 3.4% to $38.81 as of this writing.\nIf the deal falls through, the social media platform may never see a host of crypto-infused upgrades Musk has hinted at since the deal began gaining traction.\n\nCrypto integration\nBesides becoming crypto Twitterati's poster boy, Musk does actually have a few ideas about how to integrate Web3 technology into the platform.\n\nFor starters, he'd look to tackle scams. \"If I had a Dogecoin for every crypto scam I see, I'd have 100 billion Dogecoins,\" he said in a recent interview. \nHe's also suggested using Dogecoin (or potentially another cryptocurrency) as a payment option for Twitter's premium Blue membership. \n\nTurning to crypto for payments has been a common thread running through Musk's plans. When discussing the potential of turning Twitter into a WeChat-esque \"super app,\" he noted that crypto payments could be one such feature.\nTwitter has yet to comment publicly, but already several business and media experts have weighed in.\nStephanie Ruhle of MSNBC reminded Twitter followers that Musk \"waived the right to due diligence in the merger agreement,\" meaning that it should be much harder for him to exit the deal.\nMeanwhile, Brian Quinn, a Boston College law professor, indicated that today's news shows that Musk wants out \"or something that will get leverage for a renegotiation of the price.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102125/twitter-may-not-get-crypto-friendly-owner-musk-seeking-exit-deal",
            "id": "1e0fa1894edc8c84b9b528918ca6db91",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Twitter May Not Get Its Crypto-Friendly Owner: Elon Musk Seeks Exit From Deal"
        },
        {
            "author": [
                "3 min read",
                "Andrew Asmakov"
            ],
            "content": "Binance Labs Makes Undisclosed ‘Strategic Investment’ in PancakeSwap - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessBinance Labs Makes Undisclosed ‘Strategic Investment’ in PancakeSwapBinace Labs has announced a strategic investment in PancakeSwap’s governance and utility token CAKE.\nBy Andrew AsmakovJun 6, 2022Jun 6, 20223 min readA stack of pancakes. Image: UnsplashCreate an account to save your articles.Binance's venture capital and incubation arm announced it invested in CAKE, the utility and governance token of decentralized exchange (DEX) PancakeSwap.\nThe undisclosed investment is part of the entity's \"mission to facilitate the next wave of global blockchain adoption by providing technology development, marketing and community support, and enterprise solutions for Web3 transformation,\" said Binance Labs.\n\nBinance Labs Makes Strategic Investment in PancakeSwap | Binance Blog https://t.co/GoGE1F5vVX\n— Binance Labs Fund (@BinanceLabs) June 6, 2022\n\nLaunched in September 2020, PancakeSwap is an automated market maker (AMM), allowing users to trade, swap, and stake BEP-20 tokens issued on Binance's BNB Chain.\nAccording to Binance Labs, PancakeSwap is currently the network's biggest decentralized app (dApp), with over 400,000 daily active users. In terms of total value locked (TVL) on the platform, DeFi Llama reports that the platform currently boasts $4.82 billion, making it BNB Chain's most valuable application too.\nBoasting $387 million in trading volume over the past 24 hours, PancakeSwap (v2)—the latest iteration of the protocol—is now the third-largest DEX behind Uniswap (v3) and dYdX only, per CoinMarketCap.\n\"PancakeSwap has been leading the development and mass adoption of BNB Chain. Given that PancakeSwap is the most widely used dApp and the DeFi project with the highest TVL on BNB Chain, we have and will continue to provide strong support for the project,\" Bill Qian, head of Binance Labs, said in a statement.\n\nBinance, which operates its own DEX, doesn't control or operate PancakeSwap, which was built by anonymous developers. It is not immediately clear whether this will change following today's announcement.\nDecrypt reached out to Binance Labs and will update the story accordingly, should we hear back.\nBinance, Cake, and PancakeSwap\nThe price of CAKE rallied to a weekly-high of $4.84 following the announcement, before correcting to $4.66 by press time, which is still up 7.14% over the last day.\nWith a market capitalization close to $761 million, CAKE is currently the industry's 66th-largest crypto asset.\n\nSince its launch in 2018, Binance Labs—marketed as \"a social impact fund and an initiative to incubate, invest, and empower blockchain and cryptocurrency entrepreneurs, projects, and communities\"— has invested in over 100 projects.\nIts portfolio includes such major projects as Audius, Axie Infinity, Dune Analytics, Elrond, Polygon, Optimism, The Sandbox, and 1inch, among others.\nLast week, Binance Labs announced a new $500 million investment fund dedicated to discovering and supporting \"projects and founders with the potential to build and to lead Web3 across DeFi, NFTs, gaming, Metaverse, social, and more.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102117/binance-labs-makes-undisclosed-strategic-investment-pancakeswap",
            "id": "710f60bb7100a1398e156416f341e26c",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Binance Labs Makes Undisclosed ‘Strategic Investment’ in PancakeSwap"
        },
        {
            "author": [
                "2 min read",
                "Sujith Somraaj"
            ],
            "content": "Justin Sun’s Terra-like Stablecoin Now Boasts Backing in Bitcoin, Tether, Tron - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsDeFiJustin Sun’s Terra-like Stablecoin Now Boasts Backing in Bitcoin, Tether, TronLaunched first as an algorithmic stablecoin, Tron's USDD has changed its operating model to avoid possible collapse like Terra’s UST.\nBy Sujith SomraajJun 6, 2022Jun 6, 20222 min readStablecoins (Image: Shutterstock)Create an account to save your articles.Created as an algorithmic stablecoin, Justin Sun’s Terra-like stablecoin USDD is now shifting gears towards a hybrid model with improved transparency. \nUSDD is now reportedly over-collateralized with a collateral ratio of 226.1%, according to data from Tron DAO, the organization responsible for maintaining the collateral of USDD. \nThe team behind USDD also promised a minimum collateral ratio of 130%, a ratio that it said was higher than the 120% collateral ratio maintained by MakerDAO’s DAI stablecoin. \nThis collateral ratio can also be much higher on MakerDAO depending on the asset one uses to mint more of the stablecoin. The range for borrowing DAI using Ethereum is between 130% and 170%. \nThe collateral backing USDD includes 14,040.6 Bitcoin, 240 million USDT, and approximately 1.9 billion Tron (TRX), the native token of the Tron ecosystem. \nThe backing can be verified using signatures on block explorers. \nCollateral backing USDD. Source: Tron DAO.\n“Congratulations to USDD on becoming the first over-collateralized decentralized stablecoin!” tweeted Justin Sun, the creator of USDD. \"A total of $1.37 billion of assets are backing the 667 million USDD in circulation.”\nTron (TRX), the native token of the Tron ecosystem, is up 5.21% over the past 24 hours and is changing hands at $0.084 apiece according to data from CoinMarketCap.\n\nWhat is USDD?\nLaunched on May 5, USDD is extremely similar to Terra’s stablecoin UST, an algorithmic stablecoin governed by smart contracts without any collateral backing. \nLast month UST crashed wiping out approximately $60 billion in investor wealth in a week’s time. Since then, algorithmic stablecoins have been heavily criticized, including USDD.\n\nUSDD’s dollar peg is governed by smart contract-based arbitrage algorithms between USDD and Tron.\nInvestors can always swap 1 USDD for $1 worth of TRX if the price of USDD trades above the dollar peg. By selling the newly-minted TRX, users can pocket arbitrage profits for keeping the coin at its dollar-peg, and vice-versa.\nThis same algorithm proved inefficient with UST, however. \nIt’s also the key reason that the Tron DAO has opted to change how its stablecoin operates.\n“This has been in the plan, but Terra/Luna definitely accelerated and prioritized this for our team” tweeted Justin Sun, the creator of USDD. “We want to have USDD to be overcollateralized.”\nNow, USDD has combined bits of collateralized stablecoins as well as algorithms to maintain its dollar peg.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102114/justin-sun-terra-stablecoin-boasts-backing-bitcoin-tether-tron",
            "id": "cbcdb4a9c0b5e6a6c4a924ed40d9c037",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Justin Sun’s Terra-like Stablecoin Now Boasts Backing in Bitcoin, Tether, Tron"
        },
        {
            "author": [
                "3 min read",
                "Andrew Hayward"
            ],
            "content": "Epic Games Store’s First NFT Game Is Gala’s Wild West Shooter GRIT - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsNFTsEpic Games Store’s First NFT Game Is Gala’s Wild West Shooter GRITGala Games plants a Web3 flag in the popular PC marketplace Epic Games Store with plans to roll out its battle royale game this year.\nBy Andrew HaywardJun 6, 2022Jun 6, 20223 min readGRIT is an NFT-powered battle royale shooter from Gala Games. Image: Gala GamesCreate an account to save your articles.In brief\nGala Games’ GRIT, a Wild West-themed battle royale game, will be the first Web3 game on the Epic Games Store.\nGRIT will feature user-owned NFT items. Rival marketplace Steam has banned NFT games.\nWhen leading PC gaming marketplace Steam decided to ban Web3 games with NFT or crypto hooks last October, rising rival Epic Games Store claimed that it would remain open to such games. \nAnd now we know which game will be the first Web3 title to appear on Epic's platform.\nToday, Gala Games announced that its Wild West-themed battle royale shooter GRIT would be the first NFT-powered game to launch via the Epic Games Store. GRIT will be a free-to-play online multiplayer game for Windows PC players, and it will feature user-owned NFT assets that can be purchased, resold, and utilized within the game.\nAn NFT is a blockchain token that proves ownership of various items and is often used for digital goods such as artwork, collectibles, and in-game assets for video games. Gaming examples include avatars, vehicles, weapons, apparel, and virtual land plots.\nA screenshot from the game GRIT. Image: Gala Games.\nGala will release 10,000 player avatars for GRIT, offering a unique look and customization elements to owners. The firm will offer the avatars via a \"Gunslinger's Box\" sale, which begins this week at the publisher's Galaverse event in Malta.\nGRIT looks to be a Fortnite-like experience with a large number of players dropped into a free-for-all battle to the death, albeit with a distinctive Western aesthetic. It's due out later in 2022 and runs on Epic Games' own Unreal Engine. \nGala Games' press release suggests that GRIT won't be the company's only game to launch on the Epic Games Store.\n\n\"Epic is a pioneer and visionary in the video game industry. Gala Games' titles being available on the Epic Game Store brings legitimacy to this new genre of gaming,\" said John Osvald, Gala's president of games, in a release. \"Easy access to Web3 games is a turning point for those players who have not yet seen how digital ownership can enrich the gaming experience.\"\nGala Games has quickly become a prominent player in the blockchain gaming space, enlisting veteran game developers like Will Wright (The Sims) and Peter Molyneux (Fable) to create NFT-enhanced games while also signing NFT-savvy celebs like Snoop Dogg and Steve Aoki. \nThe GALA token, currently priced below $0.08, has a total market cap of $555 million, according to CoinMarketCap.\n\nCrypto finds home with Epic Games\nEpic Games is not only the company behind the Epic Games Store and Unreal Engine but is also the developer of the leading battle royale shooter, Fortnite. The Epic Games Store had 194 million total users as of the end of 2021, making it a sizable launchpad for Gala and GRIT.\nValve's Steam marketplace is currently the leading PC gaming platform, and it took a hard stance against games with NFTs or crypto tokens last October when it barred such games from launching on the platform. \nIn response, Epic Games co-founder and CEO Tim Sweeney tweeted a welcome message to creators of such games.\n\"Epic Games Store will welcome games that make use of blockchain tech provided they follow the relevant laws, disclose their terms, and are age-rated by an appropriate group,\" he wrote. \"Though Epic's not using crypto in our games, we welcome innovation in the areas of technology and finance.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102099/epic-games-stores-first-nft-game-is-galas-wild-west-shooter-grit",
            "id": "f3a4bef73dae2533b7138ae6ae65d1ea",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Epic Games Store’s First NFT Game Is Gala’s Wild West Shooter GRIT"
        },
        {
            "author": [
                "3 min read",
                "Andrew Asmakov"
            ],
            "content": "Aussie Investors Have Already Lost Over $80M to Crypto Scams This Year - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsBusinessAussie Investors Have Already Lost Over $80M to Crypto Scams This YearTotal cryptocurrency scam losses by Australians in the first four months of this year alone amounted to $81.5 million, according to the country’s consumer watchdog.\nBy Andrew AsmakovJun 6, 2022Jun 6, 20223 min readCrypto scams. Image: ShutterstockCreate an account to save your articles.Crypto scams in the land down under are on the rise as investors lost $AUD 113 million ($81.5 million) between January 1 and May 1 this year, the Australian Competition and Consumer Commission (ACCC) announced on Monday.\nAccording to Scamwatch, an ACCC-run website helping consumers and small businesses recognize, avoid and report scams, Australians lost a total of more than $AUD205 million ($148 million) to various scams (including crypto) in the first four months of this year.\nThe majority of the reported losses over this span related to investment scams with $AUD158 million ($114 million) lost—an increase of 314% compared to the same period last year.\n\n“Australians should be very wary of anyone asking them to invest in or transfer money using cryptocurrency, especially if it’s someone you have only met online,” Delia Rickard, ACCC Deputy Chair, said in a statement.\nRickard added that since many consumers are unfamiliar with the complexities of cryptocurrencies, “this can make them more vulnerable to scams.”\nThe true scale of losses to scams, however, is likely to be much higher as only around 13% of people report their losses, according to the ACCC. The Commission stressed that while the number of reports has slightly reduced, the reported amount of losses—on the contrary—has increased, indicating that on average people reported higher individual losses.\n“We are seeing more money lost to investment scams and so are urging all Australians not to trust investment opportunities that seem too good to be true,” said Rickard.\n\nScammers turn to crypto\nEarlier this year, the ACCC already pointed to a significant uptick in investment scams, also noting that cryptocurrencies have overtaken traditional bank payments in frequency.\n“We see a number of scams relating to investment schemes, and we are now seeing that the payments in relation to those are now more often by way of cryptocurrency than by way of bank transfer,” ACCC chair Gina Cass-Gottlieb said at the time.\n\nThe ACCC’s latest warning comes hot on the heels of the U.S. Federal Trade Commission’s latest report saying that more than 46,000 Americans have also lost over a combined $1 billion in crypto-related scams since the beginning of last year.\nWhile approximately $680 million in losses were reported in 2021, as much as $329 million was reported in the first quarter of 2022 alone, meaning that this year’s figures are likely to be much higher.\nBitcoin (70%), Tether (10%), and Ethereum (9%) were reportedly the most frequently stolen cryptocurrencies, according to the report.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102108/aussie-investors-have-already-lost-80m-crypto-scams-year",
            "id": "bb103d72023c5f773a339abec4a41746",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Aussie Investors Have Already Lost Over $80M to Crypto Scams This Year"
        },
        {
            "author": [
                "2 min read",
                "Andrew Asmakov"
            ],
            "content": "Bitcoin, Ethereum Jump 5% as Crypto Market Rebounds - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsMarketsBitcoin, Ethereum Jump 5% as Crypto Market ReboundsBitcoin and Ethereum, the top two cryptocurrencies by market capitalization, saw a 5% spike in price in the last 24 hours.\nBy Andrew AsmakovJun 6, 2022Jun 6, 20222 min readBitcoin and Ethereum are the top two cryptocurrencies. Image: Shutterstock.Create an account to save your articles.The prices of Bitcoin (BTC) and Ethereum (ETH) saw a 5% jump over the last day, giving investors renewed hopes for a much-anticipated market recovery after a brutal sell-off in May.\nCurrently, Bitcoin is changing hands at $31,289, up 5.2% over the day, according to data provided by CoinMarketCap.\nThe leading cryptocurrency last traded at these levels on June 1, when it entered a downward correction that dragged the price of BTC from above $32,000 below $30,000 for the most part of the weekend.\n\nDespite the latest spike, Bitcoin is still down more than 34% since the start of the year, with the Fear & Greed Index—a combination of variables measuring market sentiment—currently standing at 13, which corresponds to “extreme fear.”\nEthereum follows the pattern\nThe price of Ethereum has meanwhile just hit an intraday high of $1,889, as it went up almost 6%, per CoinMarketCap.\nThe second-largest cryptocurrency still faces a massive uphill battle to recover from the losses since the start of the year when it traded above $3,800.\n\nEthereum's lackluster price action is compounded by a massive sell-off in the DeFi space. Over the last month, investors withdrew more than $40 billion from ETH-based apps, shrinking the total value locked (TVL) from over $113 billion on May 5 to $71.04 billion as of today, according to data from DeFi Llama.\nElsewhere, major layer 1-networks Cardano (ADA) and Solana (SOL) both posted double-digit gains over the past 24 hours as their tokens rallied 13% and 11.4%, respectively.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102104/bitcoin-ethereum-jump-crypto-market-rebounds",
            "id": "af96e9ea4b5caa50a8f8ac18e2ddbad6",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Bitcoin, Ethereum Jump 5% as Crypto Market Rebounds"
        },
        {
            "author": [
                "2 min read",
                "Mat Di Salvo"
            ],
            "content": "'Move-to-Earn' Game Stepn Hit With DDOS Attacks—Again - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsGaming'Move-to-Earn' Game Stepn Hit With DDOS Attacks—AgainThe popular Web3 app suggested its users \"take some rest\" while engineers worked on the issue.\nBy Mat Di SalvoJun 5, 2022Jun 5, 20222 min readStepn logo. Image: ShutterstockCreate an account to save your articles.The popular crypto game Stepn, which uses Solana NFTs, was hit with a number of distributed denial-of-service (DDoS) attacks this weekend, the third such occurrence in as many months.\nAccording to the app’s Twitter page, Stepn's devs were still working to fix the issue at the time of this writing.\n“We have been under multiple DDOS attacks in the past hours,” those behind the game said in a tweet on Sunday. “Securing the servers and recovery may take anywhere from 1 to 12 hours.”\n\n1/2We have been under multiple DDOS attacks in the past hours. Securing the servers and recovery may take anywhere from 1 to 12 hours. We recommend you take some rest during the maintenance or otherwise the work-outs may not be recorded properly.\n— STEPN | Public Beta Phase IV (@Stepnofficial) June 5, 2022\n\nAnother tweet read: “We recommend you take some rest during the maintenance or otherwise the work-outs may not be recorded properly. Our engineers are working hard to fix the problems.”\nAnd yesterday, users also were notified that the game was experiencing “network congestion” after it was hit with 25 million DDoS attacks in a short period.\n\nA DDoS attack is when malicious actors try to bring down a website by overloading it with useless traffic. Such attacks are very common—particularly in the crypto world. \nStepn is a “move-to-earn” app where users are rewarded for moving outdoors. Players have to buy Solana-based NFT (non-fungible token) sneakers to play the game, and earn tokens when they run or walk. \n\nThe game, which calls itself a “Web3 lifestyle app,” has two tokens—one for utility (GST) and another for governance (GMT). \n\n2/5. We were experiencing network issues due to a 25 million DDOS attack sent to the server within a short period of time. Due to network congestion, AI cannot receive user information and identify them as bots.\n— STEPN | Public Beta Phase IV (@Stepnofficial) June 4, 2022\n\nHackers seem hellbent on bringing down the popular app: In April and again in May, the game announced people were trying to cripple it by sending millions of DDoS attacks.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102091/move-to-earn-game-stepn-hit-with-ddos-attacks-again",
            "id": "7916cdc505669a5dab26884e71dd3ed7",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "'Move-to-Earn' Game Stepn Hit With DDOS Attacks—Again"
        },
        {
            "author": [
                "2 min read",
                "Mat Di Salvo"
            ],
            "content": "Bored Apes Co-Founder Criticizes Discord After NFTs Worth 200 Ethereum Snatched in Exploit - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsNFTsBored Apes Co-Founder Criticizes Discord After NFTs Worth 200 Ethereum Snatched in ExploitOthers have criticized criticism of the platform, saying it shouldn’t be blamed if not used correctly.\nBy Mat Di SalvoJun 5, 2022Jun 5, 20222 min readBored Ape NFTs are some of the most popular Ethereum collectibles on the market. Image: ShutterstockCreate an account to save your articles.A co-founder of the popular Bored Ape Yacht Club NFT collection yesterday lashed out at Discord after its server was exploited and NFTs worth 200 Ethereum ($358,962) were stolen from users. \nGordon Goner on Saturday wrote on Twitter that Discord, a chat app popular with the crypto community, “isn’t working for Web3 communities.”\n\nDiscord isn’t working for web3 communities. We need a better platform that puts security first.\n— GordonGoner.eth (@GordonGoner) June 4, 2022\n\n“We need a better platform that puts security first,” he added.\nBAYC acknowledged the exploit on Twitter, adding, “The team caught and addressed it quickly.”\n\nOur Discord servers were briefly exploited today. The team caught and addressed it quickly. About 200 ETH worth of NFTs appear to have been impacted. We are still investigating, but if you were impacted, email us at discord@yugalabs.io.\n— Bored Ape Yacht Club (@BoredApeYC) June 4, 2022\n\nYuga Labs, the team behind the NFT collection, said it was investigating the incident. But others in the crypto community said the hack was the fault of BAYC Discord users. \n“Don’t blame Discord for users getting socially engineered, having DMs open and clicking phishing links,” wrote analyst OKHotshot. “Use the tool correctly first before blaming it.”\nWhile developer Cory.eth, who founded NFT collection OpenAvatar, added that users “just need to use the technology better.”\n\n.@GordonGoner you just need to use the technology better. Hit me up if you want an audit or implementation.https://t.co/zybdI0eICl\n— cory.eth (@cory_eth) June 4, 2022\n\nBAYC is a very sought-after collection of quirky ape profile pictures minted as NFTs on the Ethereum blockchain. Rich and famous people like Eminem, Madonna, and billionaire businessman Mark Cuban have all snapped them up.\nNFTs (non-fungible tokens) are deeds of ownership for digital items, and they're being used by some to help revolutionize the art and music worlds.\n\nOwners of Bored Apes have access to an exclusive Discord channel where they can discuss the NFTs.\nBut Saturday’s exploit wasn’t the first time attackers leveraged BAYC’s social media channels. Just last month, BAYC’s official Instagram account was hacked, and thieves stole a total of $2.8 million by sharing a link to a scam website that pinched NFTs from users’ wallets.\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102076/bored-apes-co-founder-blames-discord-after-200-ethereum-snatched-in-exploit",
            "id": "1a7b2000939acfa1eca47d518d986ff2",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 6, 2022Jun 6, 2022",
            "title": "Bored Apes Co-Founder Criticizes Discord After NFTs Worth 200 Ethereum Snatched in Exploit"
        },
        {
            "author": [
                "2 min read",
                "Sujith Somraaj"
            ],
            "content": "Roughly 70% of $1 Billion Lost to Crypto Scammers Since 2021 Was Bitcoin: FTC - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsCoinsRoughly 70% of $1 Billion Lost to Crypto Scammers Since 2021 Was Bitcoin: FTCThe median individual loss reported was about $2,600, but that figure for victims in their 70s was nearly $12,000.\nBy Sujith SomraajJun 5, 2022Jun 5, 20222 min readFTC headquarters in Washington. Image: ShutterstockCreate an account to save your articles.More than 46,000 individuals have lost over a combined $1 billion in crypto-related scams since the beginning of last year, according to the Federal Trade Commission.\nApproximately $680 million in fraud was reported in 2021, and some $329 million was reported just in the first quarter of 2022, according to a report released Friday.\nSocial media usage while holding crypto creates \"a combustible combination for fraud,\" the FTC wrote. \"Nearly half the people who reported losing crypto to a scam since 2021 said it started with an ad, post, or message on a social media platform.\"\n\"And most people are still unfamiliar with how crypto works,\" the report continued. \"These considerations are not unique to crypto transactions, but they all play into the hands of scammers.\"\n\nBitcoin (70%), Tether (10%), and Ether (9%) were the most frequently stolen cryptocurrencies, according to the report.\nNearly four out of every 10 dollars reported lost to scams that originated on social media since 2021 were linked to crypto, with Facebook (32%), Instagram (26%), and Whatsapp (9%) the most frequently cited platforms.\n\nIndividuals age 20 to 49 were three times as likely to have reported being scammed compared with older age groups, but older individuals reported losing greater sums—the median amount for victims in their 70s was nearly $12,000.\n\"The stories people share about these scams describe a perfect storm: false promises of easy money paired with people's limited crypto understanding and experience,\" the FTC wrote. \"Investment scammers claim they can quickly and easily get huge returns for investors. But those crypto 'investments' go straight to a scammer's wallet.\"\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102080/roughly-70-of-1-billion-lost-to-crypto-scammers-since-2021-was-bitcoin-ftc",
            "id": "a9c1dad165dd0dc64b6adf3001afd8db",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 5, 2022Jun 5, 2022",
            "title": "Roughly 70% of $1 Billion Lost to Crypto Scammers Since 2021 Was Bitcoin: FTC"
        },
        {
            "author": [
                "4 min read",
                "Tim Hakki"
            ],
            "content": "This Week on Crypto Twitter: Elon Musk and Dogecoin Co-Creator Jackson Palmer Exchange Words - DecryptMenuSearchAbout App Email Discuss PodcastPrice data byNewsCoinsThis Week on Crypto Twitter: Elon Musk and Dogecoin Co-Creator Jackson Palmer Exchange WordsElsewhere, Vitalik Buterin ponders an anti-crypto letter sent to U.S. lawmakers, and New York's governor considers a two-year mining ban.\nBy Tim HakkiJun 5, 2022Jun 5, 20224 min readDogecoin. Image: Shutterstock. Create an account to save your articles.Illustration by Mitchell Preffer for Decrypt\nThe two most striking conversations this week on the world's largest microblogging platform were Elon Musk's beef with Dogecoin co-creator Jackson Palmer, and Ethereum creator Vitalik Buterin's musings on a letter sent to Washington by crypto skeptics.\nOn Monday, Australian news outlet Crikey published an interview with Palmer, who was promoting his new podcast, Griftonomics, when he laid into the crypto industry.\n\"I wish it was the end of crypto, but it's not,\" Palmer said, before turning his thoughts to Musk: \"He's a grifter. He sells a vision in hopes that he can one day deliver what he's promising, but he doesn't know that. He's just really good at pretending he knows.\"\nPalmer also said that he wrote a Python script that would automatically detect and report spam bots in a Twitter user's mentions. The Dogecoin-loving Musk allegedly reached out to Palmer and asked for the script, but, according to Palmer: \"It became apparent very quickly that he didn't understand coding as well as he made out. He asked, 'How do I run this Python script?'\"\n\nYou falsely claimed ur lame snippet of Python gets rid of bots. Ok buddy, then share it with the world …\n— Elon Musk (@elonmusk) May 31, 2022\n\nThe Tesla CEO responded by saying his children wrote better code than Palmer. Musk also called Palmer \"a tool.\"\n\nMy kids wrote better code when they were 12 than the nonsense script Jackson sent me. \nLike I said, if it’s so great, he should share it with the world and make everyone’s experience with Twitter better. If he does, you will see what I mean.\nJackson Palmer is a tool.\n— Elon Musk (@elonmusk) May 31, 2022\n\nPalmer didn't reply directly to Musk's provocations, but he defended his spambot catcher in a subsequent mini-thread.\n\nI never said it was super complex, but this simple script definitely worked in catching and reporting the less sophisticated phishing accounts circa 2018... They've since evolved their tactics.\nI shared it with a lot of people, and it worked for them. https://t.co/iKPFsYHXEG\n— Jackson Palmer (@ummjackson) May 31, 2022\n\nOn Wednesday, the Financial Times reported that a letter signed by 26 anti-crypto computer scientists, tech bloggers, and academics, including many former FAANG employees, had been presented to U.S. lawmakers.\nThe letter urges regulators to \"take a critical, skeptical approach toward industry claims that crypto-assets are an innovative technology that is unreservedly good,\" and it asked them to \"resist pressure from digital asset industry financiers, lobbyists, and boosters.\"\nEthereum creator Vitalik Buterin appeared to respond to the letter in a tweet thread on Friday.\n\nA big difference between the \"new idealistic movement\" scene 10-15 years ago vs today is that back then it felt possible to be on all the good-guy teams at the same time. Today, much more adversarial thinking and conflict.\nI've been trying to understand.. where to from here?\n— vitalik.eth (@VitalikButerin) June 2, 2022\n\nButerin also stated that crypto fans were upset and confused that British-Canadian tech blogger Cory Doctorow was a signatory to the letter, because they’d considered him an ally. In 2018, Doctorow delivered a keynote speech called “Decentralize, Democratize, or Die” at DevCon, the annual Ethereum developer conference.\n\nAs Cory mentioned, crypto was at first just decentralization enthusiasts, but now there's also various types of \"money people\".\nThis is an inevitable part of becoming bigger. In non-financial movements too, various classes of normies and often soon grifters move in over time.\n— vitalik.eth (@VitalikButerin) June 2, 2022\n\nButerin also mentioned that he's unhappy with the amount of infighting in the crypto community. He suggested it was a byproduct of success, because as businesses scale up they find themselves in more direct competition with each other.\n\nOne important factor is that all of those movements *got much bigger* in the last decade. When something is small, even if you don't like it, it's not a threat, so it's easy to live-and-let-live. When everything is big, more competition, so more incentive to point out problems.\n— vitalik.eth (@VitalikButerin) June 2, 2022\n\n\nI guess the conclusion is, peacekeeping and cooperation-seeking needs to be an explicit effort rather than peace being an assumed default.\n— vitalik.eth (@VitalikButerin) June 2, 2022\n\nElsewhere\nLachlan Markay of Axios provided a pithy account of how Rep. Madison Cawthorn (R-SC), who's being investigated by the House Committee on Ethics for an alleged pump-and-dump scheme involving the \"Let's Go Brandon\" coin, spent the last 10 days of 2021.\n\nWild chain of events:Dec 21: Madison Cawthorn buys up to $250k in Let's Go Brandon CoinDec 29: His IG post predicts LGB is going \"to the moon\"Dec 30: Previously undisclosed endorsement deal sends LGB skyrocketingDec 31: Cawthorn sells off LGB holdingshttps://t.co/yioN3uPJly\n— Lachlan Markay (@lachlan) June 1, 2022\n\nOn Thursday, branded NFT creator Nifty’s announced a major partnership with Warner Bros.\n\nTweety’s coming to Nifty’s! And that's not all folks. 😉\nWe're partnering with @WarnerBros to bring you Looney Tunes: What's Up Block?, a story-driven @LooneyTunesNFT program for the ultimate fan. There will be 10,000 Tweety Avatars at $80 each and more characters coming soon! pic.twitter.com/a7pqsXf0NM\n— Nifty's (@Niftys) June 2, 2022\n\nAlso that day, blockchain sleuth ZachXBT wrote a lengthy thread about Animoon, an NFT scam that couldn’t be more blatant to anyone even dimly aware of recent pop culture.\n\n1/ Let’s breakdown the $6.3m NFT rug Animoon, a project that has constantly screwed over its holders since day 1. pic.twitter.com/pEPhQ2bfeQ\n— ZachXBT (@zachxbt) June 2, 2022\n\nBarry Silbert, founder of the Digital Currency Group (which includes crypto asset management giant Grayscale), took issue with a proposal by the New York State Senate to impose a two-year moratorium on all fossil fuel-powered proof-of-work crypto mining, calling it a \"job killer.\"\n\n.@SenKennedy -- we're one of the biggest employers in western NY with 150 employees in Rochester and we're building a second massive office in Buffalo. This moratorium bill is a job killer and sends a terrible message to crypto entrepreneurs. Please support innovation and vote no https://t.co/ON90oeYRbc\n— Barry Silbert (@BarrySilbert) June 3, 2022\n\nBut State Senate Bill S6486D passed 36-27 on Friday morning. It's now headed to the desk of Gov. Kathy Hochul, who gets 10 days to sign it into law or veto it.\nCoinbase, in the wake of a Q1 loss of $430 million, announced on Thursday it would not only be freezing hiring, it also would be rescinding offers recently accepted by candidates. Recruitment company Blind tweeted a job offer letter, which promised recipients the company wouldn't be rescinding offers, alongside an email doing exactly the opposite.\n\nCoinbase sent a welcome email to new hires 2 weeks ago promising that they won't rescind offers (1st image).\nYesterday, they sent the rescind emails (2nd image) leaving candidates in frustration.\nWe have a referral thread going on to help those who were impacted 👇 pic.twitter.com/lIQe0ph4rk\n— Blind (@TeamBlind) June 3, 2022\n\nAnd finally, Kanye West has decided that it is indeed time to ask him about NFTs.\n\nKanye West believes in NFTs 🔥 pic.twitter.com/phzFpVQSRn\n— Blockworks (@Blockworks_) June 3, 2022\n\nCopy article linkWant to be a crypto expert? Get the best of Decrypt straight to your inbox.Get the biggest crypto news stories + weekly roundups and more!Get it! NewsLearnFeaturesCoinsVideos",
            "href": "https://decrypt.co/102060/this-week-on-crypto-twitter-elon-musk-and-dogecoin-co-creator-jackson-palmer-exchange-words",
            "id": "5eb82a5c38c8bf1260379c3817354194",
            "img_src": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
            "timestamp": "Jun 5, 2022Jun 5, 2022",
            "title": "This Week on Crypto Twitter: Elon Musk and Dogecoin Co-Creator Jackson Palmer Exchange Words"
        }
    ],
    "length": 12,
    "timestamp": 1654538181.5106719
}